{"name":"Review_Text","index":[2617,2618,2619,2620,2621,2622,2623,2624,2625,2626,2627,2628,2629,2630,2631,2632,2633,2634,2636,2637,2638,2639,2640,2641,2642,2643,2645,2646,2647,2651,2652,2653,2654,2655,2656,2657,2658,2659,2660,2661,2662,2663,2664,2665,2666,2667,2668,2669,2671,2672,2673,2674,2676,2677,2679,2680,2682,2683,2684,2685,2686,2687,2689,2691,2695,2696,2698,2701,2702,2703,2704],"data":[["Love the current development of the game, looking forward to the full release!","A very good game only had it a few days and done over 50 hours and planing to do a lot more. in the few days since i had the game they  done quite a few up-dates making the game even more better. Can be one of the best games around when they finish it , if they carry on like that.Sadly they changed it all, No longer do you need to grow food or get water. I don't view this as a survival game any more, Its more of just a building game now and a poor one at that. It had so many things going for it and they ruined it by taken everything good away form it. So that's why i changed my vote.","this game is great i hope it gets a lot of updates","yes it is early access but the idea of the game is great.i cant wait to for more to come to this game","This is a really fun game but my god i played it for 5 hours straight and automated everything and started to work on pixel art  and my game crashed and it didnt save i have to fully restart please add a auto save to the game","27 hours into the game, and I have to say that it is amazing. Best early access game I have played.I love the graphic style. The gameplay is amazing, And continues to get better as its patched and updated.The coding aspect of the game, although was intimidating when I first opened it, is actually really fun and adds so much more to the game. You lose yourself in setting up systems - from lights to complex automation.The dev is extremely active and updates daily since launch, taking the discord communities suggestions and bug reports and making sure they are handled quickly (although I am certain this will slow down as time goes)If you were to only buy 1 early access game in your life, Make it this one. Make sure you join the community on the discord, as everyone there is extremely helpful and everyone shares ideas and systems they have come up with, As well as it being a good place to voice your opinions and suggestions.","I'm really liking the game so far, the programming espacially is a very cool feature but it's not perfect yet.The game needs some more content and some bugs need to be fixed. Also some quality of life features need to be added. For examle: there is currently no way to save without quitting. And regularly saving without needing to completely reload the game would be nice because the game has already crashed on me.But I am exited to see what this game will look like in when it fully releases and I don't really mind the issues that much since it's a really early state of the game.I definitely recommended you to pick up this game, it's got a lot of potential and it's really fun already.(edit: played it for another half an hour and had 2 more crashes, kinda pissed now)","The only thing I have tried in this game is running from robots. There should be done something about this, so players can do something else than running from robots...I wait for an update for a playable game...","cool","The idea has potential, but the game needs more content and polish before its worthy of its $20 price.There does not seem to be a goal to work towards to and despite being said to be similar to Factorio, there is not much complexities in the automation that might appeal to Factorio's players.I am guessing that the game is tackling too many things at once, from survival to automation to exploration. Perhaps something to keep in view in the future, but I could definitely say not now.","While it's a really basic game currently, it's actually pretty damn good, even played it longer than a higher priced game due to it's easy learning curve, simple mechanics and somewhat good ability to relax.It's not on the same level as satisfactory, factorio or even autonauts but i really want it to get to that level, i wouldn't think multiplayer would be a thing to this as it's not currently in the release build but with the minimal items in game, it's still possible without too much trouble.","fun game, anal like me, still small and not much to do, but the automation is fun to play with. Now at day 29 and still haven't found a women.Day 37 and no woman, now my poop is turning blue from to many blueberry muffins. Guess I should switch back to potatoes.Day 41.........Robocide.........Day 43 hmmmmmmm","Absolutely Heckin' Epic!","So I'm only a couple of hours in and so far the game seems ok, it's a pretty solid foundation for a game which could be very deep and interesting. Here's a couple of things I think that are really good about the game, then I'll move onto areas which I feel that the developers should focus their efforts. 1 - The graphics are simple but clear, this will work well when the game becomes a lot more hardware demanding once a few thousand objects are flying around the place, keeping the game nice and accessible to players with budget machines. 2 - The setting is quite interesting, I imagine it would make for an interesting procedural terrain generation and works well with the survival\/mining theme. 3 - Although a little testing at times, the snap together modular construction is ok. There are a few issues I can see in the long term, but I'll go through that in a mo. 4 - The programming element of the game is ingenious. I've seen the same thing done it games like Scrap mechanics, but to do it in this sort of survival\/factory game is brilliant. It will be very interesting to see how far this can be taken. 5 - The battery system is very cool, this also has a few issues in the long term but I will move onto that in a mo. All together this game is looking like a good basis for a strong and deep production game.Onto the stuff that's not so good or that might prove problematic from a game design point of view.  1 - The snap together building system doesn't lend itself well to allow building on different angles or on slopes. I would focus my efforts in producing corner conveyors that can snap to two straight segments at varying angles from each other. Having everything set to 90 degree increments might work in Factorio, but in a game like this, there is a definite need for adjustable corner pieces. This would mean you can build belts over long distances and up or down slopes if you made the belt orientate themselves to the ground on placement. Imagine how difficult it's going to be to get a remote oil field connected to a base across the map when the items have to be placed on an arbitrary grid system once pipes become a thing. 2 - The resources are far too scarce, this is more balancing than anything else but if the aim of the game is to build a base and a factory to produce items. Then I need to be able to either A, transport the resources over long distances without having to spend more resources than I would earn by doing so. or B have enough resources to begin with to not have to worry about moving too far at least until mass transit becomes affordable. I also need much bigger ore patches. I burned through 650 iron within about 2 hours of play without even building a real base, just a few dozen machines in the starting area. I also ran into a problem whereby I didn't physically have the space to build any more miners. Now I have to move my whole base to the other side of the map to find a reasonably sizes iron pile. 3 - The \"battery\" requirement for all machines is a bit of a double edged sword. Firstly, it means you could have upgraded batteries in the mid and late game which is cool I guess, with the option of having laser rifles and energy weapons which use them as ammo or something. However it all but removes the ability to include any form of central power generation. And wouldn't that be a logical first step in generating power? At the moment the batteries take little to no effort to make and they're just a pain to remember to replace batteries constantly and you keep having to walk out to your machines to find them and put new batteries in. Having a large power plant, and power lines spanning across the map would look quite interesting, but this isn't possible as it would take from the requirement of batteries, which is quickly becoming a core mechanic. 4 - Water is incredibly slow to generate. While I understand the need to maintain a level of challenge, I think the water requirement is a little nuts at the moment. It's apparently harder to pull a bottle of water from a puddle than it is to pump oil out of the ground with a pump jack (Although I suspect that it's largely down to having to wait for an empty bottle to simply materialise out of thin air.. Perhaps a way around this would be to not include the water bottles until later versions of the water pump. Maybe just have it act like a drinking fountain where you can replenish you thirst but can't carry the water away, this would remove the mystical plastic bottles. Anyway, long story short, the game has a lot of potential and is a fairly solid foundation of a game with a lot of opportunity to shine. However, the toughest decisions which need to be made in designing a game (or anything for that matter) are made in the first few months, after which, without proper design intent, it can be really difficult to change a fundamental mechanic without unravelling the whole game.","It's pretty good, but a bit plain. I'll definitely check up on this in a few months tho.","Really loving this game. It scratches the right itch for me","This Game in Early Access Isn't really that bad of course it gonna have Bugs here and there but that's the point of Early Access, and to those who ask if there's going to be multiplayer in the near future try going to Their official Mechanica Development PageLink: https:\/\/trello.com\/b\/EudNWWd9\/mechanica-development","Keep in mind that this review was written just days after the early-access release.I'll start with what I dislike:The graphics and art style is very washed-out and \"dusty.\" Looking at it depresses me. This is to be expected with a post-apocalyptic setting, but I think the assets could use some love even so. I recognize the skybox as one I've used before for demos and things - just pulled off the internet.The minimum\/recommended requirements are optimistic - I tried running it on an old 2012-era laptop with a Core-i7 processor, Intel HD Graphics 4000 integrated GPU, and 8 GB of RAM. I had to turn everything down to the lowest settings and run at 800x600 resolution for it to play decently. Considering that the machine basically met the recommended specs, those probably should be tweaked.Overall, however, I like the direction that this game is taking. Buildy\/automation games that have actual enemies to defend against is something that we need more of, and Mechanica is headed in the right direction. I look forward to the game getting some more interesting maps and becoming a bit more vibrant hopefully. It's worth supporting and following.","Amazing game for early access with simple programming built in. Amazing early access Content and I cant wait to see what direction the game ends up in!","Chased by the robot in like 2 minutes.There is no escape. No matter how far you run the robot chases you.I have no weapon (Neither the pickaxe nor the programming tool can interact with the robot and that's all I found within 2 min)Dead.Well.","This was an instant buy for me when it dropped on steam. After seeing a couple of videos on YouTube, I knew I wanted to try it for myself.I've had a really great time with it so far!I know this is a really simplified way to code\/ program but I have never coded or programmed a thing in my life and it's been super easy for me to get deep in to this game. How satisfying it is to imagine how you want something to work in the game.. and then finally program it to do exactly that. While it does control really fluidly, I would like to see some QOL improvements with inventory management and moving items to\/from inventory to storage containers.Love the game and I am very excited for what the future will bring to it! Anyone can get in to this game and figure out how to program the various things (because they really have made it that easy) and so I would recommend it to everyone","Fun little survival\/crafting game. Only problem I had: it was too easy, I hope it gets stronger enemies later on.","This is very early access, but it has SO much potential. The building machines and the potential for production lines. I can't wait to see what is added to the maps for exploration and different weapons... enemies... Looking forward to it.","I'm enjoying the game so far; even for being in early access, there's plenty of things to do, learn and explore, and it feels pretty polished, i have yet to find any bugs. I really liked the programming feature, is very intuitive and straightforward. If the devs add an online mod to it, it will surely become popular. Looking forward for the future of this game!","I heard about Mechanica only a week of so prior to release and knew it was a game I wanted to get. So far I have not been disappointed.TL:DR - Mechanica is a great game even in this early stage and is only going to get better. Well worth the purchase. A bit more in depth review lies ahead if you want to read it.The game is super simple on the surface. You build a base and  set up some machines to do things for you be it resource gathering or defense. It's what lies underneath that really makes this game great; the programming. This game has so much potential and from what I have read the Dev seems pretty dedicated to it which is great. It's the first time I have ever bought an early access game on release day which should show how confident I am that this game will go to great places.EDIT (June 15, 2020)I felt it was time to update the main body of my review since the game has now been out for a little while. My view of this game is still very positive so that is one thing that has not changed!PROs:- The developer has been releasing regular updates and has added quite a bit of new content since release.- The programming aspect keeps getting better. The developer keeps adding new functions which is awesome. The programming in this game is honestly the best part. It is very well done.- The power update was one of the best updates yet and was something I really wanted to see added. There will be a note of this update on the cons section as well but overall the power update was game changing, in a good way!- It's hard to find a lot of things to say here, the game is just good overall if base building, base defense, survival and programming is something you are interested in.CONs:- There is still only one type of enemy- Some more building options would be nice- Some new player help weapons would be good- Late game seems to be constant robot mobs. It's very relentless and sometimes you just want to build without the constant interruptions. Having a way to disable the factories for a day or two would be nice. Note: this may no longer be an issue with the difficulty level update I just haven't been able to test that update yet.- The power update, while overall excellent, has also made one of my games unplayable. The problem occurs when you create a massive power station. I wired together approximately 60 solar panel and 60 power banks that would be able to power my main base day and night. After connecting power lines the game lags so bad I cannot play. NOTE that this is only a problem with a very large set up, with smaller builds this is not an issue and works great. This problem has persisted for a while although it looks like there may be a fix in the works.NOTE: My cons list is longer than my pros list. I am critical of this game because I have put a decent amount of time into it already and it is much easier to note things that bug me than those that do not. Again, Mechanica is a very good game that I highly recommend if you like survival\/base defense\/programming. Mechanica is still early access and I am very confident that all of the cons I have noted will be fixed in time. I will probably find more cons as things progress but that is the nature of early access, and games in general.Have fun everyone, this game is well worth the purchase.","great game for just coming into early access pretty polished no problems so far keep up the good work this game has real potential keep up the good work!","really like the game idea and am hopeful for its future and may get a copy for me and my partner to play together at some point but 8\/10 would recommend but dose have a few things that will most likely be fixed soon","Considering it's early access it's already fairly complete! So far it's been a lot of fun, can't wait to see how this game evolves. Keep up the good work.Personal wishlist:- Solarpanels or wind turbines- More intuitive controls (more hotkeys)","Great Game! Super fun to play. I WOULD definitely recommend this game to people who like automating and surviving against what may come across your path. Although i want to mention, i have found a kinda major bug, it is when the game receives a update (those are great!) it closes down the game  without  saving so i just lost all my progress i did today.    Fixed Before you start commenting, people, about this game being in early access and there are a lot of bugs, i know that. I'm just pointing out a bug","Please, consider supporting this game. Still have some bugs, like i have some problems saving the game, and it can be frustrating. But, the idea and how educational this game is, makes me want to support it so much, and i really want my kids to play this game one day. Congratz for the good idea and keep it up!","Great start for an Early Access game.","Great Game Would Recommend To Everyone Who Considers Buying ItGraphics Are Really Good Just The Gameplay Is Very EntertainingAlot Of Gameplay I Could Play This Game All Day","Do NOT trust what the description says!this is a horror game! these saw wielding robots can scare the s**t outta you if you're wondering how much copper you still need for a new smelter when they sneak up on your faceother than that and the lack of any kind of player ranged weapon in game is a bit bummer for FPS fans like me plus the first copper field is SO DAMN FAR DUDE I NEED TO SPRINT A WHOLE BAR TO REACH IT AND BACK this game is seriously already a gem, can't wait to see more stuff coming out!(PS: add PVP as well please?","Very nice game, with a lot of potential","I think the game is really great and has a great Potential.  The crafting and placing works very good and the world looks beautiful. Some possibilitys to improve are more different enemies,  possibilitys to improve the tools and weapon, and some litte advancements in the controls, like scroling through your inventory with the mousewheel, ore beeing able to hold a button to get wood and ore.","Looking good so far, definitely excited to see more!","an amazing game very good for basic and advanced programming and an awesome post apocalyptic kind of game and with more content coming soon it will be even better than my scavenging experience already is and with enemies lootable places automation and base building aspects it meets almost every single thing that my dream game would be","Very nice game.I am very interested to see how it develops.Meanwhile I can surely get some gametime in this one","Good game , it has too much potantial.I hope we will see steam workshop in this game.","If you like Factorio or Satisfactory type games, you'll likely enjoy this one.  I've spent about 2-3 hours in game so far and have enjoyed every second of it, except I've really not explored too much.  I've setup a great operation around the gas station, reinforcing the area and building mines\/furnace setups all around.  Next steps is to get into the belts and walls and build out the area and start having supplies brought back to my main area.  I really enjoy the game and can't wait to see what else I can find or think up.  Also, although I've not yet tried it, really looking forward to getting into the \"programming\" aspects of the game.  Great job to the DEVS!","Great game so far, plenty to do, watch out for those pesky robots, (easy to get away from) a nice game over all. will continue to follow this game.","its good just needs some new stuff","The idea of combining gathering, crafting and killing by programming circuits is awesome and makes addictive! The developer put so much care in that system, that I would say it's very close to pass the early access status.The game is also running flawless with Proton on Linux.","Mechanica is a great little automation game, with some survival elements mixed in through food\/drink and killer robots. It features an extremely intuitive yet powerful \"programming\" kit that lets you assign custom logic to your machines and robots.At the time of writing, it has only just released in early access, but is remarkably stable and reasonably polished ; In my 10 hours of playing I encountered only minor issues, stemming from pathing issues with the AI and inconsistencies with the automation logic.The base of this game is solid, and it's current state provides an enjoyable afternoon. The systems in place work well, though a bit of polish in some of the UI elements is still needed.In it's current state, the biggest areas that could use improvement are content and challenge. Considering it's been in early access for a day, that's understandable. I'd personally like to see more machines types and tiers. There are also a couple of gaps in the logic system, where certain edge-cases of logic were not available, or did not function as expected. Some more enemy types wouldn't hurt either; it's far to easy to get unbeatable defense against the 2 types that currently exist.All in all though, it's definitely a fantastic early access release and well worth the price.","---{Graphics}--- You forget what reality is Beautiful Good Not to bad... Decent Bad Dont look too long at it Paint.exe---{Gameplay}--- Very good Good Its just gameplay Mehh Starring at walls is better Just dont---{Audio}--- Eargasm Very good Good Not too bad Meh Bad Earrape---{Audience}--- Kids Teens Adults Human Swearing---{PC Requirements}--- Check if you can run paint Potato Decent Fast Rich boiiiiii Ask NASA if they have a spare computer---{Difficulity}--- Just press A Easy Significant brain usage Easy to learn \/ Hard to master Difficult Dark Souls---{Grind}--- Nothing to grind Only if u care about leader-boards\/ranks Isn't necessary to progress Average grind level A lot of grind Youll need a second live for grinding---{Story}--- Story? Text or Audio floating around Average Good Lovely Itll replace your life---{Game Time}--- Long enough for a cup of coffee Short Average Medium Long To infinity and beyond---{Price}--- Its free! Worth the price If u have some spare money left Not recommended You could also just burn your money---{Bugs}--- Never heard of them Minor bugs Can get annoying ARK: Survival Evolved The game itself is a big terrarium for bugs(Posted two days after EA Release)","It's a great game, you should get it. I could play this game for hours on end","its pretty easy to get to a point in the game where you no longer have any problem (except batteries). but it is in early access so I will cut it some slack. Mechanica is like a combination of scrapmechanic and unturned . the main problem is so far there is only a relatively small map that can be explored in 2 in game days, and thier is no better weapons for your character. 8\/10","It's a great game, you should get it. I could play this game for hours on end","Pretty fun little automation\/survival game. Only played for a hr or so. Can't wait to see where this game goes. Lots of fun! 7\/10 so far. Recommended for people who like automation and programming.","its pretty easy to get to a point in the game where you no longer have any problem (except batteries). but it is in early access so I will cut it some slack. Mechanica is like a combination of scrapmechanic and unturned . the main problem is so far there is only a relatively small map that can be explored in 2 in game days, and thier is no better weapons for your character. 8\/10"],["this game is SUPER cool. In my opinion the only things that are somewhat bad about the game are the fact that the game dosn't have much in the current state of the game and when you get to the end-game stuff, all you can do is automate. Besides those points the game is really fun. I would recommend it to people who like programming, base building, and survival games.","very good game","yes","No idea whats going on, except there's a robot that kills me when i stand still.","Its fun :)","super fun huge updates will be coming soon","I love the programing made simple and user friendly. I manage to code my drones even though I have no programning exp.  Cant wait for more updates, the more the better.","For everyone who doesn't mind the occasional \"Coming Soon Sign\" or a slip up in the enemy-AI, this game is amazing. It perfectly combines elements of crafting, automation, farming, exploring and combat, that gives you freedom to explore the world and the amazing programming mechanics.Even though I started the review with a disclaimer about the \"unfinishedness\" of the game, it is in no way buggy.I would wholeheartedly recommend this to any fan of the above mentioned genres.","Lots of potential, cool concept, love the programming of logic.Needs some Quality of Life adding, but looking forwards to more content.","AMAZING","The game is very bare bones but with the announce of multiplayer and sandbox arriving soon I can assure you that its gonna be good. I'd say only buy it now if you want to support the development or learn some stuff while its newer, but in the coming years I for sure see this game going big.","this is an amazing game because i do code in unity but i can still code when im playing even though its different code and my fps is really bad. otherwise its a great game.","This game is AWESOME! I LOVE the coding aspects and everything you can do! keep up the good work! This game may be great, but they could add LOTS of more features like more weapons, randomized maps, bigger maps, and maybe even vehicles.","Fun little survival game with base building, automatization and a little tower defense. The Idea that you can link machines and create little programs (e.g. link a clock to lights and let them turn on automatically at night, or link a screen to a box to see the amount of goods) is also neat.The resource harvest reminds me of factorio or satisfactory with the smelters and auto miners, but there is currently a lack of content to give me the same feeling as those games. The potential is there, but currently there are only a handful of machines and defenses you can build and only two types of enemies. Also, the desert world in which you spawn is very bare bones with very little in it.  With more content and polish this game can really become something great. I just hope the game doesn't turn into one of those early access games which get abandoned by the developer, like so many others have. At least for the moment updates happen frequently and I really hope this game will fulfill it's potential.  But only time will tell","NOTE! Very early access review, gameplay is fun, but it is very lacking. a few hours in and you can build everything and have the map explored.  Then you start to experiment with the buddy bots and programming the miners and factories.   one thing many people miss (can tell on YT), including myself, was the rightclick menu when you program, there you find the function and logic blocks needed. ;) Right now the game is very limited, but if you are into the kind of games with automation, programming etc, i think this has a huge potential, now it is all up to the developer to follow through on this quite good start.","This game is so cool you can program (that's what i like) and i never seen a game like this!","Great game lots of potential in it not a ton of things to do right now but it is early access after all so that is to be expected","This is game is possibly made by one person and it's great. Small as you might imagine but there is multiple hotfixes a day and responding to community feedback, even already adding in some of the more requested Quality of life features. I see this game going places, I recommend it because I cant say no, and there isn't  a \"in a little bit\" button.","Although this game has some bugs currently (given by the fact that is only about a week old), this is a great game otherwise! There is a bug that I keep running into, my automatic alert systems keep bricking and wont even respond to manual inputs and sometimes result in the game crashing. I believe this is somehow due to the fact that I have about 30+ links going around the place to help with automation. Please fix soon.-VGamerPlaysp.s. an auto-save function would be nice, thx","This game has alot of potential. Enjoyable and simplistic mechanics including programable buildings. But It feels extremely empty, and the threat of robots after a couple of hours of gameplay (around 6 hours) loses its fear factor, I did have 1 scare as I was setting up more traps. You are more likely to be killed by your own traps than the robots, and the game sometimes feels so slow, online multiplayer like The Forest maybe? The game Needs some music or ambient sounds + some more logic for programing (Like Changeable variables \"N\" or \"Z\") as I would like to set up a day counter for decoration.If you would like buy this game, I suggest waiting until later in development in its current state, the devs are constantly updating the game, I still find it enjoyable though.","the robots that follow you around are irritating and the controls are kinda funky but its a good concept and will go far with some fixes","I'm not that far into it. But as it sits right now, i love it. man, im not sure what to do. but it is fun."],["The robots sound like vacuum cleaners and it amuses me to no end as I club them with a bat like the Cylon-toasters they are.","So much fun, a survival crafting game crossed with 'Satisfactory'. I literally cannot get enough of this game and cannot wait to see how it grows and expands.","this game shows so nice potential","i love this game and the developer is putting updates out quickly and has a plain to where he wants the game to go to","Made the game crash with a infinite loop.That's the best way to destroy all the robots once and for all!","Great game with lots of potential. Solid programming interface reminds me of working with industrial PLCs in a way.","Yes I love the game its still very early, but i would definitely recommend the game. Although i believe the developer should add both multiplayer and upgrades to buddy bots(speed\/amount carried).","Gets boring after almost 2 hours into the game, I had to get a refund mostly because it got super boring, I would say the game is definitely not worth $20 more like worth about $7 at this time because early access games shouldn't be much due to the lack of good game play in some games like this. I expect better maps later on into the game because the desert map is just way to boring and yes, I understand its in early access but anyways I hope seeing big updates coming soon.","still wip but good","Very fun, regular updates","This game was one of the games that, as soon as I saw it, i wanted to get it. After playing for a little while, i noticed that all of the machines could be automated. I've had trouble trying to make the conveyor belt tilt up so i can transport ores up to my base (I have it built on the beached boat) but i cant find a good way to do that without loosing all them when they start to shake. But other then that its is a very in depth game that allows almost complete freedom of building. Definitely would suggest to get.Oh and BTW, for any one who has the game, I believe the little robots that take pictures of you are scout drones. if you hit them, a bunch of murder bots will come for you at night. They are good for farming bots.And if any of you have a good way of transporting items up and down, please tell me how.","even though it just came out, i like it, the reason i wanted to play it is because Z1 Gaming showed it","ROBO MEANrobo niceand by nice i mean that i brutally murdered it and took all of its loot","This game is a ton of fun. Would recommend to anyone who enjoys a good survival game. Definitely recommended!","This game is awesome! For an early access, there are already enough features and enough gameplay to make this weeks if not months of fun. I can't wait to see more.","looking at the trello board and seeing that the dev has a lot planed, and has a very helpful discord community to me makes this a good game in its self. that and the block programming has some fun and hard challenges that in the early game is entertainment enough.","$20 is a little on the steep side for what you get right now, but the game is amazing. Super unique and everything that is currently in the game is done well. seems that most of the negative reviews are just from people who played for 5 minutes and got killed :\/"],["This is a great game, very relaxing, let's you toil ahead in the desert, doing your little endless mindless things. Every once in a while you kill a robot and contemplate the horizon. Bliss.","its cool","realy good for it to be in early access","This game is very fun and I enjoy the programming aspect a lot. If you aren't good at programming don't get turned away, there are guides to help you. The only things I have an issue with is the lack of an auto save feature and the fact that you don't get batteries back from machines you put down, I understand not getting fuel back but not unused batteries. At the end of the day though, I give this game a 7\/10 and I recommend it. This rating will likely change as the game is developed.","In my opinion, not yet ready for prime time.Played for like 20(?) minutes, I'll be requesting a return. :-(Cool stuff:- Valid programming concepts (objects, functions, event listeners, variables)- environment looks kinda cool- seemingly solid crafting \/ base building (if you're into that)Not cool stuff:- not a very polished look (not the end of the world, rimworld is great and that's not a looker either)- runs really poorly - had to turn settings down to med. on my 1080p laptop with an i7-8750h + gtx1070 just to get 60fps, and even then the fans were pinned. Yikes! :-(- kind of seems like a figure it out on your own kind of game, and not in an \"explore and discover\" kind of way, more like \"we didn't finish the game\" kind of way- lack of compelling narrative, feels kind of pointlessI'll check back in 6-12 months, might be something i'd enjoy more then! :-)","I RECOMEND DIS GAM. IT IS SO FUN, EVEN AS AN EARLY ACCESS GAM, IT NO FEEL EARLY ACCESS.","Fun little programming \/ survival \/ optimization game with good potential. There's not much for late-game content, but considering it only recently came out, I expect it will eventually improve.That being said, there were some tedious issues I did encounter, such as:- Moving items deletes their batteries- Moving items deletes their programming- Moving items deletes their references in other programs that use them- Referencing way-points for helper bots is a nightmareAlthough most of those issues could easily be fixed with a simple re-positioning tool, I think it would be nice if there was some kind of way to template \/ copy code from one machine to another without having to re-program the same setup.I also think it would be a wonderful addition to make the helper bot's drop-offs and way-points into a global list. For example: currently, if you want a helper bot to move items between way-points, you need to hoof it there yourself while in selection mode. Once there, left click on the bin. Congratulations! The program now knows which bin you were referencing. You only need to do it for the second bin and redo both every time you move the button. That alone - especially when there's no moving tool - is a chore.It would be far more expedient to let players name their bins (and their way-points and their sentries and whatever else they assign one of their schizophrenic personalities to), show them all possible items in a drop-down list, and identify them like that from the programming interface. Letting players name things like \"base front turret\" and presenting them with those options in the programming interface, rather than tediously selecting each with your tool, would make programming a lot easier.Despite my gripes, I did enjoy the game. It's simplistic enough that anyone can get into it - even those new to programming. It does have the potential to improve and I hope the developers continue on with it into a fully-released game. Good job, Deimos!","I do love the style of this game! It brings real world skills, such as block coding, and strat into the gameplay.The graphics looks great, and fun! it get updated frequently, which i love!"],["at the moment this game is not worth the 20 dollar price tag, but dont misunderstand me. this game has A TON of potential, it has interesting game play mechanics. it just doesnt have the amount of content to warrent the 20 dollarsedit: So far the progress on this game has been amazing, the features added are very nice and i believe that the game will be worth the 20 dollars shortly, the robotic reboot is an interesting update and i look forward to where the game goes in the future","i love it","This will be a great game, get practising now!","good game super good","This game is really good. I cant tell you what you like and dont like so here are some features and reasons why you MIGHT like the game.The features include factory constuction\/ managment of factories, base defence and the game doesn't have a goal so you can do whatever you want without the game being pushy on what you should do by forcing you to do it, and nothing else. another feature is the game gives you the tools and not the instuctions so you have to figure things out for yourself (to a certain extent there is a tutorial on a few things)Gameplay: 9\/10 Bugs: 10\/10 graphics 8\/10 frequency of updates: 1 month and a half seperation (max)","The game is pretty cool with the programming and the build items are cool.But its sad that the ore is not unlimited and the eddited game saves arent workind correctly."],["It would be nice to have a few more weapons to mount on the speeder, a cutter from a combine harvester (shred those robots) or a decent cannon to blow them away!!!! LOL","It would be nice to have a few more weapons to mount on the speeder, a cutter from a combine harvester (shred those robots) or a decent cannon to blow them away!!!! LOL","Jes very gud","I love this game, I currently don't have many hours since I bought it yesterday, but it's amazing for an early access game. The only thing I could really recommend is a multiplayer function.","I love this game, I currently don't have many hours since I bought it yesterday, but it's amazing for an early access game. The only thing I could really recommend is a multiplayer function.","Jes very gud","In love with this game. Kept me busy for hours and loving it on how it works","In love with this game. Kept me busy for hours and loving it on how it works","Early access sometimes puts up red flags for people. Don't let that stop you with this one. It's fun.","Early access sometimes puts up red flags for people. Don't let that stop you with this one. It's fun.","Game had very little depth, however after recent overhauls of parts of the game, it is quickly becoming my favorite \"factory\" game. I hope the developer continues to work on these important updates, and adds support for other operating systems, as I can see a possible increase in player count","reminds me a bit of Sir! your being hunted..... minus the Posh bots, getting chased by buzzsaw bots, and no ranged weapons, apart from a turret who really needs a visit to the engineer and a tesla coil that will just as soon as shock you as the enemy. Now, I will say this, while I like it, I'm concerned by the rather limited resources, lack of armor, medkits (thankfully, you do heal if your food and drink are full) a decent ranged weapon or even a different melee weapon apart from scouts bat. The speeder, while a nice touch, points out the problem even more. you still have limited iron, copper, lithium and so on. No rechargable batteries, or reusable oil barrels and gas cans, something you really need in a game like this, due to the finite resource deposits..... and maybe a way to harvest the enemy bodies once you kill them, so you dont have them cluttering up your base, and get extra resources from them apart from maybe one or two things, three if you're lucky.....but, this is a early access game (least at the point of the review.) im hoping its updated soon, and the issues patched.","reminds me a bit of Sir! your being hunted..... minus the Posh bots, getting chased by buzzsaw bots, and no ranged weapons, apart from a turret who really needs a visit to the engineer and a tesla coil that will just as soon as shock you as the enemy. Now, I will say this, while I like it, I'm concerned by the rather limited resources, lack of armor, medkits (thankfully, you do heal if your food and drink are full) a decent ranged weapon or even a different melee weapon apart from scouts bat. The speeder, while a nice touch, points out the problem even more. you still have limited iron, copper, lithium and so on. No rechargable batteries, or reusable oil barrels and gas cans, something you really need in a game like this, due to the finite resource deposits..... and maybe a way to harvest the enemy bodies once you kill them, so you dont have them cluttering up your base, and get extra resources from them apart from maybe one or two things, three if you're lucky.....but, this is a early access game (least at the point of the review.) im hoping its updated soon, and the issues patched.","Game had very little depth, however after recent overhauls of parts of the game, it is quickly becoming my favorite \"factory\" game. I hope the developer continues to work on these important updates, and adds support for other operating systems, as I can see a possible increase in player count","not enjoyable for myself"],["Very fun mix between Satisfactory and Minecraft. The author is constantly doing new updates and is very open to suggestions. Great early access game.","Very fun mix between Satisfactory and Minecraft. The author is constantly doing new updates and is very open to suggestions. Great early access game.","satisfactory if it wasnt satisfying but terrifyingsome form of grace period when starting to get a grip on the game would be nice37\/48 jellybeans for scaring me and everyone in my house whenever the dreaded saws are in earshot","satisfactory if it wasnt satisfying but terrifyingsome form of grace period when starting to get a grip on the game would be nice37\/48 jellybeans for scaring me and everyone in my house whenever the dreaded saws are in earshot","so fun game :) love the programing aspect of it","so fun game :) love the programing aspect of it","This game for its price is pretty solid and is still getting updates. My big issues with this game is the coding part of the game needs some more(specifically a repeat command) to help with buddy bot, and more player weapons currently there is only a bat. For what it is right now it is really fun and plenty to do.","This game for its price is pretty solid and is still getting updates. My big issues with this game is the coding part of the game needs some more(specifically a repeat command) to help with buddy bot, and more player weapons currently there is only a bat. For what it is right now it is really fun and plenty to do.","awsome game you should check it out awsome new updates i can see in the future","awsome game you should check it out awsome new updates i can see in the future","If you want a fun way to practice coding, this is a great game!  You'll need a basic knowledge of coding, but a very basic knowledge, in order to start poking around and figuring it out.  At present you need to know exactly what to do to survive at the start (mine your iron, get your steel, run from the robots if they see you, then fortify the gas station) but hopefully future additions will allow more poking about to find the best ways to survive especially at the start.There are some bugs and glitches, but minor ones, and just a bare amount of features map and exploring.  Unlike a lot of early access games (and games in the earliest stage of early access) though this game is completely playable with its entire core mechanic fully usable.  There's no autosave, so remember to save often in case one of those rare bugs does happen.One con I would like to point out is the lack of held buttons for mining\/cutting down trees\/hitting robots with a bat.  This probably won't be an issue for a lot of people, but as someone with carpal tunnel and other hand issues it made it more challenging at first.  Hopefully this too will be addressed in future.I am very much looking forward to updates and new features, building pieces, robots, sensors, crops, maps, etc. because this game has a lot of potential and is already very enjoyable.","If you want a fun way to practice coding, this is a great game!  You'll need a basic knowledge of coding, but a very basic knowledge, in order to start poking around and figuring it out.  At present you need to know exactly what to do to survive at the start (mine your iron, get your steel, run from the robots if they see you, then fortify the gas station) but hopefully future additions will allow more poking about to find the best ways to survive especially at the start.There are some bugs and glitches, but minor ones, and just a bare amount of features map and exploring.  Unlike a lot of early access games (and games in the earliest stage of early access) though this game is completely playable with its entire core mechanic fully usable.  There's no autosave, so remember to save often in case one of those rare bugs does happen.One con I would like to point out is the lack of held buttons for mining\/cutting down trees\/hitting robots with a bat.  This probably won't be an issue for a lot of people, but as someone with carpal tunnel and other hand issues it made it more challenging at first.  Hopefully this too will be addressed in future.I am very much looking forward to updates and new features, building pieces, robots, sensors, crops, maps, etc. because this game has a lot of potential and is already very enjoyable.","It's a great game. Needs a bit more content but it is coming.","It's a great game. Needs a bit more content but it is coming."],["I think there's a lot of potential here. Felt pure joy when I figured out I could loot everything in the gas station and other places. On another note, I have a nicely furnished base.","This game has a lot of potential! It is definitely a must.","I think there's a lot of potential here. Felt pure joy when I figured out I could loot everything in the gas station and other places. On another note, I have a nicely furnished base.","This game has a lot of potential! It is definitely a must.","There are a lot of things that make this game great. There are also a lot of things that make me want a refund. PLEASE for the love of god if you were thinking of getting this game. Put it on your wish-list and come back in a year. My main reason for this recommendation is that there just isn't enough in the game right now to suffice $20. If that's all your willing to read then that's my recommendation for that amount of information.[i\/Now onto the deeper stuff:[\/i]Survival:The survival elements in this game are what I would call \"Minecraft like\" in that they do exist, you have to keep up with them, but after like 30 minutes you never need to worry about food or water again. This is further highlighted by how slowly they drain and how easy it is to both grow crops and craft blueberry muffins which gives both a lot of hunger and a little bit of thirst. This is even MORE highlighted in terms of the enemies. They're not a threat. Unless you don't see or hear them coming they are just annoying to say the least. The amount and variety of defenses and defensive building strategies are awesome and I made plenty of careful designs that killed robots in interesting ways. The main detractor of these robot enemies is that there are only 2 and the 1 that actually does try to damage you doesn't destroy buildings or understand doors. This was proven to me when I build my first foundation of my base. I lifted it off the ground a little so that I could jump into it, but not enough so they robots could get in. Whenever they would come to my base I'd sit  on the edge hit them in the face and collect the drops. It was so boring that it became a pain.Crafting:I actually have mixed feelings about the crafting. It's not as good as factorio's and kills it on the amount of time it takes to make anything. Literally instantly that is. The one thing I would want added is just like in factorio when you have all the raw ingredients, but not the actual components for it to just craft them and let you make the item anyways. The costs for all the resources are quite far and the complexity that's allowed from the initial cost is super incredible. Just like satisfactory and factorio the machines allow you to automate a lot of the processes. The downside is that there's almost not a reason to. Once you get a bit of steel processing and copper processing. You're set. You won't need to worry about anything for a while. The only real thing that keeps you on your edge is that the resources don't have that much in them, so you have to move around to different ones if you play for more than like 2 seconds, which makes it kinda useless to set up large mining sites because it's depleted by the time you have everything set up. Overall the crafting and resource management are par to minecraft's. You can technically do a lot, but it's quite unnecessary. At least minecraft, factorio, and satisfactory have a bunch of different reasons and goals to drive you to automate and craft.Programming:This bit was my favorite as I partake in indie development a lot and do it for fun most of the time. The visual scripting language the game provides is good. Very awesome once you figure out you can right click to open up functions and operations that aren't on the objects themselves. (If you buy the game and want to do the programming. Whenever you press e with the programming tool on an object right click to open up a menu with a bunch of different functions.) That functionality took me a while to figure out and I think I almost quit because of it. The programming is missing a couple of things that make it difficult. The UI is a little difficult to maneuver and you can't EVER copy code. This is the biggest turn off for me. If I set up a system to turn a light red when there isn't any fuel in a furnace and expand to make another mining base. I have to make all that code again. It might just be 12 clicks or so, but it really makes the process a bit repetitive. In full it's something I wanted factorio to have in it instead of the logic objects that take up quite a bit of space. With this you can make one object the arbiter of logic to run your whole base and it feels like all that nasty code stuff isn't even there. It's quite something if you take the time. Yet again though it's almost unnecessary. I never ever found an actual reason to make switches to turn everything off, or a screen telling me the count of resources or what not. The only reason i actually did that was because I wanted there to be a reason. I wanted a purpose to the time I spent in the game. I didn't need to do that cause I never turned anything off or needed to know the exact number of resources in a specific container, so i could make automative decisions about certain engineering choices.Machines:The machines you can make to automate everything you'd need are good and lacking in some areas. Like with factorio there are splitters and inherit functionality to merge two lines together by just aiming on into the back of another. That doesn't work in Mechanica and splitters don't exist as far as I can tell. The outputs and inputs are placed nicely, but some are flawed because they don't have an internal storage. This makes it almost impossible to balance certain functions without a splitter or overflow conveyor. to prevent objects from dropping to the floor and only being able to be picked up with sucking machines that require batteries TOO. This is my main contention with every machine. They ALL require batteries. Now they're not difficult to make just difficult to put into some machines and automate that process.Final ThoughtsThis is a decent game for what it is in the current version I played in (1.0.10). Currently though I don't think it has enough in it for $20. It provided me with a couple hours of entertainment and I'm grateful, but I probably won't play again until a couple major updates. Hope this helps with your purchasing decision.","There are a lot of things that make this game great. There are also a lot of things that make me want a refund. PLEASE for the love of god if you were thinking of getting this game. Put it on your wish-list and come back in a year. My main reason for this recommendation is that there just isn't enough in the game right now to suffice $20. If that's all your willing to read then that's my recommendation for that amount of information.[i\/Now onto the deeper stuff:[\/i]Survival:The survival elements in this game are what I would call \"Minecraft like\" in that they do exist, you have to keep up with them, but after like 30 minutes you never need to worry about food or water again. This is further highlighted by how slowly they drain and how easy it is to both grow crops and craft blueberry muffins which gives both a lot of hunger and a little bit of thirst. This is even MORE highlighted in terms of the enemies. They're not a threat. Unless you don't see or hear them coming they are just annoying to say the least. The amount and variety of defenses and defensive building strategies are awesome and I made plenty of careful designs that killed robots in interesting ways. The main detractor of these robot enemies is that there are only 2 and the 1 that actually does try to damage you doesn't destroy buildings or understand doors. This was proven to me when I build my first foundation of my base. I lifted it off the ground a little so that I could jump into it, but not enough so they robots could get in. Whenever they would come to my base I'd sit  on the edge hit them in the face and collect the drops. It was so boring that it became a pain.Crafting:I actually have mixed feelings about the crafting. It's not as good as factorio's and kills it on the amount of time it takes to make anything. Literally instantly that is. The one thing I would want added is just like in factorio when you have all the raw ingredients, but not the actual components for it to just craft them and let you make the item anyways. The costs for all the resources are quite far and the complexity that's allowed from the initial cost is super incredible. Just like satisfactory and factorio the machines allow you to automate a lot of the processes. The downside is that there's almost not a reason to. Once you get a bit of steel processing and copper processing. You're set. You won't need to worry about anything for a while. The only real thing that keeps you on your edge is that the resources don't have that much in them, so you have to move around to different ones if you play for more than like 2 seconds, which makes it kinda useless to set up large mining sites because it's depleted by the time you have everything set up. Overall the crafting and resource management are par to minecraft's. You can technically do a lot, but it's quite unnecessary. At least minecraft, factorio, and satisfactory have a bunch of different reasons and goals to drive you to automate and craft.Programming:This bit was my favorite as I partake in indie development a lot and do it for fun most of the time. The visual scripting language the game provides is good. Very awesome once you figure out you can right click to open up functions and operations that aren't on the objects themselves. (If you buy the game and want to do the programming. Whenever you press e with the programming tool on an object right click to open up a menu with a bunch of different functions.) That functionality took me a while to figure out and I think I almost quit because of it. The programming is missing a couple of things that make it difficult. The UI is a little difficult to maneuver and you can't EVER copy code. This is the biggest turn off for me. If I set up a system to turn a light red when there isn't any fuel in a furnace and expand to make another mining base. I have to make all that code again. It might just be 12 clicks or so, but it really makes the process a bit repetitive. In full it's something I wanted factorio to have in it instead of the logic objects that take up quite a bit of space. With this you can make one object the arbiter of logic to run your whole base and it feels like all that nasty code stuff isn't even there. It's quite something if you take the time. Yet again though it's almost unnecessary. I never ever found an actual reason to make switches to turn everything off, or a screen telling me the count of resources or what not. The only reason i actually did that was because I wanted there to be a reason. I wanted a purpose to the time I spent in the game. I didn't need to do that cause I never turned anything off or needed to know the exact number of resources in a specific container, so i could make automative decisions about certain engineering choices.Machines:The machines you can make to automate everything you'd need are good and lacking in some areas. Like with factorio there are splitters and inherit functionality to merge two lines together by just aiming on into the back of another. That doesn't work in Mechanica and splitters don't exist as far as I can tell. The outputs and inputs are placed nicely, but some are flawed because they don't have an internal storage. This makes it almost impossible to balance certain functions without a splitter or overflow conveyor. to prevent objects from dropping to the floor and only being able to be picked up with sucking machines that require batteries TOO. This is my main contention with every machine. They ALL require batteries. Now they're not difficult to make just difficult to put into some machines and automate that process.Final ThoughtsThis is a decent game for what it is in the current version I played in (1.0.10). Currently though I don't think it has enough in it for $20. It provided me with a couple hours of entertainment and I'm grateful, but I probably won't play again until a couple major updates. Hope this helps with your purchasing decision.","its perfect for those who love to automate stuff but has no autosave feature which is a little bit annoying","its perfect for those who love to automate stuff but has no autosave feature which is a little bit annoying","A tiny game with incredibly limited content so far.  It lacks any long term goals, so while I \/could\/ have fun automating to build more resources, there isn't any incentive to do so.  I ended up building a car without even building a base (only a couple of miners that I found in the world, not even crafting those), exploring the whole (small) map, and finding nothing to do.","A tiny game with incredibly limited content so far.  It lacks any long term goals, so while I \/could\/ have fun automating to build more resources, there isn't any incentive to do so.  I ended up building a car without even building a base (only a couple of miners that I found in the world, not even crafting those), exploring the whole (small) map, and finding nothing to do.","Decent game. Can't wait for updates.I normally don't give suggestions but I really like where this game is going1. Maybe add like a progression system, such as unlocking certain things when you craft something first, and implement a Leveling type system of some sorts.2. add wood tools and building. Like you can create a wood shack or something to protect you, but bots can break it if you don't take care of them first.3. Add more weapons that you can hold. Got kind of annoying having to hit the bot 7 times with the bat. I eventually just set up a trap that killed them instantly, but was annoying to go to it every time a bot showed up.4. Decrease the amount of time bots showed up. There was a point where I was trying to program automation and every 2 min bots would show up.5. Maybe not have almost all the items you need to start automation already spawned in the map. Maybe lock them behind a door that you need to level up to craft it or something. I was fully prepared to start hand mining in order to create an auto-miner and furnace, but all I had to do was walk 2 min away from spawn and there were already there. 6. Possible upgrades to bots. What I mean is, like bigger storage, faster move speed, or adding guns or something to act as guard robot.I'm sure they will add something along this lines eventually, and not going to listen to everyone's ideas, but it's just an idea and I understand it's in early access. The game is great so far just can't wait to see where they go. I definitely recommend this game, especially for the future content I'm sure they are going to add.","Decent game. Can't wait for updates.I normally don't give suggestions but I really like where this game is going1. Maybe add like a progression system, such as unlocking certain things when you craft something first, and implement a Leveling type system of some sorts.2. add wood tools and building. Like you can create a wood shack or something to protect you, but bots can break it if you don't take care of them first.3. Add more weapons that you can hold. Got kind of annoying having to hit the bot 7 times with the bat. I eventually just set up a trap that killed them instantly, but was annoying to go to it every time a bot showed up.4. Decrease the amount of time bots showed up. There was a point where I was trying to program automation and every 2 min bots would show up.5. Maybe not have almost all the items you need to start automation already spawned in the map. Maybe lock them behind a door that you need to level up to craft it or something. I was fully prepared to start hand mining in order to create an auto-miner and furnace, but all I had to do was walk 2 min away from spawn and there were already there. 6. Possible upgrades to bots. What I mean is, like bigger storage, faster move speed, or adding guns or something to act as guard robot.I'm sure they will add something along this lines eventually, and not going to listen to everyone's ideas, but it's just an idea and I understand it's in early access. The game is great so far just can't wait to see where they go. I definitely recommend this game, especially for the future content I'm sure they are going to add."],["Great game with a great community!",".","nice game","This is fun because of well to me the graphics and the poly look of the world seem like a nice touch. one thing i would like less of is THE GRIND!! mainly because well it's annoying. other than that everything else seems good in my eyes.","This game is really fun. Just like other survival games progression seems tedious but I had fun creating automated systems with all the things you can build in this game. The programming in this game is also a very unique and cool system that allows for alot of customization. I cant wait to see the updates this game will get in the future. Things I hope for in the future of this game:More enemiesnew resources different mapswaterweaponsweatherpossibly NPCstransportable storages\/trains","Took me around 6 hours to run out of content to explore. At first it looked like alot of things to do, but after a while I realized that there's not that much to do...it is a promising start of a game.Game has few stages: Stage 1 is scavenging for starting out resources and finding a spot to stay. You will have to loot items in world, at least some glass and\/or small screens. they are required for most of machinery and you cannot produce them without glass machine. - this will take ~1 hourStage 2 is setting up basic machinery - water extractor most of all, glass production, auto mining and furnace.Stage 3 is getting basic automation setup and realizing how early access is the logistics and programming is.you will connect your auto miners to furnace with belts and add some robot logic to keep things running.At that point you will be constantly pestered by ever increasing waves of bots that will backstab and constantly otherwise interrupt you while you are trying to program.Stage 4 is building your base since it consumes stupid ammount of resources to setup even basic base.at that stage there's no new things to explore - you are just draining every resource node on a map, roam around in your car and just build biggest and prettiest base you can...Overall I enjoyed that journey quite abit. ranking up resources is satisfying and seeing your automation take root and make previously tedious collection of materials a breeze.Things that I felt are bad, uncomfortable, or upset me:All machinery takes batteries, they are consumable and you contantly need to make new ones to run your machines. there's no option of connecting your machines to generator via wires or recharging said batteries - once consumed, they disappear.Crafts that take Oil Canisters consume them, including canisters. so plastic is actually not really an oil - it's just 2 steel ingots. Same goes to gasoline cans - they just puff out of existence.Logic operators are weird, especially and\/or... instead of giving you resulting boolean it consumes both booleans and just gives you a branch, which comlicates things greatly if you got more than 2 booleans to a logic circuit.There's no indication that you can rightclick in programming interface to choose from list of general functions  - like Or, And, Sum, Mult, Branching, etc.You cannot copy ready logic, so you will have to input again and again to do same things for different machines. You also cannot move multiple operations in programming interface, as there's no drag select... and in fact you cannot select more than one operator at any given time.I felt like some essential variables are missing on some of the machines - for example level of fuel or energy in a machine, I would like to monitor those % values from a base, and not just \"has power\"\/\"has fuel\" boolean.","Very fun and enjoyable.Easy to  around whilst still knowing you have to pay some attention to \"not dying'.","Lots of possibilities, even though the game is just Early Access. Make sure to read the community guides or else you might be lost. Once you \"get it\", it really opens up to you. Has need of user interface enhancements, so we'll see where that goes.","DISCLAIMER: I ONLY PLAYED THE BEGINNING BEFORE I REFUNDEDThe beginning of the game feels very unpolished and boring. I was running around being chased by roboters and mining resources without automating or programming anything. The only progress I made was by finding a premade base (the gas station).I expected a new player experience similar to Factorio or Satisfactory or Factory Town."],["This is a very funny game and the Developer keeps updating it and bring new stuff.It's also a nice introduction to the programming world.","Amazing game, played for about 10 hours and there are so many things left to do. I love the idea of adding all of these variables, they are very simple and easy to put together for someone who has no clue on how variables work. Definitely recommend this game if you like Scrap Mechanic, Satisfactory, and Trailmakers (all I could think of). Enjoy :)","yes good","Still in early access as of 05\/05\/20 but this game is still worth the price. The developer cares about the community and furthering of the game and has loads of ideas to soon be implemented. The game itself feels good and has classic sandbox aspects with the addition of murdering robots and simple programming.","gooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooood","i like the game consept but i would wait for it to get develiped more for now.","..","THE MOST AWESOME SURVIVAL GAME EVER MADE I MEAN AWESOME IS NOT EVEN CLOSE TO HOW FUN THIS GAME IS AND FOR 20.00$ YOU CAN'T GO WRONG.","","My load games are deleted every weekI don't why"],["Has lots of potential. Enjoying the content so far.","good","Right now the game doesn't have a lot of content but it's still fun!Once they add different kinds of killer robots (maybe depending on how many days you've survived in the game) I think it'll be way more exciting to keep playing!","Y E S","The dev is still adding and fixing content regularly. The programming is easier then you might first think. 10\/10"],["This EA game is off to a good start, but it is short on length.  I've been able to run the game w\/o any glitches or problems.  After a few tries that failed, I figured out how to survive the robots by using elevation to keep just out of reach of their saws.  After that, it was easy to make the gas station secure and build a base.  Then the game becomes repetitive and boring.   There are some areas marked for opening at a future time.   Unless the dev provides more playing areas, and adds some more goals or objectives to challenge the player, the game will be short, repetitive and quickly boring.I don't regret buying the game because I like to support EA games that show some promise.  But, although I like this game, I can only give it a qualified recommendation with a warning.  Buy it if you want to support the dev or believe in supporting EA games in general.  But, don't buy this game now if you want a more fully developed game that gives you more than a just few hours of gaming.",".","I cant get it to work","10\/10 Building, coding, traps, automation, all in 3D with great graphics. Endless posibilities, awesome game","If your left handed and like to rebind your keys to the num keypad then miss this for now going to refund till i know you can :("],["This concept of programming in the game is so so cool. I've already learned so much. I would highly recommend","game good but map smallrobot","Lot of potential","Really good game i do recommend this game if you like these types","j","The game is still early access but i enjoyed it. There are lots of features that could make the game even better i highly reccomend it.","It is very fun...","Great game, plenty to do, programming  as simple or as complicated as you like. Program robots, guns ,flame throwers and more. well worth the money"],["This is a survival acquire\/craft\/build game. If you don't like survival, well there's your problem right there.It is fun, quite busy, and appears to be constantly evolving. As in there has been several updates since I bought mine. It has simple coding interface, has extensive materials and many, many items to craft. Using them to build a safe place, so you can let automation farm the materials you need to expand ... and that is the game loop.Look out for robots. Do not engage. Use the baseball bat to wack their head if you're close. Get close and you will die, but you can outrun them and jump. Which they can't do. So, why fight? Build a laser sword trap, let laser dice them for you. Don't get too busy farming for some essentials, because dead robots drop the essential four or five.Good community, several YT channels but be careful because some are out of date. Always check the news.Good Luck, enjoy surviving.","it is atucl very fun"],["I love this game, there's so many things to explore and learn. the programming menu is smart and fun to mess around with a lot of traps. the one i like to use is the tessla coil. the only really negative thing about this game is that items in chests disapear after saving and quiting.","Fun game","really simple mechanics, lovely and smooth to play, don't except rockets, but do expect tranquil peaceful game play, with the odd killer robot or 5","nice","the saving of the game is bugged you lose lots of items when you load your save i had 31 wheat and when i reloaded i had 0","awesome game and this is made better by the automation that is aided by the programming that is in depth but really easy to learn.","Still an amazing game!I am editing this review to reflect how i feel after adding another 120 hours of play time in game and i can tell you that my feelings toward this game have only been reinforced. This game is awesome! The developer has been very vocal with the community and continuously given us updates (both content and where they are at with future updates). Still a very intuitive but complex programming system that is only limited by the player. Since my first review there have been massive updates! I.e Base building, new defenses, enemy types, and so much more! Absolutely worth the 20$*original review*Full of potential and very engaging if youre willing to learn the programming mechanics. If youre willing to learn how to properly program and make various systems work together then you can easily have an entire industrial desert working for you! Please be aware that this game is very VERY early access. Literally released a few months ago so the game is bare as far as content but the programming and assets available now still leave you with more than enough to do","Pretty cool concept, but needs more content. But since the game is in early Access and has only been in development since February (from what I know), this is pretty good. Nice one lads."],["This game falls between recommend and not recommend.  If you are into programming a definite yes, if you're not into programming a definite NO.  Even getting the simplest thing to work is a lot of trial and error.  I've already got it so I'll persevere from time to time, but knowing what I know now I would not have got this game.","This is game fun, such as it is at present.There is about two hours of play in its present state, but I am sure that it will develop further into a real grown-up game.If you like supporting indie developers, then purchase now.If you want value for your money, then wait a year or so.","WOW!"],["it is a good game but it needs more vehicles and an ocean with fish","It is very good, there are many \"quality of life\" improvements that could be done but the game itself is fantastic.Definitively recommend it!"],["ee","its a great game if you wanna get into coding","I recomment this for everyone who likes sandbox survival style games!This game also made to finally buy something in steam...I had steam for 3 years now and havent bought anything until now!"],["This game released way too early even for early access, and the updates don't come fast enough, $19.99 for unpolished game is steep.","iTS OK FOR NOW BORING, LACKING ELEMENTS BUT , i CAN SEE THIS BEEING A FUN GAME IF THE GO TO THE WRIGHT PATH, RANDOM ROBOTS MEH, PROGRAMING LOGIC MEH, BASE BALL BAT WTF GIVE ME A GUN FFS"],["it is ok for early access.","Awesome, awesome, awesome. I love game's like this, just don't forget that right click gives you more functions than what's on the sidebar."],["This game has some very solid fundamentals, but lacks depth. That's sure to come, though, so maybe come back later if you're uncomfortable with unfinished games.","yes","cool"],["It's fun but most of the fun comes from programming so if you are not interested in that than this game is not for you.","Cuke lol","Recently found this game on steam and brought and love it","Unless you have severe ADHD and honestly if you do I'm sure you might still enjoy this game, even if only for a few minutes our hours. The different ways to create, program and build are impressively nearly boundless. As long as you're a fairly creative mind I'm sure you'll find something to keep you entertained in the game."],["This game is incredible, I have never played anything like this and I gave it a shot, I LOVE the drag and drop programming, it is a blast to play around with. I would 100% recommend this game.","I cannot wait to see where this game goes. lots of fun."],["The programming aspect is really expansive and cool, don't let the lack of blocks deter you, there's a massive map to explore, automation to master, with other features still on the way, the potential for the game is massive.","The main gimmick of this game is the ability to make simple programs that connect the various machines and buildables. The concept is interesting and the game is pretty fun, but it's missing a few functions and it's desperately in need of some optimization. It's absolutely fun in the meantime, but you don't want to have too many bots running or you'll get lag.","Game is fairly basic (in the fact that it has limited items and etc) but also not. There's a programming mechanic and that adds to the fun.It can also be fairly hard in the beginning trying to fight robots in a melee fight (usually they end up poorly), but after that it gets a lot easier. Overall, the game is great, and can get greater as it moves out of early access.","Nice Game :D"],["Recommended BUT..... still very early access. Needs more content, better maps, better AI, better graphics as there are glitches. I can see the potential and the programming side is a positive. For now I am happy to support the developer by buying the game and will follow with expectations.","vey fun game just learn how  to program i am 12 and i dont know how to program","IT'S SOOOO COOOOLL","I enjoy everything about this game"],["This game is a good start, I don't think its worth 20$ yet, but seems to have the potential to be.  Excited to see what updates come.  Currently its in the 5$ range, but it seems very early.  I would give a neutral if I could.Good:Programming game yay!Physics for interactions of thingsCool conceptProgramming interface is useableBad:Not much content, like at all.Seems like its built for VR, but not.  OG quake had better graphics. (not that I care personally, but some people might)Bot attacks are mostly just an annoyance. Let me run for 10 minutes trying to program these bots pick up \/ drop off points, oh look I am getting attacked again - have to cancel out of the program to deal.Your bots aren't very useful yet.Moving materials around is a painGeneral UI use is badPhysics for everything. (Items fall out of conveyor belts, gets stuck randomly, etc. )Some features just dont work at allTons of fortress build stuff, but mostly useless.  Are you going for minecraft or factorio?Easy fix suggestions:Split out the inventory and craft window, let me move them aroundDetails on how to add if statements and things easilyLet me pick from a list or something for long distance programs.Long term suggestions:Needs way more to do with your bots - upgrades - equipment, etc.The one conveyor belt is not good, also dropping onto other belts is a painGive me ways to move items, maybe even wacky physics based launchers if you want.  Bots are too slow in general for this, and long conveyor belts are lame, especially with expiring resources.The robots attacking you comes off more annoying than anything currently.More user weapons - the bat gets old and hit detection is wrong sometimes"],["I don't understand why devs think it's ok to realease a game demo that's clealy not even out of alpha with ZERO content.This DEMO of a game has some potential but as it stands right now this is barely a college school-work project. Don't waste your money, not now or probably ANY TIME in the future. I want a good programming game, this is NOT it.  (zachtronics games are boring after 5 min)"],["When I bought the game, I thought it would be more like a \"Stranded Deep\" early access, with a huge map, and a fair share of hours to explore it and its resources. It wasn't. You can explore all of it in 5 hours, 8 if you want to play it slow. There's no story whatsoever, bad graphics (I don't care about game graphics at all, but these are just polygons), the map is really small; it feels as it was an unfinished and abandoned game put on sale, just to see if anyone would buy it as is. If I was the creator, I would have shame to put this on sale.Although the ideas behind the game have so much potential, it remains as that, potential. I really hope this game gets developed as deserved. While it isn't, I wouldn't recommend anyone to buy it at its current state, not even on sale."],["it be a multplayer soon"],["I wanted to like this game, especially after watching tutorials on how to program the different devices. It has a really cool feel to it, and I love the concept. But dear god, if you go over 25 solar panels, the game bogs down like crazy. This game in no way, shape or form takes advantage of all the hardware I have available for it. Even dropping my refresh rate down to 60hz, enabling Vsync and turning the graphics down did nothing but help bump the fps up to about 30 with some bad lag spikes. Its really disappointing because I wanted to play this game more. Its a shame that its basically been put on the back burner update wise."],["great game"],["Definitely a very innovative and nice game. You can expand forts and buildings across miles, along with active NPC combat. You can find multiple ways to protect your bases and inventions, too. There's also robots you can program with other machinery to make factories that build factories that build even more factories. There is no limit to the machines, creations, inventions and ideas you can use in this game.I was a little doubtful if I should or shouldn't purchase the game, especially because it's in early access. I was completely amazed at how I had no expectation of the game being like this. It's almost like Minecraft. You build, expand, and complete. Except with this game, there is no \"completion.\" You have 0 limits to what you can do. You can cover the entire map with buildings, forts, bases, machines, factories, anything at all. And with all the recent updates it has been even better. Plus, you can experiment with machinery and technology by testing out programming tools with robots and other tech.I definitely recommend this game. It's awesome if you like games where you can be creative, but also with technology, and infinite possibilities and experiments.","its like desert sky but with robots that attack in waves and you not in the sky. oh and your a robot. theres plenty of elements that are great but this is still early in the game. i hope theres more to come because i already made serveral death cars and structure so i need a new idea.","This game is quite early in development, but already mature enough to display incredible potential.- Programming is elegant and powerful, yet easy.- Overall style and atmosphere is nice.- Combat system is rather too basic, but it is fine on this stage of development.- Crafting is also too simple, but i can totally see how it can become way more complex in the future.Overall nice niche game with a incredible amount of potential."],["I love the updates in this 10\/10!"],["I love killing robots because why not?","I LOVE THIS GAME!!!!!!!!! and when is a update coming??:D","Unplayable if you are left-handed, since it does not allow keyboard bindings to use anything on the right side of the keyboard other than arrow keys. For a game has been in early access for almost a year, the fact it can't do keyboard bindings enough to allow left handed people to play hints that they will never have the dev resources to take this game anywhere -- or simply don't care."],["Great potential but has it stands not much content.    Can't wait to see what is add and fingers crossed it's not added to the\"abandoned games\" list...","Set Goals it's a very fun game, and every time I play it, it just gets better. But it still needs work of course it is still an  early access . and I like that multiplayer is being thought of, That dose sound amazing for this game but maybe let's  focus on story and map creation , For example a bit  more base creation items .   Just trying to be helpful.","Fun Game Building & Defending your Man Cave against the Robots.","fun time consuming buisenessadhwjaksda","Countless hours of fun, Getting better every update! Trying to get my brother to buy the game cause its that amazing im even willing to buy it for him! Dedicated creator that's for sure! Tons of more updates to come!","great game","Very fun game and it deserves more player base"],["i im :(((((((((((((((((((((((((((((","okay keep it simple.do not buy this yet.i reccomend it, but...  u should wait a little-prosfactory esque gameplay with 1337 HAXORINGok graphicskinda ok ish rate of updatesbarebones 3d factorio-consonly 1 mapquite bare bonesa little glitchyboring sometimesi paid way too much money for this (i think 20 bucks)"],["Not enough content for my tastes, kinda feels like a stripped down scrap mechanic atm."],[null],["good","Great game love the mechanics keep it up!"],["Awesome","The programming mechanics is amazing... you can program any object. I have a LCD screen that alerts me when my power goes off. I programmed my alarm system (and traps) to set at night and turn off in the day. I programmed spot lights to turn green to red so I can tell if my resources are in working order from a distance.This may be early access, however with your imagination and simple coding this is great sandbox game! Looking forward to see where this goes."],["Excellent game, relatively constant updates with a to do list posted for the community to see, needs more community but absolutely great to play.","I see some real potential in this game, though it currently just misses any proper introduction, goal and tutorial. You're just randomly thrown into a world, and introduced to the most basic mechanics of the game. After this you don't get much direction, you just have to do \"something\", whereas I feel like there needs to be something to work towards. I also feel like there should be at least a small, but proper textual introduction to some sort of storyline, all the game is seems to be very random and coming out of nowhere, maybe it would also be a good tie-in with a sort of goal to the game, which will make it feel so much more finished.I understand the game is in early acces and very early development, but at the moment I'm missing a lot of content for proper gameplay. There is many features I could think of that would improve the game enormously, but it's just not there yet. I trust the game will properly grow and become something really cool, which it will with the interesting mechanics that make the games foundation just work. But it just isn't there yet, and especially not worth the current price. Unless you really are comfortable with something so unfinished, I wouldn't recommend buying it for now, instead maybe keep tabs on the game and try it later, as the game will become something amazing, I'm sure of that."],["epic"],["One to keep an eye on.While there's not a whole lot to actually DO right now, Mechanica's got a framework right now that shows great promise. The game feels pretty tight and satisfying to play, the sound design and animations are pleasing, crafting is pretty unintrusive, and the automation systems are interesting, if barebones as of yet.I'd say it's worth a buy at this price just to support its development, 'cause when this starts picking up steam it looks like it'll be one heck of a ride."],["If you see this dev there is a problem of crashing when trying to place something on its side","I like the idea of the game. The programming is ideal and I see the big picture on whats to come. The update with the nail gun caught me off guard with m1grand ping.","I love this game mostly because it reminds me of satisfactory because if you look at then side by side they are almost the same like its build a a factory, fight and craft one problem i have tho is i wish you could still die from like loss of power or losing coolant instead of only being able to die from enemy's only. it would also be cool if there was fall damage","It still has quite a way to go till it is finished just by the feel of the game and the signs that read that the area beyond is still underdevelopment but regardless it is quite fun to work on building up a base that can be defended. start in a prebuilt structure then as you gather more materials and automate that gathering you can expand to a completely player built structure"],["Awesome game. Very underrated.","love it"],["Could be a great game in future, but wasn't something I could get into easily. Will continue to keep an eye on however.","fun once u figure it out other wise its confusing and grindy"],["The world and the game content are limited"],["WAW GOOD","noice :)","Mechanica is so far a dry game but seeing how the game is going I am very excited to play this game when more content comes out. It looks promising but i would wait and see how the game turns out. But the amount of times I've been jump scared by those little ****kers and they say this isn't a horror game. Fnaf has nothing on this game."],["While i recommend the game unfortunately the programming from earlier in the beta has been reduced and hence has been broken and you can no longer have as much freedom with programming machines to be as easily automated."],["This game has so much potential its hard to describe. It looks.. simple, and i love it. I have tried whatever is out there of games. Got most games that have been or is on top list in the multiplayer category. My fav genre is automation and programming games. Other devs messed up scrap mechanic, multiplayer in survival never worked and i waited on that since day one and its still . I mastered trailmakers, factorio, rust, raft, valheim, astroneer, you name it. My side games are apex and sometimes warzone. But what i like most is survival with automation as long as there is multiplayer (singleplayer games is imo lonely graves without memories that you never will be able to share unless you are a lonely streamer who enjoy your own company abit too much). I just told myself to never install satisfactory again because of the unlocking system and awful neverending endless grind that results in bad fps just to get vehicles or the new drone stuff. Dont get me wrong i do have time, but i dont want to waste it. Mechanica is the perfect place for me and my friends. Sure there are a couple of bugs in multiplayer not showing the same things but hopefully this will be fixed. This game is just so fun, being able to code stuff just the way you want it is the best. Vehicles are awesome too, if this was a singleplayer i would never have bought it, even though i enjoy playing it alone whenever friends are not on. I have alot of ideas to this game, but i really think tyler will do good on this one without any help. As long as he steers away from that bad unlocking\/tier system found in games like satisfactory. Among my 200 games, this is the best spent money ever imo. With a tiny bit of work on this, and this game will easily rate better than most top played games today. It reminds me of the crazy valheim hit we are seeing now, valheim is good but there is no automation in it, and thats why i think mechanica is just alot better. Me and one of my buddy has had a splendid time just playing this, we are both website coders, programmers and me myself have done some app dev aswell so this for me this is just so enjoyable. I could understand if this game would get bad reviews, because not everyone know how to program\/code with logic and stuff but there are a lot more of us nerds out there than people think. And for that, this might be the most successful game of 2022. or even 2021 if Tyler is working on it, (also good fps is key for success). Thanks for an awesome game!","the game quality is pretty good would say some things that need to be added to automation that i didnt see so far1. conveyor ramps2.buddy bot program to refuel the generators3. some more power optionsso for the power options i would add a wind generator and a bio fuel generator.now my total rating of the game right now 7.5\/10(may change later)"],["sooooooooooooooooooo COOL","Good base, needs improvements.I played 7.6 hours and I don't know what to do anymore, needs more content.It needs also improvements on performance, ran on a ryzen 2700x + rtx 3070, with ~15 powerbank, ~30 solar panel + machines and some laser sentry with some automation : 10 FPS..."],["robit go bonk"],["Overall a great game, while currently lacking in content, the dev is always consistently adding more.The map is pretty basic, and the combat is too. The programming of each machine can be interesting though as there are a few different options to get the same result. Will be a great game in the not so far future. Right now its more of a trial of what could be, still cool though.","vcz"],["Loving the game so far, really excited for further updates and I'm trying to get \"friends\" to buy it as well","aasdsdsadasdasdasdSADASDASDASDsDSADASDAasdddasdasdsdsdasfxvbgjhhgfbvsdyfsldfhylsDsuchkjsdhcgsdkjcgzdhxdbcsdhcv,zhdcvkjfdsgvcgnvhmsvdcnvmnxvmxhgskyjcgsjdgfuadgfsjhgfesjgefdjszyuakrfyukgdskuysdgauygjkshguvkysdgvgkkuyakdgcksduyadkg hjcgjyu zdgchzkuysdkb fydcnbchfcgabucgbagrybgargbrbgfryafbgygabyucafrbgyfgbrycfbgrcgbyrfbgfrbgjrfbgjabrjbrgcgbrfabgargcyfrbrcfybgycfrbcgfbgcryabgycfrcfrbbgcfaacefbgcbfrfbrgyfbrbgcfacbgrfyjabcfbgayfrbcfgybcfrycabgyucfrgyucafbyubyguacgyubcabcgraavfbbygucgyacbgyrgbrfycuybydghcgdsfquygeuyyfygfyfgaywfweygfawetfjjetwyjefgg"],["YEESS","needs a lot of work"],["This game brings *THE* single feature that would take every game that inspires it to the next level.  I love it, I love what it could be if it were developed seriously with a full team.  All these \"learn to code\" \"psuedo-games (such as hour-of-code) are failing at the \"GAME\" part of this.  Mechanica has NAILED this.  I want this to be fully developed so badly because learning to code is so much easier when driven by necessity, by a problem the coder themselves understand.  This game presents situations for the player to have a reason to want to code\/program, and then provides a great framework for learning to implement their ideas.  This game also brings that magic element that no other game like Satisfactory or Factorio has, the ability to determine how you want a group of machines to work together, and then to implement that idea, the player's idea, not just putting together blocks of machines in some manner the dev wants you to.  It's awesome and has SO MUCH POTENTIAL! Can't want for this to be further developed."],["it says multiplayer was added last year, the beta option in properties ask for key code? wheres the multiplayer","k"],["very good shoudl use for programming"],["copies fortnite","As like many other people in these review will state, yeah the game needs some more content, which is slowly being added (not complaining). I originally played this I do believe last year, or early this year, I do enjoy the concept, the style of this game, and the building aspects. The mining could be changed in the future, its a tall ask, but I was more on the lines of perhaps some more ore variety, some more types of converyer belts, maybe some other methods of mining? Overall this isn't a bad game by any stretch, just in the current state it feels like much more of a complete package then on launch, with the more in-depth contraptions, better enemies, more to build. I almost forgot the wiring system, uh could you possibly make a detailed tutorial if you get the time to, please? I might be misunderstanding how the system works entirely, but its pretty difficult to understand, to me definitely, other than these hot opinions, go try out this game!",null],["Cool"],["fun","Very Fun game for those who enjoy survival games and those that also enjoy games like factorio."],["kjnhgfdnjnk"],["play please","fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun fun f","While the game is fun and looks good the bug I came across ruins all the gameplay there is left because most of the time you remove a block attached to something can crash the entire game afterwards making you have to do all of the progress you made before you saved which can get really frustrating. I only recommend this game when that bug is fixed.","I did want to plat more of this just really did not like getting killed by waves of bots b4 i even know how to play the game a real turn off"],["Good game, got hooked on the progression and research for about 6 hours. My first play through was 18 in game days before i felt endgame on normal. My next play through, i turned research off and turned the difficulty all the way up. That being said, its not really difficult, all it takes is a few laser turrets and you should be ok. Notes for Dev: -Vacuum tool for mob drops and resource overflows.-better snapping with house blocks-AI needs more work, robots get stuck on walls and just wait.-ending mission"],["good"],["very fun, even though i went in compleatly blind","A fun little survival crafting game, you're a humanoid robot besieged by trash-can like bots (who no doubt hate you out of jealousy :) in a desert with lots of room and resources.  Your goal is survival: the enemies come in semi-regular waves, so build some bear traps, trash compactors and laser blades to keep out the pesky neighbors.  It's been getting a steady stream of updates big and small, so if the gameplay feels a little thin just bear with it as it grows.  Totally worth it on sale, maybe even at full price."],["super gooooooooooooooooooooooood game","do not buy i have an rtx 80000 and with 15 extra graphics cards and 30 solar panels strapped to my head as well as 2000 dollars in my bank account and there is a laser sentry and it is not happy >:("],["WOW"],["I LOVE this game but there are so many bugs (duping is really easy, occasionally losing items when shift clicking from chests, and etc), and I would rather instead of just replacing everything with coal powered machines, I'd just rather have them add the coal machines as low tier items and have the others as a high tier items so we don't have to wait such a long time for new ones that already exist in the files of the game. There also just isn't enough enemies, I think that if there was more variety of enemies the game would be a lot more fun. I also don't think the game is worth the 20$ price tag. I do love this game but i don't think you should buy it yet.","The new update is simply trash."],["if you like survivel and automation games this is what you are looking for!","This is an amazing game and I love playing it, and i just started playing it again, I played this back when it frist started, and even though not much has changed, the gameplay is a lot diffrent. I've always had this ideal game, and the one thing that i have never seen is vehicles you construct that has free place and snapping, and from the road map thats where this is going, and I am overly excited for it!!!"],["I got this game when it was in beta. a bit on the barren side, wish there was another map to explore, and a projectile weapon would be great.","I can't say how perfect is this game, I recommend everyone to give it a shot, if they also make custom maps + make multiplayer for everyone not only friends it will be very cool game..."]]}