{"name":"Review_Text","index":[2630,2631,2632,2633,2634,2635,2636,2637,2638,2639,2640,2641,2642,2643,2644,2645,2646,2647,2648,2649,2650,2651,2652,2653,2654,2655,2656,2657,2658,2659,2660,2661,2662,2663,2664,2665,2666,2667,2668,2669,2670,2671,2672,2673,2674,2675,2676,2677,2678,2679,2680,2681,2682,2683,2684,2685,2686,2687,2688,2689,2690,2691,2692,2693,2694,2695,2696,2697,2698,2699,2700,2701,2702,2703,2704,2705],"data":[["It was really fun. It's a good puzzle game that really tests your ability to manipulate and rotate 2d objects in your head as well as sequencing object manipulation.","It was really fun. It's a good puzzle game that really tests your ability to manipulate and rotate 2d objects in your head as well as sequencing object manipulation.","This game is pure genius as far as puzzle games go. What a gem","I love the graphics and the challenging puzzle aspect of the game.","This game is pure genius as far as puzzle games go. What a gem","I love the graphics and the challenging puzzle aspect of the game.","The easiest game in the zacktronics lineup. But one of the most engaing with a good difuculty curve. And the workshop intergration is briliant.","Never been good at puzzles games, despite enjoying them. I really appreciate Opus Magnum for being a game that is both accessible and challenging to master. The game doesn't care how you synthesise a solution, so long as you make one that can be repeated safely, so it's far less demanding than other puzzles games seeking a single pass\/fail solution.But the beauty in Opus Magnum is that even after you have all your solutions, the game doesn't have to be over. You're always encouraged to make those solutions faster, cheaper, or smaller - saving multiple machines for each puzzle, and copying them at will. Distribution graphs and comparisons to your friends' results can help you set new goals for your next machine - maybe even some friendly competition.I think Opus Magnum might be the first puzzle game I've played that is approachable enough for me to finish it, but complex enough that I can keep playing. Kudos!","Never been good at puzzles games, despite enjoying them. I really appreciate Opus Magnum for being a game that is both accessible and challenging to master. The game doesn't care how you synthesise a solution, so long as you make one that can be repeated safely, so it's far less demanding than other puzzles games seeking a single pass\/fail solution.But the beauty in Opus Magnum is that even after you have all your solutions, the game doesn't have to be over. You're always encouraged to make those solutions faster, cheaper, or smaller - saving multiple machines for each puzzle, and copying them at will. Distribution graphs and comparisons to your friends' results can help you set new goals for your next machine - maybe even some friendly competition.I think Opus Magnum might be the first puzzle game I've played that is approachable enough for me to finish it, but complex enough that I can keep playing. Kudos!","One of my new favorite games.","The easiest game in the zacktronics lineup. But one of the most engaing with a good difuculty curve. And the workshop intergration is briliant.","One of my new favorite games.","good engineering type game, artistic, challenging, captivating","good engineering type game, artistic, challenging, captivating","A creative thinking game. Fun stuff","A creative thinking game. Fun stuff","Great puzzle game with lots of depth and replayability. The latter of which is fairly rare for puzzle games. I have many hours in this game to come","Great puzzle game with lots of depth and replayability. The latter of which is fairly rare for puzzle games. I have many hours in this game to come"],["The trailer looked cool, but I was worried it would be too complicated to work with fluidly.  Luckily that's not the case at all. Really enjoying this game.","The trailer looked cool, but I was worried it would be too complicated to work with fluidly.  Luckily that's not the case at all. Really enjoying this game.","fun game","fun game","One of the most interesting and difficult puzzle games I have ever played, it keeps throwing new and interesting mechanics at you while also messing with old mechanics to make them feels new. After beating the main levels you can also play through a set of box levels which are even harder and more interesting than anything you have tried before. If you enjoy puzzle games this is a must buy.","One of the most interesting and difficult puzzle games I have ever played, it keeps throwing new and interesting mechanics at you while also messing with old mechanics to make them feels new. After beating the main levels you can also play through a set of box levels which are even harder and more interesting than anything you have tried before. If you enjoy puzzle games this is a must buy.","Very intriguing with complex but gratifying puzzles once you complete them. Does require you to set aside some time to solve the puzzles, as they get rather complicated in the later stages. Really enjoying it.","Very intriguing with complex but gratifying puzzles once you complete them. Does require you to set aside some time to solve the puzzles, as they get rather complicated in the later stages. Really enjoying it.","I love the 'programming' interface and the histograms that compare my machines with the rest of the playing world.","10 out of 10, would recommend again.","10 out of 10, would recommend again.","Complex puzzles, loads of fun. Community page adds infinite amounts of new puzzles.","Complex puzzles, loads of fun. Community page adds infinite amounts of new puzzles.","I love the 'programming' interface and the histograms that compare my machines with the rest of the playing world."],["Really amazing. I like how you can choose to optimise the puzzles according to different metrics as well meaning there are many elegant solutions.","It's a masterpiece. Ignore the snobs, this game is superb in every way","Very enjoyable puzzle game. Each mission is challenging without making you smash your head into the wall. There is no one solution so you won't be stuck clicking on stuff randomly until you find the small thing you were missing. The UI and artwork make the game clear without being boring. While there is a little bit of \"visual novel\" bits, the main focus is on the puzzles. The only issue I have (albeit a small one) is how the game breaks down the score at the end of each level. I wish there were more groupings so I could compare how machines with my size scored in price and speed, my price scored for speed and size, etc instead of just all machines being shown in the same histograms","i was really drawn into the story and setting - im not really good at puzzle games, but i enjoy puzzling over them, i think i got stuck on a couple of levels and had to look up others solutions, but this was a really fun and engaging experience overall!","One of my favorite puzzle games of all time! It's super satisfying to complete the challenges it throws at you.","One of my favorite puzzle games of all time! It's super satisfying to complete the challenges it throws at you.","My brain hurts but I can't stop... Someone help me...","The game is awesome, no stress, no time limit. Take your time to optimize the automation and admire your work. It can be a little challenging, but that's exactly what we're looking for.So much satisfaction when you win a hard stage. Good job!","Incredibly addicting and frustrating and satisfying puzzle game.","The game is awesome, no stress, no time limit. Take your time to optimize the automation and admire your work. It can be a little challenging, but that's exactly what we're looking for.So much satisfaction when you win a hard stage. Good job!","it's very good but it can be frustrating when you have to completely delete your solutions bc it didn't work","Incredibly addicting and frustrating and satisfying puzzle game.","it's very good but it can be frustrating when you have to completely delete your solutions bc it didn't work"],["Be prepared to stay up until 5 am.","According to all known lawsof aviation, there is no way a beeshould be able to fly. Its wings are too small to getits fat little body off the ground. The bee, of course, flies anyway because bees don't carewhat humans think is impossible. Yellow, black. Yellow, black.Yellow, black. Yellow, black. Ooh, black and yellow!Let's shake it up a little. Barry! Breakfast is ready! Ooming! Hang on a second. Hello? - Barry?- Adam? - Oan you believe this is happening?- I can't. I'll pick you up. Looking sharp. Use the stairs. Your fatherpaid good money for those. Sorry. I'm excited. Here's the graduate.We're very proud of you, son. A perfect report card, all B's. Very proud. Ma! I got a thing going here. - You got lint on your fuzz.- Ow! That's me! - Wave to us! We'll be in row 118,000.- Bye! Barry, I told you,stop flying in the house! - Hey, Adam.- Hey, Barry. - Is that fuzz gel?- A little. Special day, graduation. Never thought I'd make it. Three days grade school,three days high school. Those were awkward. Three days college. I'm glad I tooka day and hitchhiked around the hive. You did come back different. - Hi, Barry.- Artie, growing a mustache? Looks good. - Hear about Frankie?- Yeah. - You going to the funeral?- No, I'm not going. Everybody knows,sting someone, you die. Don't waste it on a squirrel.Such a hothead. I guess he could havejust gotten out of the way. I love this incorporatingan amusement park into our day. That's why we don't need vacations. Boy, quite a bit of pomp...under the circumstances. - Well, Adam, today we are men.- We are! - Bee-men.- Amen! Hallelujah! Students, faculty, distinguished bees, please welcome Dean Buzzwell. Welcome, New Hive Oitygraduating class of... ...9:15. That concludes our ceremonies. And begins your careerat Honex Industries! Will we pick ourjob today? I heard it's just orientation. Heads up! Here we go. Keep your hands and antennasinside the tram at all times. - Wonder what it'll be like?- A little scary. Welcome to Honex,a division of Honesco and a part of the Hexagon Group. This is it! Wow. Wow. We know that you, as a bee,have worked your whole life to get to the point where youcan work for your whole life. Honey begins when our valiant PollenJocks bring the nectar to the hive. Our top-secret formula is automatically color-corrected,scent-adjusted and bubble-contoured into this soothing sweet syrup with its distinctivegolden glow you know as... Honey! - That girl was hot.- She's my cousin! - She is?- Yes, we're all cousins. - Right. You're right.- At Honex, we constantly strive to improve every aspectof bee existence. These bees are stress-testinga new helmet technology. - What do you think he makes?- Not enough. Here we have our latest advancement,the Krelman. - What does that do?- Oatches that little strand of honey that hangs after you pour it.Saves us millions. Oan anyone work on the Krelman? Of course. Most bee jobs aresmall ones. But bees know that every small job,if it's done well, means a lot. But choose carefully because you'll stay in the jobyou pick for the rest of your life. The same job the rest of your life?I didn't know that. What's the difference? You'll be happy to know that bees,as a species, haven't had one day off in 27 million years. So you'll just work us to death? We'll sure try. Wow! That blew my mind! \"What's the difference?\"How can you say that? One job forever?That's an insane choice to have to make. I'm relieved. Now we only haveto make one decision in life. But, Adam, how could theynever have told us that? Why would you question anything?We're bees. We're the most perfectlyfunctioning society on Earth. You ever think maybe thingswork a little too well here? Like what? Give me one example. I don't know. But you knowwhat I'm talking about. Please clear the gate.Royal Nectar Force on approach. Wait a second. Oheck it out. - Hey, those are Pollen Jocks!- Wow. I've never seen them this close. They know what it's likeoutside the hive. Yeah, but some don't come back. - Hey, Jocks!- Hi, Jocks! You guys did great! You're monsters!You're sky freaks! I love it! I love it! - I wonder where they were.- I don't know. Their day's not planned. Outside the hive, flying who knowswhere, doing who knows what. You can'tjust decide to be a PollenJock. You have to be bred for that. Right. Look. That's more pollenthan you and I will see in a lifetime. It's just a status symbol.Bees make too much of it. Perhaps. Unless you're wearing itand the ladies see you wearing it. Those ladies?Aren't they our cousins too? Distant. Distant. Look at these two. - Oouple of Hive Harrys.- Let's have fun with them. It must be dangerousbeing a Pollen Jock. Yeah. Once a bear pinned meagainst a mushroom! He had a paw on my throat,and with the other, he was slapping me! - Oh, my!- I never thought I'd knock him out. What were you doing during this? Trying to alert the authorities. I can autograph that. A little gusty out there today,wasn't it, comrades? Yeah. Gusty. We're hitting a sunflower patchsix miles from here tomorrow. - Six miles, huh?- Barry! A puddle jump for us,but maybe you're not up for it. - Maybe I am.- You are not! We're going 0900 at J-Gate. What do you think, buzzy-boy?Are you bee enough? I might be. It all dependson what 0900 means. Hey, Honex! Dad, you surprised me. You decide what you're interested in? - Well, there's a lot of choices.- But you only get one. Do you ever get boreddoing the same job every day? Son, let me tell you about stirring. You grab that stick, and you justmove it around, and you stir it around. You get yourself into a rhythm.It's a beautiful thing. You know, Dad,the more I think about it, maybe the honey fieldjust isn't right for me. You were thinking of what,making balloon animals? That's a bad jobfor a guy with a stinger. Janet, your son's not surehe wants to go into honey! - Barry, you are so funny sometimes.- I'm not trying to be funny. You're not funny! You're goinginto honey. Our son, the stirrer! - You're gonna be a stirrer?- No one's listening to me! Wait till you see the sticks I have. I could say anything right now.I'm gonna get an ant tattoo! Let's open some honey and celebrate! Maybe I'll pierce my thorax.Shave my antennae. Shack up with a grasshopper. Geta gold tooth and call everybody \"dawg\"! I'm so proud. - We're starting work today!- Today's the day. Oome on! All the good jobswill be gone. Yeah, right. Pollen counting, stunt bee, pouring,stirrer, front desk, hair removal... - Is it still available?- Hang on. Two left! One of them's yours! Oongratulations!Step to the side. - What'd you get?- Picking crud out. Stellar! Wow! Oouple of newbies? Yes, sir! Our first day! We are ready! Make your choice. - You want to go first?- No, you go. Oh, my. What's available? Restroom attendant's open,not for the reason you think.","Opus Magnum ist ein auergewhnliches Spiel. Man muss auf neue Weise denken, sehr zu empfehlen! Es macht viel Spa und ja, es gibt eine Geschichte in diesem Rtselspiel ^^Sehr schnell will man die Rtsel nicht nur lsen, sondern elegant lsen!"],["From very simple rules and mechanics, this game manages to give the potential for a crazy variety of solutions on every level. Competing with a friend to try and lower our scores on each level, and theory crafting about the ideal number of cycles or hexagons taken, was a great experience and I'm still coming back to the game to improve on my old designs.","Full Disclosure - I own every Zachtronics game, INCLUDING the mobile solitaire one, so I'm clearly a wh.ore for this developer, but a self-righteous one who leans towards masochisticself-abasementwhen it comes to complex puzzle games.And Opus Magnum delivers all 50 shades that I'm looking for.For those who are curious, Zachtronics' games utilize a basic formula: there is a goal that you must \"produce\". In order to produce this, you must construct a machine to do so. In SpaceChem, it's effectively a Union Carbide chemical plant; in Opus Magnum, it's an Alchemy table. That's the basic idea behind these games. However, the challenge comes from optimizing this production within a set number of cycles or within a ridiculously bare minimum machine layout.This level of open creativity is almost always provided tothe gamer within a creatively presented world that has to be navigated through. In Opus Magnum, it's a form of victoria era\/steampunk intrigue.So you have: 1) creative gameplay, 2) challenginggameplay, 3) interesting story, 4) freedom to experiment, all wrapped up in a package that is 1\/3 the cost of most mediocreAAA games.You won't go wrong picking it up at regular price, and you DEF won't go wrong picking it up on sale.","I'm an engineer and this game is, basically, catnip. 10\/10, would stay up to 3AM trying to beat my friend's best score again.","This is definitely my favourite Zachtronics game. I played most of them and enjoyed them all. But this is the only game I come back every once in a while and try to optimize my scores again, or achieve something new.","Definitely a very unique puzzle game, and the lack of limits allows a lot of creativity while encouraging minimalism and efficiency. Every stage feels very complex and intimidating until you manage to complete the goal, and then you can work on compressing the entire thing to get a better score. Well worth the money","I really like it but there's alot of bad ui flaws like no zoom or timeline which would be more useful - most of the time you have to watch the entire process over and over to see where it went wrong, it's not the tedium I wanted. Sometimes You need zoom out to see big designs. There is also no copy paste as far as I know and it can get hairy, there is fortunately control z, although it can get confusing, I'd like a undo history...... But it's a really good game otherwise","Great Puzzle Game that has a good story.","Zachtronics' puzzle games are the only puzzle games I genuinely love and they always keep me coming back for more. 10\/10!","Fun, tough puzzle game. Worth the price.","Makes me so mad but i love it.","tl;dr 10\/10 worth every penny, would recommendI played this game after playing Infinifactory (another game by Zachtronics that I love) and I think I actually enjoy this game a bit more. I prefer the fact that there's only two dimensions to deal with here and the game is still super fun and challenging in its own way.On paper this game might seem boring to some people, that it's a game about coding. While it's certainly true that this game is essentially about giving robot arms instructions to produce a desired outcome, it just wouldn't feel right to simply describe it that way when recommending it to others. I think it's more appropriate to say that I have had a lot of fun and I definitely recommend trying it out for yourself, even if you don't think it's for you.The art and style elevate this above being simply a game about programming. The level of detail in the backgrounds, for instance, is astonishing, unnecessary even for a game like this. It's more akin to what you might find in an RPG. The story is brief enough that it doesn't interfere with the gameplay, yet engaging enough that it helps create a world that your puzzles are a part of. There's even a mini-game that reuses elements from the main game that makes it feel like an extension of game's world - it even has it's own side story attached to it.One of my favourite features of Infinifactory appears here too - at the end of each puzzle you'll see a histogram showing you how your scores compare to other Opus Magnum players. I cannot tell you how long I've spent redesigning a solution just because I know that at least one person out there managed to do it better somehow. It's so satisfying after spending so long (sometimes hours) trying to get either the cycles, cost or area down to as low as the graph suggests is possible. Just seeing that tiny line appear at left side of the graph is all the motivation I need to try, and all the proof I need that such an achievement is even possible. I also find there's a great deal of fun to be found trying to design solutions that are elegant or symmetrical. While the game gradually ramps up the difficulty and sets a minimum bar to reach for every level, how challenging the game ultimately becomes is entirely down to you the player and how much time and effort you're willing to put into redesigning each solution. At its best this game requires good amount of mental focus and creativity, the process of which is lot of fun in itself, and it's even more fun when I finally manage to pull it off. This game has been one of the things keeping me sharp during quarantine and I keep coming back to it. As a puzzler, it exists in that nice middle ground between \"so easy it's boring\" and \"so hard it must be impossible\". There was clearly a lot of love put into this game and I wholeheartedly recommend you pick it up and check out the developer's other works.","This game is not an alchemy simulator or a puzzle game, it is so you can play Sigmar's garden 100 times.","Gut game.","Awesome game and gets super sweaty if you have friends to compete with in scores. Own all of the zachtronics games and this really is his opus magnus","one of the greats","Addicting","Pretty cool game about doing magic alchemy, you have to make a functional repeating sequence that creates the desired product, and once you've completed the task, you can work on refining your design to be more efficient, less expensive, and\/or more compact.  The game then compares your result to what others have done and allows you to see how you stack up.","Despite the fact that my review focuses on the way in which my children engaged this game, I want to be clear up front that this game is absolutely sufficiently challenging, rewarding, and entertaining for adults.  The difficulty ramps up nicely and you'll be quite proud of yourself if you can solve the more complicated puzzles with optimal designs, I assure you.  I work with technology for a living, and some of the puzzles required some significant work on my behalf, nonetheless.But most importantly to me, this is an incredibly accessible game which effectively teaches software engineering techniques through analogous exercises in a superficially-unrelated environment.  Because it  makes use of sequences of visually-comprehensible symbols rather than language-based code, it is suitable for children (with varying degrees of, at most, minimal supervision to aid them in navigating the menus and whatnot) as soon as they can comprehend the subject matter.  I was delighted to watch my four-year old and five-year old design their own machines to complete their tasks.  My five-year old actually successfully understood an error in his design and debugged it!Absolutely wonderful game from Zachtronics.  I strongly recommend it.","It's a fun 'in between game'.Ideal to waste some (spare) time, as it starts quickly and the puzzles are not taking too much time in general (unless going for records...)","this brims with brain busting yesness","A little simpler than some of the other Zachtronics games - but fun! This one or Infinifactory are good introductions to the genre.","can recommend.","Love Zachtronics games. This one is a lot of fun. Great visuals.","Yet another excellent game from Zach. This time, the programming puzzles are disguised as alchemy experiments. Lots of replay value in the form of efficiency leaderboards. IMO this game is more polished than the previous entries. Includes an appendix of especially challenging puzzles.","yes"],["Good puzzles that distill the essence of optimization of factorio production lines into a nice, clean game.Also, the marbles side game is remarkably addicting...","Very good puzzle game about mechanical solutions to complex problems.","Wow. never seen this kind of puzzle. Very good.","yes","This Game is brilliant, really makes you think.","Good game.","Beautiful puzzle game. Beware, though: if you find the most optimized solution you'll be hypnotized by a wondrous dancing of arms and marbles (they're elemental proxies, Concordia!!), spinning wheels and constellations flying hither thither. I could probably stare at some contraptions for hours, not counting the hours more you'd spend actually building the things to begin with.","What can I say? I love this game. I do think it was a bit short, I got 35 hours from the main game, but I still heavily enjoyed the game.","This is very similar to Infinifactory, but in 2D. If you liked Infinifactory (one of my favorite games) you're going to like Opus Magnum. If you haven't played Infinifactory - get it instead.What I like about both of those games is that each puzzle can be solved in so many different ways, so you never get stuck. Instead you will find yourself going back and optimizing your solutions.","Amazing puzzle game!!","Fun puzzle game with a bit of story to intice you","Interesting game.","Great game if you want to program steampunk machines. Terrible game if you want to learn chemistry.","the puzzle games from zachtronics are top notch.. this 1 is really amazing.. very good puzzle game, much fun, very punk.. very steamy. there is even a guy who built a mechanical computer inside this game.. so you know its legit.","I've played for 3 hours and have enjoyed it greatly. The puzzles get progressively harder, but with some patience and experimentation it is a huge thrill when a solution locks into place. Very satisfying. This is definitely a challenge to your visual problem solving skills. You will need to visualize in your mind how pieces will interact once in motion. You plan several moves ahead , set it in motion and then see where it worked and didn't.You MUST have patience. Solutions will fail often, so just make some adjustments and step though the actions one at a time.My one suggestion to the devs would be to offer more chances to practice at each level before going on to harder puzzles. Sometimes it feels like a math class where procedure 1 is presented, solved and then procedure 2 is immediately presented with no chance to really get comfortable with 1.","Alchemist Simulator CNC Machine Operator Simulator ()","Optimization and efficiency make this game a blast, however, I personally find making the most inefficient and complicated machines even more fun. That's the beauty of Opus Magnum.","The Game is awerson! if U like to think...I hate the MouseHoverTooltips.","Out of all the Zachtronics games I have played, Opus Magnum may be my favorite.  If you enjoy the other Zachtronic games this one is sure to please.  I'd say it's more akin to SpaceChem than to TIS or Shenzhen IO.  I haven't completed the game entirely because I keep finding myself going back to earlier levels just to optimize my solutions. As you learn new techniques and gameplay mechanics you'll naturally want to go back and improve upon your existing machines.It's worth mentioning that there is an excellent solitaire minigame built in as well.  It honestly deserves it's own app in the same vein as Shenzhen Solitaire.Highly recommend!","Probably the most accessible Zachtronics game. Makes me feel like a genius and drooling simpleton in equal measure.","It's classic Zachtronics: puzzles that make you scratch your head and rub your chin so hard you lose all hair, mechanics somewhat reminiscent of assembly language that make you wish you still had hair so you could tear it out, etc. It's the best, I love it, and the snark from the great story just adds to it. Highly recommend.","I'm literally a genius now! Beside 24\/7 headache, paranoia, trust issues, insecurities and depression.","It's a really fun puzzle game with surprisingly great story.","haha alchemy machine go brrrrr","Fun"],["best","Excellent graphics, story, and music. Many creative elements are subtle, such as the change in background music as levels progress. Creating your own levels is cool, too.","epic puzzle game 11\/10 yes","Opus Magnum is a fiendishly clever and difficult puzzle automation game set in an alchemical alternate universe. If you like Zachtronic's other games, you will like this one. The objective of the game is to construct and program automated \"alchemical engines\" that manipulate various classical elements into the required products. The puzzles increase in difficulty as the game progresses and by the end you are solving hellishly difficult cramped engines. I started nearly every puzzle in the latter half of the game thinking the engine was surely impossible, but a bit of thinking and experimentation always lead me to a solution in the end.Really the only negative I have for this game is that the bonus space-restricted puzzles don't give you an achievement for completing them","Excellent puzzles.  My only wish is that the text size should be adjustable.  It's a little small on my 4k monitor.","This game is the usual zaktronics puzzle game, similar to shenzen IO, with more of an attempt at plot which colapses into an incoherent heap, it feels like a chapter or two was cut from the plot. Overall it's not bad, but the puzzles are a lot simpler than shenzen and a little tedious. The biggest problem is interface quirks such as not having copy paste on programs for the arms, or being unable to save sub-assemblies for things you do over and over again.Overall I would rate it as a C, a passing grade but uninspired. My recomendation is to get Shenzen IO instead by the same developer and with similar mechanics but it;s a whole lot better game.","Fun, hard puzzles. I enjoy the occasional stumper, but once you figure out the trick, there's a solid engineering puzzle behind (spacing, motion, timing). Genuinely one of my favorite Zachtronics games.","Loved SpaceChem and this is even better!  Everything that was fun about SpaceChem plus an incredibly slick interface and a fun story and setting!","Brain++++","Highest replayability of any puzzle game ive ever played. maybe its not really a puzzle but a building game?Whatever it is, its a lot of fun. finding solutions that optimise area, cycles or cost or trying to balance them all.you can even go for symmetry or make the most convoluted contraption that ever existed, its all correct as long as you make the product. and then you can watch it all run for as long as you want.1 complaint: as far as i know, you cant repeat a set of instructions from somewhere in the instruction set, like if you have a machine that needs a few cycles to become saturated, you cant skip that and repeat from right after.this is not a big problem though and you can still finish the product if you copy paste, but if your instruction set cant loop the gif recorder will crash and make it so you cant share your solution. Great game, 8\/10","Fun puzzle game. Recommended.","A nice casual puzzler","Just an awesome puzzle game.  Reminds me of some of the puzzles from Gizmos & Gadgets, but of course way more complicated.  Most of my play time I spent with my chin on my hands visualizing configurations in my head.  What it doesn't represent is how much time I spent day-dreaming about the same when I was away from my computer.The campaign narrative: It's confusing and I think convoluted and ultimately unnecessary.  The dialogue is fun sometimes, but the plot is the barest window dressing on an otherwise brilliant, satisfying, and beautiful puzzle game.","Opus Magnum is an aesthetically-pleasing casual engineering game with a short but compelling story and a small but compelling soundtrack.  Unlike many other engineering-style games, there are no failure conditions for the main story except failure to produce a solution.  While there are histograms for cost, number of cycles, and area used by your solution, you do not actually need to perform within a certain limit of efficiency to complete the level.  This makes for a far less frustrating experience for sure, but those looking for a challenge will need to use the histogram motivation to create their own.The controls are simple with extremely few unintuitive features (my only complaint of note being the grab delay), and the range of tools available to you for creating the engines gives you an exceptional amount of agency when deciding how to tackle the problem.  This is even true for the post-story constrained levels in which you are forced to work with a smaller space.I have heard some people call this a \"puzzle game\", and I've got to say that I don't really agree with that designation, as there is just so much freedom in how you pursue a solution that I feel it defies the basic puzzle game formula, hence designating it an \"engineering game\".  However, within the scope of your engineering, you can certainly figure out nonobvious ways to make your machine more efficient, so in this way there are still some puzzle elements, just not in the traditional sense.In any case, definitely a 10\/10 game, I struggle to imagine something they could have done better without also having to make the game longer (like having a longer story).Also, Sigmar's Garden is best garden.","i dont know what im doing"],["its neat","I think if you have patience and like puzzle games, this is right up your alley.For sure 30h or fun, extra fun if you have a friend who plays this game too, to compare scores :PI like this game, I got almost 50h out of it.I complete the storyline and a little bit more, but that's it.I reccomend :)","An absolute gem of a puzzle game that I love. This game is focused around building \"transmutation engines\" to get a desired product. Best part of this is that there are no \"only one solution\" obstacles. You build your machines as simple or complex as you can dream up. Highly highly recommend it to those who love puzzlers and even those trying to get into it. The game's mechanics are simple, but grow more complex with each differing level, though there are certain levels where the complexity spikes significantly in my opinion. This is not a bad thing to me because i love the challenge. And there is nothing more satisfying than building your machine and having it work exactly like you intended after tweaking it. there are plenty of levels too! (as well as workshop support)","Designing machines, sequencing the motions, if you like that sort of thing you will *love* this game. Neat, neat puzzles.","You *WILL* send gifs of your petsmachines to your friends, and they *WILL* look at you like you are insane.You have been warned.","A beautiful puzzle game with all the polish and ingenuity that we've come to expect from Zachtronics.","Even though I got all of the achievements, I expect at least double the number of hours played upon writing. Whether to take it easy and play Sigmar's Garden, or tackle the puzzles of varying difficulty, Opus Magnum was an enjoyable experience. Do recommend.","Like SpaceChem but more spinny. Absolutely satisfying every time you complete a puzzle because they are so damn challenging.","A great source of both frustration and fun. The agony of a difficult level only serves to enhance the sweet taste of victory.","Very addictive and enjoyable puzzle game. Somewhat difficult in the beginning, but if you were to be patient and try all the available tools, it becomes a very satisfying experience. So, for those who like puzzle games mixed with a bit of building tools, this game is a must. Recommended.","This is game is hard because im stupid"],["In-depth puzzle \/ mechanical game, where you both build your machines and program them. The puzzles gradually increase in difficulty, so it's easier to keep pace with them. Each puzzle you beat unlocks more dialogue for the story. The story and characters are a lot of fun, too! Highly recommended for anyone who enjoys coding, machinery, puzzles, or just likes a challenge!","Fun and challenging.  Satisfying to rework your machine to finally match the best the community has achieved.","Very similar to SpaceChem, but without any space or part limits. This makes everything solvable if you use enough parts, but there's still leaderboards for optimizing by either cost (number and type of parts), area used or speed to encourage more intelligent solutions.Very addicting puzzle game!The solitaire mini-game is also fun. However, I'm not convinced that every random start is actually solvable, which is frustrating.","let's all be engineers!","Well, I'll be the odd guy who gives a negative review to a game with \"overwhelmingly positively\" reviews.I was intrigued by the game, because I like puzzle and design games, although I mostly play titles where there is an actual classical game besides the puzzles, like Factorio, Satisfactory or Oxygen Not Included. Also part of my background that I'm a software developer, so I'm familiar with designing algorithms and functional systems.My initial assumption was that the puzzles will be sufficient in and of themselves, because the game seemed quite polished. But I haven't had a good enough experience while working on the puzzles. At the beginning all of them were completely trivial. And when the complexity increased, it quickly got pretty annoying just how poor our toolset is in the game to solve the puzzles, and how high the subjective friction is overall.As far as I'm aware we can't create instruction blocks that we can label and reuse (essentially functions\/methods), let alone blueprints for designing reusable modules consisting of both the instructions and the physical parts; basically we aren't given any tools for organizing the instructions or breaking down the complexity in an elegant and cool way. It felt like a much worse experience to work on the problems in the game than working on real-world problems in programming. And why would I play the game then... ultimately this is what my negative review comes down to. It's a good game, I just didn't enjoy it.\\_()_\/","casual and endless, a puzzle that you can also optimizeon a side note: could live without the marbles game though =p"],["A calming puzzle game with gorgeous visuals, great music and a plethora of puzzles that are fun to optimise over and over. Not as hard as Spacechem, but the emphasis on rotation is very unique","I love it. Aesthetically, the game is beautiful. The puzzles are challenging and there is no unique solution, but it depends on how much you want to minimise the costs or beat yourself","I love that you can modify your machines after you are done to improve on them and get better scores","Such a good engine building puzzle game","sigmars garden > rest of game","It's addictive. You should play it.It's always very satisfying when you get an efficient machine going.My only complaint is that there should be some shortcuts for making arms on tracks. It gets very tedious to get everything synchronized properly when you have a lot of them.","Good for players with any skill level"],["Opus Magnum is a good game and you should play it.","I can't recommend this game enough. This is the first time I've played through an entire puzzle game.. (though I still haven't finished the bonus chapter after the credits).. The game is so unique to any other puzzler I've tried (other than any other Zachtronics title), it's difficult, but not to the point where it feels boring to try and solve. Saying this specifically for people with a short attention-span. You won't look at what's ask of you and think \"I don't fell like doing this\".. You're instantly running through ways you can approach the problem in and it wouldn't surprise me if doing so could actually benefit someones logical thinking skills. Incredible brain teaser and slowly became the reason I support Zachronics.. (Bought SpaceChem and Shenzen I\/O within the same week) They really have a perfect recipe for, as they call them.. Design-Based Puzzle games. 10\/10","The puzzles are fun and challenging. The interface is well thought out, while it may not be the most intuitive you get the hang of it pretty quickly, especially the hotkeys. The story is interesting so far and makes you want to finish the puzzles to continue it. all in all a very good puzzle game that i would recommend to anyone looking for one.","Good music, graphics, and story lineall stitched together with some amazing puzzles. It's a game that makes you feel more smart than you deserve to feel.","This is a game that will bend your mind into a pretzel and leave you begging for more.","Great game that you can play just to solve puzzles, or go crazy trying to optimize your solutions.","Incredible puzzle game, your solutions get exactly as complex as you want","Not hard to pass each level, but never easy to simplify them. The ones that limit space is horrifying, fortunately they only appear after the main story, in the Journal and appendix."],["Another Gem from Zachtronics. Those who know his work will know what they are in for. The title is fitting, as this feels like the most polished of his offerings yet (although admittedly I haven't made my way through all of his titles to date, it's only a matter of time). My playtime is vastly exaggerated after leaving the game on in the background for a couple of nights. I have felt that this is shorter compared to some of his previous entries (or maybe I'm getting faster?) However the pacing of the story and puzzles seems spot on, so this isn't really a complaint, but more of an observation. The levels are difficult, but not so difficult that you won't be able to brute force them with enough wrangling, save for the epilogue, which adds another boundary condition to increase difficulty. The great thing about this game, along with other titles by Zach, is that the difficulty is not solely in solving the puzzles, but in optimising them within the soft constraints you may place on yourself (cost of build, speed, etc.) Competitive puzzle solvers will love comparing and competing against other player's or their own statistics to try and get a 'better' solution. This also adds to replay value for people who want to challenge themselves.  The mini-game called Sigmar's Garden is in itself is a great little game, with a similar feeling to solitaire, except that all the pieces are face up in front of you, so you can't complain about being blindsided by a trapped card deep in the deck. Great relaxed game to play to balance out the intense concentration required for the main puzzles.Beautiful art style, interesting story, characters and setting,  and a good soundtrack. Overall I would absolutely recommend this game.","Fantastic game, creating complexity out of simplicity","Best puzzle game I've ever played. The game is easy to learn but has basically infinite replay value along with workshop levels.","Well, this is one of my favorite games, what to say. It is interesting and not really hard. Pure zen...","Really nice game. Relaxing, with beautiful music, well thought out puzzles that turn out into beautiful visual pieces. The story and characters are also surprisingly well written.","Fantastic","Throught i was great\/smart at puzzle games.. until i played this i just felt really insecure about my stupidity (   )Fantastic game, hard puzzles etc. and workshop supported, so you can create your own aswell!","its really good"],["Not to brag, but I managed to get the final story puzzle down to 50 cycles...","Storry is just sugar on top, the whole point is the puzzles. In pure Zachtronics fashion, they are excellent.","Lots fun, and I especially recommend it to anyone looking to pursue any kind of studies involving programming. This game provides an excellent primer for that kind of logic, including task synchronization and other parallel concepts. I have a degree in computer science, and I honestly think I'm a better programmer for having played just a few levels of this game! Your solution to each level is evaluated on a series of criteria, so optimizing your solutions can become a very interesting challenge in itself, and gives each puzzle excellent replay value","Very fun coding game with an interesting story. Saw on Wanderbot's channel and would recommend.","A very fun puzzle game!"],["fun and challenging puzzles with a steady increase in challenge","an awesome puzzler, even if some of the puzzles will make you say \"oh  OFF, i can see how to do this, I just don't want to\" (though only the very last did that to me, loved it til then.)","I thought it looked cool, but I'm just not a fan of puzzle games :\/","This game has proven to be quite interesting. I appreciate the challenge of trying to visualize how to configure the machines in the most efficient manner possible. Even better, there's no \"right\" answer nor one specific way by which to set these things up. Nor are there penalties, really. One either completes the recipe or one does not. All that matters is that the agents are combined in the required order and configuration. I liked how the game shows graphs which allow me to compare my performance to the averages, without any judgment or snark--just graphs of data calmly presented without fuss or fanfare.For those who enjoy puzzle games, Opus Magnum is definitely worthy of consideration.","Excellent Game.  Fully recomend!","Dope game, 10\/10","I like big puzzle.","The puzzles are fun, but not \"blow your mind\" fun. And there is nothing else to the game besides the puzzles, the story is minimal and not even very good.One issue with the puzzles in this game, compared to say exa punks (which I loved), is that there's little difficulty unless you decide to optimize your solutions. You can pretty much decided how you're going to solve one of the puzzles before you've even seen it.The game's better if one or 2 of your friends have played previously, since you can try to beat their scores."],["Great game","This game is extremely complicated in the endgame but I literally just booted it up for the first time in 2 months and completed 2 of the super duper hard puzzles like it was nothing. All ya gotta do is use your brain, and it's fun as hell.","really puzzle game","Do you want to feel smart and stupid at the same time?  This game is for you!","It's spacechem not in space.","This is easily my favorite game so far from Zachtronics! It's a programming\/puzzle game where you give robotic arms instructions to assemble alchemical elements. The fun comes from beating a challenge once and then going back in to try and top the leaderboards when evaluating the solution by cost, time, or area of solution.There is something really satisfying about observing a solution you built from scratch automating the manufacturing of a given element, and there are plenty of challenge available for the asking price. Definitely check it out if it looks appealing at all to you!"],[" the main gameSigmar's Garden time","Great fun with near infinite replayability. In fact, replaying the game is like half the fun","Mmm... delicious brain food. Story is kinda... meh. Nothing makes you like a main character more than him being a know it all. Hopefully there will be some arc. I'm only in the 5th or so real mission. But I'm quite liking the \"I can do this better\" feeling I keep getting. Most of my game time goes into redoing missions to get better scores. Worth the purchase if you like thinking games.","Masterpiece.","Fun","All round good game, gets hard at the end","A good balance between Space Chem and Infinifactory. Very fun!","yeah it's cool","This is not a puzzle game.I played through probably half the game and have never once needed to do anything other than place down a few levers. I didn't even have to use any of the advanced mechanics the game offers because the levels can all be solved with just a few of the most basic levers.It's possible that later levels may actually require some thought, but I don't want to grind through dozens of boring levels with the cluncky and tiny UI of this \"game\"."],["make me feel like a genius","Easily my favorite zachlike. Makes me feel stupid then smart then REAL smart then REAL stupid.","A time warp to 4AM. Brilliant, polished, spatial\/programming puzzle game. Very open ended in terms of solutions, with the focus on optimization. A bit overpriced, buy on sale! 8\/10","Opus Magnum is a simple to learn puzzle game that will leave you dreaming about how to make your machines more efficient long after you stopped playing.It seems simple. Take a few base components, combine them on a hexagonal board to form complex molecule chains by moving them around with pivoting, sliding arms. Everything your machine does is timed as a series of programmable, repeatable steps.The challenge comes once you see the Leaderboards. Your machine is compared to all others based on speed, cost, and size. Can you tweak your machine to exceeds others in terms of speed, cost, or size? Improving one almost always affects the others.Can you make the most efficient machines the world has ever seen?Best of all, if you are truly happy with a creation, you can easily export an animated GIF to show off your machine to your friends, family, or anyone else who wonders what you have been doing the last 6 months after you stopped coming to family functions or showing up at work.","Solid factory style puzzle game let's you optimize for speed, cost or size so puzzles have replay value.","Gives that satisfying feeling of fiddling with a machine."],["I so n yes good game","less puzzle, more thing-inventingsigmar's is very funwould recommend if you hold any interest in alchemy as a concept","A great puzzle game","Came for alchemy, stayed for Sigmar's Garden","This game makes you feel smart. And it's so satisfying to finally get everything working correctly and see your molecules come together. I think the best part is that there are so many possible ways to accomplish the goal and you can replay levels to see if you can reduce costs, time, and area."],["This is a great puzzle game to relax and get completely absorbed into.  First solutions are easy fun, but then you'll see a way to make it just a bit better...","Good puzzle game","Think it's great. Simplistic in its core mechanics, but not in the least simple.","Another awesome game from Zach!","Its funn","when i cant figure out a level i just spend time making the arms do a little dance and all is good"],["Magnum Opus","Highly recommended.  All of the puzzles were fun to figure out.  Decent story as well.  Great enjoyment seeing my puzzles run.  Best of all the Zachtronics games.  Able to solve all puzzles without having to consult a walkthrough","Good","Most puzzle games usually leave me more frustrated than having fun. Not with this game. While you have to think quite hard sometimes about how you solve a puzzle, there's never any moment where I felt stuck. If my solution didn't work, I just tried a different approach.One of my absolute favourite features of the game is the limitless options on how you solve a puzzle. No gold limit, size limit, or speed limit. It's just you and your ability to build the end product from the inputs.My only gripe with the game is the end game content. Once you've finished all the chapters, you unlock puzzles that you have to solve with limited space. It feels completely counter to the game's philosophy. Luckily, you don't have to do them to unlock anything else (from my knowledge), and there are plenty of harder puzzles to try, but it's still disappointing that that is what you're challenged with at the end.Minor problems aside, I'd highly recommend this game if you enjoy constructing molecules with no limitations beyond the basic rules of the game.","Extremely satisfying.Genuinely fun to optimize your setup.Plenty of base puzzles + workshop."],["10\/10","its an ingenius puzzle game that suprisingly has a good replay value","This is an extremely cool and addictive puzzle game. Yes it gets very difficult, for me, very early, and you have to apply lessons from previous levels, which is what makes it great!"],["Great casual puzzle game. The levels are a mix from easy to very hard. And for even more of a challenge you can always redo levels to decrease your cost, cycles, or space.","Great inventive puzzles. Lots of replay value as you try and go back and make your inventions more precise, quicker and cheaper to produce. Good steampunky vibe as well."],["Edward Elric had it easy.","Fun way to pass time for a nice chill experience.","a eficincia no se mede apenas por quo bom algo , e sim pelo custo e a qualidade de um resultado, de quantas maneiras d pra fazer? use o clculo para descobrir","is good","it is an excellent puzzle game","amazing puzzle game, highly reccomend","I really enjoyed Infinifactory. This game lacks its puzzle design. Where in infinifactory when I first see a puzzle I would be think holy crap how am I gonna do that? Then at the end I get to watch the dozens upon dozens of interlocking stuff I built accomplish the task it felt very satisfying. In this game game the puzzles don't feel difficult. It isn't a matter of how is this possible as it is whats the least annoying way I can get this work.","really makes you use your noodle","It's a great wicked  concoction simulation. All kinds of recommended.","Fun puzzle game - addicting and a compulsion to best your friends in 3 different design elements!"],["Just give it a try!","Great Game. A little short for my tastes, but there are fan made levels for when you're done. Worth a go, plus it's pretty cheap.","Very fun and addicting puzzle game, even if you aren't great at puzzle games, the game is easy enough for just about anyone","Foolish_Game!Every Mission JUST Random from a No Using Yellow)_(Map.Do some Wrong thing then take a lot of time 2 research a Confuse Q\/A.","Must have.","Intriguing little programming puzzler.","Alchemy: the science of understanding, deconstructing, and reconstructing matter. However, it is not an all-powerful art. It is impossible to create something out of nothing. If one wishes to obtain something, something of equal value must be given. This is the law of equivalent exchange; the basis of all alchemy. In accordance to this law, there is a taboo among alchemists. Human transmutation is strictly forbidden. For what could equal the value of a human soul?!11\/10 needs more Sigmar's Garden"],["Is fun, especially if you can compete with friends","This game is a mix of challenging puzzles, good music, calm chill environment, and overall steep skill level. If you want to make crazy cool and good looking machines play this game. If you're looking for a challenge that will push your intellect in logic construction, play this game. Or if you just love chill puzzle games with a bit of challenge, play this game.","Probably the greatest puzzle game of all time.","This is a great starter game for zachatronics so if your looking at multiple zachatronic games then i reccoment this one, its also a great puzzle game with a low skill floor (with some work anybody can beat it) and a ridicuiously high skill celling if you want to optomize your soulitions"],["Clever puzzles. Amazing","This game is basically SpaceChem 2. If you liked SpaceChem you'll like this game. It has more features, more sophisticated logic and solutions, and the same feelings of accomplishment when you fully optimize your solution for speed, resource efficiency, or plain ingenuity. I also enjoy sandwiches...","If you enjoy engineering, optimization and logic, this game is perfect. Programmers, engineers, math nerds and puzzle lovers should check this out because it's sure to be up your alley. Simple mechanics but difficult puzzles. Great for a brain workout. 10\/10"],["Perhaps the finest puzzle game I've played.  The solutions allow for a fantastic level of creativity and experimentation.  My only complaint is that there are a few very useful shortcut keys which aren't really made obvious to the player without searching external sources.Also, as an added bonus, it's a puzzle game with an engaging story that manages to do an impressive amount of world-building and character development in a small number of still images and dialogues.","A true puzzle game to set the mind's juices flowing. The logic is easy to grasp. The solutions not always so. The base storyline game took me less than 20 hours to complete, solving each puzzle only once. So there's significant scope to return for speed, space and cost efficiencies. At least, there will be once the appendix challenges are dealt with; their constraints make for even more interesting play.","Evidently I'm going to be a contrarian given the community consensus, but the tooling interface for this Zachtronic game was frustratingly poor. When you are going spend many hours creating solutions, the quality of the tool interface and how (or if) key programming concepts are represented two-dimensionally really matters. Iteration was passable; sequence management was a mess;  conditional branching basically non-existent; and the user interface didn't make zooming or panning on the larger puzzles (as puzzles grew in size, not complexity) easy or intuitive.Puzzle games always risk conflating difficulty to use with difficulty to solve - and this particular Zachtronic game's design failed encourage the latter instead of former.","Fun puzzles. Visualy pleasing. 100% worth the money.","\"If you like the game, please support the developers!\" - They saidOh well, here I am not only with Opus Magnus but also with the entire Zachtronics gamesKeep up the good work devs team! Thank you","Addictive and very satisfying. Exactly what I look for in a puzzle game.I recommend Googling a little about how the loop timing actually works. I found it very counter-intuitive. I'm still not completely sure how to optimize the timing efficiently. It hasn't stopped me from solving the puzzles, it has just caused a little more frustration than I feel is necessary.","This is one of the most satisfying games to play if you get it right, I could look at the GIFS for hours.","An excellent puzzle game with great open ended optimization challenges. Fun to play with friends","Op","Delightful mock-chemistry puzzle game. Fun to find solutions for problems and then trying to beat your own score with small efficiencies is a real hook.","I love Zachtronic's other puzzle games, but this one is my favorite.  I think this is because I prefer to program mechanical sequences more than lines of assembly code.  Also, the artwork and music are great.","Addictive, absolutely best soundtrack","Game is as good as any other Zachtronics game. Too easy at first, way too hard as it goes on. Great.","it's good"],["This game is great. The concept is interesting, the story is suprisingly captivating without being distracting, and the charts at the end of each level are a great motivator","The controls in the game are obnoxious (needs better keyboard support like being able to add instructions with just keyboard). The story is thin and pasted on.But the graphics and feel of the main play area are good and the mechanics are unique.","This game is fantastic. Easily my favorite of the Zachtronics games, and probably the most approachable one.The puzzles very challenging, engaging, and fun - and they have many different solutions.However, the real reason is the absolutely A+ story. I was hooked, and it was a great ride. Shame it's so short.","Truly amazing puzzle-ish game","Game is good but my brain is small so I didn't make it past the 1st area (not counting tutorial). It was really fun though and you could get a lot of play time out of it.","Good game for nerds","Fun puzzler.  There is always a way to make your machine better so tons of replay ability.","Nice... very, very nice and relaxing. My new favorite way of training the brain.","I love Sigmar's garden.Oh yeah, and Opus Magnum is pretty fun too.","best zachtronics game i've played","Good fun, nice mechanics and puzzles, enjoyed the sigmas garden minigame as well."],["Strong puzzle game with some really nice narrative and worldbuilding elements as well.","I need the others cheaper for my collection. I can only play zacktronics and Isaac because my pc is trash.","addictive and brilliant (writing this at 2:30 AM, which says it all)","This is a nice assembly line construction puzzle game. The trick is to create a sequential loop, and to make your machine as efficient as possible. It certainly makes you think. (Note: the \"repeat cycle\" button seems to be pretty useless, but you can still play without it.)","The typical Zachtronics formula and typical Zachtronics quality. Puzzles are great. Polish and atmosphere are great.","I love this game, if your looking for a game that will test your brain to the max while creating awsome and beutiful machines then this is your game. A true hidden gem of mechanical majesty.","The best type of game. You can be an \"autist\" on your own and find your unique solutions to presented problems. The learning curve is not very steep, but the sky is the limit of improvement. To find an elegant cheap, quick and compact solution is the dream you want to achieve. I love this game. The design feels much warmer and frendlier than the other titles about chemistry\/alchemy. The cute tick-tock of steampunk-ish pistons and arms can leave no heart cold. Also, beautiful soundtrack and histograms. <3","A fun programming puzzle game.Nicely presented.","A very solid evolution on classic Zacktronics formula, this one mixes atoms placement like spacechem with instructions like TIS-100 or Shenzen I\/O, and the results are a chalenging (even if sometimes frustrating) gameplan for fans more technical puzzle games."],["Another beautiful, and somewhat impossible game from Zachtronics.   These are the very best of puzzle games.","Hands-down my favorite Zachlike. This one can be played over and over again, year after year, improving on puzzles or even getting worse grades. But it doesn't matter. It's fun to come up with a solution either way. The tools you have are intuitive and minimalist, the UX is good, I especially like how you can just use hotkeys instead of dragging. Even the Solitaire game is a lot more innovative and fits the theme better than in other games. Perfect. *chef's kiss*","An amazing puzzle game with plenty of replay value as you try to make your alchemical machines more efficient or compact. Beating a level is only the start, I found myself going back to levels in order to refine the machines and it's lots of fun. The tools you are given are limited, but there's so much (infinite?) scope for creativity within those boundaries, not to mention it is connected to the steam workshop and there are loads of user made puzzles to extend your play time!","This is the first puzzle game I've ever beaten without a walkthrough.","Better than Spacechem, which is saying a lot."],["another great machine building freeform puzzle game. 10\/10","eu passo uma hora e meia pra passar de uma faze pra um chines fazer a mesma coisa mas custando 90% menos","y","if you like puzzles and design you'll love this game","If you enjoyed SpaceChem, you'll love this. Solve puzzles and then optimize your solutions for the cost (items placed), cycles (time to execute), and area (space used). I feel like they took the best of SpaceChem and improved upon it. With multiple saves allowed per puzzle, it's easier to optimize for each type and experiment without losing your working strategies.","its an improvement over Spacechem in basically every way.","Love this game! I can make the machine however I want. There is many solution to one problem, it is like the machines are in my own style because I like my machine to be compact but maybe others want it to be fast and perfectly timed so that it is like a carefully planned dance.The puzzle is not that difficult if you just want the job done and it is still satisfying (I am only at the 3rd chapter out of a total of 5 chapters) but if you want to have the smallest or cheapest or fastest machine, you can really challenge yourself and gain even more satisfaction. Plus, there is an extra set of more difficult levels (they call it The Journal) and of course there is steam workshop for people to make level and download level.Money well spent!!","The systems and puzzles are very satisfactory to watch and the level of difficulty scales in a pleasant way to have you testing new stuff and even going back to optimize an old design.I can highly recommend this game to anyone who likes to solve puzzles!","I would recommend this game to those who enjoy tedium.  If you're a software designer, it will fell not unlike other programming chores.  The game could seriously do with some user friendliness upgrades, such as being able to clear a whole \"program\" for an arm, or to copy it (so that one might save it when changing the type of arm.)  The story aspect is boring and the \"match 2\" game is not fun (and using greyed out colours doesn't help.)  When you are competing with a friend, it makes you do all the management of saves rather than simply offering something like \"hey you just had your best __x__ would you like to save\/replace the previous best?\"  Just another example of how tedious this game is.","While being one of Zachtronics' easier puzzle games Opus Magnum is still far from easy. Every single puzzle in this game is open-ended, as is usual with Zachtronics games, allowing for an infinite number of solutions per puzzle and the graphs just beg you to try optimising for cost, speed and area wherever you can (or you can ignore them and make the most outlandish solution you can think of). While Opus Magnum isn't the hardest Zachtronics game, it's certainly the one I find to be most visually impressive; getting to watch your machine work after programming the instructions and building it, especially when you've make a particularly fascinating solution, is mesmerising and downright satisfying.","This is a very good puzzle \/ automation \/ optimisation game, the story is fun (although totally optional and rather small), I love the in-built \"gif your solution\" feature and the option to build machines using the keyboard instead of drag and drop. The finished process can look incredibly satisfying. I still have half of the campaign and all the extra levels to go, so it looks like I will be busy for more than 100 hours.I wished there was a feature to zoom in and out, and to play only part of the sequence when building more complex processes.","MIND BLOWING!"],["I was looking for a game I could play on my laptop while I sit in my recliner recovering from shoulder surgery. I did some searching on the top puzzle style games for the PC platform and Opus Magnum showed up on every list I found. The reviews were good, requirements low enough and the price was right so I decided to give it a shot. I was up until 4 am yesterday playing so needless to say....I like it.The learning curve is a bit steep, or was for me anyway and it's my only issue with the game - and not a big one. While it does have a short tutorial to show the basics, if does not go into a lot of detail so I ended up sort of staring a the screen a few times trying to figure out what the heck I needed to do.  I had to turn to You Tube a few times to get an idea on some of the game mechanics, but just a little so it did not spoil anything. Plus there are so many ways to build what the game refers to as \"products\", it's highly unlikely watching a video will be a spoiler of any kind. Especially when you get into the later chapters where  the builds get a lot more complex and require a lot more thought.Getting a working design built is very gratifying and more so as the game progresses. But it is improving on a design and making it cheaper, faster, smaller, etc., where the game shines. If you have some Steam Friends who play you can sort of compete against their statistics making it even more interesting. Or you can find designs on You Tube and see if you can do better. But there are some obvious high level engineers playing this game cause some the designs I have found are just over the top.The interface is slick and clean and once you know what your doing it's addictive as all get out. If you like to see how things work and like to build stuff you will like this game and I highly recommend it.","Very interesting puzzles that will teach you to think very carefully about 60 degree rotations. The later, larger missions are hampered by some QoL conveniences that would be helpful such as turbo speed and undo. Fortunately the campaign ends before it gets too cumbersome, and of course there are plenty of extraneous content to do from appendices and the workshop.","OH  IT'S 5 AMbut if I stop now I will never figure out this mess of spinning gizmosso onwards I shall go","Highly recommend this fabulous puzzle game","Standard disclaimer: Play clock inaccurate, offline time not counted.Recommended, but with a caution.Another Zachtronics puzzler, Opus Magnum can probably be described as a steampunk Spacechem. Your job is still to build molecules in the correct configuration, except instead of optical tweezers and magnetic fields, you're using actual mechanical arms that can (and will) bang into each other. This creates a whole new level of difficulty that is both good... and bad. At the end of the day, Opus Magnum is a more beautiful and well-written game than its older bother Spacechem, but also one that can be much more frustrating.Beauty, Intricacy, and StoryThere's a lot to recommend this game. It's pure eye candy, easily the most aesthetically-pleasing Zachtronics game to date. Everything is lovingly detailed in a steampunk aesthetic, and watching your machines run is endlessly satisfying. From simple machines to mindwarpingly complex ones, watching arms and pistons shifting in time is just entrancing. Puzzles run the gamut from relatively simple to fiendishly complicated, and as with all Zachtronics titles, the urge to optimize is ever-present. Tinkering with designs, trying new approaches, and generally working a reworking puzzles will take up hours of your life. In a good way. You're going to get stuck. It's going to be frustrating. But figuring your way through those obstacles is part of the rewarding nature of a Zachtronics game, and you definitely get that surge of satisfaction here.Finally, the story presented is actually quite compelling. It's not simple filler narrative, but rather helps tie the whole game together into a plot arc that is very well conceived. That by itself is impressive, since it's little more than dialogue snippets, but it works remarkably well.But Some DentsWhile getting stuck on devising a solution is part of the delight of other titles from Zach, this one throws a very uncomfortable wrench in the works. Whereas other titles give you full control with no automation to trip you up, the engine driving Opus Magnum, however, does involve some inescapable automation, and that can cause headaches. Specifically, instruction sets aren't a fixed length unless you program them out all the way; if you don't, the engine adds padding to ostensibly synchronize operations. That sounds good on the surface, but if you rely on recursion-based solutions of inequal code length as a habit, you can find yourself fighting the engine's \"helpfulness,\" which can seriously detract from the fun of solving the puzzle itself. There's no manual or even thorough tooltips to help you out (such as in EXPAUNKS), so while most of the instructions are easily understood, there are some that remain quite opaque. The End of the DayUltimately, Opus Magnum is an excellent puzzler - which will not surprise Zachtronics fans at all - that has some unfortunate design choices that keep it from being one of the company's best. Fighting the puzzle is fun. Fighting the engine, less so. This is still a good game, but maybe not for as wide an audience, as the frustration of being tripped by the engine can get a little steep at times.","At time time of writing, I've owned the game for 3 days and I have 21 hours in it. My girlfriend wishes it didn't exist, but I give it a shining recommendation.","most ssatisfying","Zachtronics scores agan with a neat puzzle game built around linking and delinking of physical objects through rotation in a 2d plane.  Like Shenzen I\/O, it's a programming simulator, only this time you don't have to learn a programming language. The leaderboards are a nice touch for scoring -- \"How did that little  do this in 85 cycles, my best solution takes 115!\" (Yes, I'm looking at you... 0.O )10\/10","A great puzzle game with a compelling story, beautiful art style and amazing music. Highly recommended, though beware: you will have dreams about alchemy machines and marbles (elemental proxies!) after playing.","An amazing, very challenging puzzle game that introduces new concepts, mechanics and challenges in a way that's not overwhelming. Having many different tools to change how many ways you can go about your problem solving makes it feel like you're not in a box where there's only one answer. Machine go brrrrr.","Very engaging and challenging free-form programming game!","I am only 2 chapters in and am having a great time. Highly Recommend."],["Genuinely makes you think past the normal puzzle games. There is no singular right answer, there are multiple. It is up to you to decide whether or not you wish to merely complete or compete for the best solution.","Slept on this for far too long. Clever gameplay and a nice, clean interface. Very relaxing.","Great game to pick up for 20 minutes or an hour. You can make it as difficult on yourself as you want trying to optimize your machine.","very good game","Good game. Do your best to get it on sale. The story isn't too long, but there are extra puzzles on the menu.","Good puzzles but let me skip the story stuff. I play game 4 puzzle not story","Hexagons are the bestagons!","fun puzzle game with many solutions and it's not too hardif you get really really stuck on a puzzle just remember that any means necessary to solve it is validMy friend has a solution with over 22,000 cyclespro tip, don't peel your flares"],["Good puzzler to break your brain on.","Another great Zachtronics game!Although the main campaign is noticeably easier than the other ones (even Infinifactory) the bonus levels seem to make up for it with unique challenges (I have only just started going through the bonus levels, but they seem much harder than the main campaign which is nice).The gameplay itself is very satisfying, overall 9.5\/10Highly recommend","brain hurts","This is a fun game if you like procedural puzzles. I didn't get into the dialog, but you don't really need to. It crashed once, but I didn't lose any save data.","Really fun and satisfying puzzle game. check it out!","Fun and challenging game.I really like that you can compare the efficiency of your solution to other players.Totally recommended if you like to solve puzzles.","Opus Magnum is a pretty fun puzzle game. It is very relaxing and satisfying to create and code your machines and watch them work. The game-play is fun and easy to catch on to, but still provides a challenge for more complicated levels. The only real negative I have about this game was that I found it was difficult to get invested in the story with story points only given to you as back and fourth text boxes. The main game is also rather short and I beat it in around 30 hours, but there are still plenty of other non-story missions to do, as well as player made puzzles from the steam workshop. Although the story wasn't the best, the game still succedes at its primary goal which is to be a satisfying and relaxing puzzle game. This game is a great game for beginners who want to relax to something not too challenging. If you are looking for a major challenge, this might not be the game for you, as I found most of the main story missions to be rather easy to complete, the challenge however comes with optimizing you machine for speed, cost, or area, all of which the game keeps track of to be compared to yourself, or to friends. In my opinion the true beauty of Opus Magnum is how satisfying it is. To me there is just something so satisfying about building and coding your own machine, fixing mistakes and solving problems until it works.","I love puzzles and thought I'd love this game, and tried to, but  can't. The puzzles are super simple but time consuming to construct. It's more of machine design rather than puzzle. It's like solving 100 easiest sudokus. It doesn't challenge you in any way except of having patience."],["Programming, and at the end one can have a really cool gif generated of the solution. I never felt particularly frustrated with any given puzzle, because there is almost always a brute force approach, if that puzzle wasn't particularly interesting. A lot of the fun for me was trying to build solutions that are cheap, small, or fast. My favorite was building fast engines.","An engrossing puzzle game","Incredibly fun and tough puzzles. If you've ever played space-chem, this is better in every way, as far as I'm concerned. There's a lot of content, and then there's custom puzzles on the workshop if you ever somehow run out.","Is very fun.","Opus Magnum has a truely unique approach to puzzle games, given a number of tools you program out how they operate in-order to manipulate precursors into a desired alchemical compound. I have had alot of fun working through all the different problems, and is great if you enjoy solving design problems.",".","Solid, polished programmatic\/control style game. Last couple puzzles are a bit rough. Good replayability by optimizing for various metrics, community content. Could use a few more affordances, there is no zooming or panning, and the game area is affected by the resolution you run it at. Some of the more complex puzzles thus require you to be at a higher res."],["I just got done with leetcode hitting 90% percentile on DP HARD. Now I'm playing this game and barely scoring bottom 20% percentile.","I generally like Zach's games and I was sure I'll like this one as well, but... I can't quite explain it, while everything is actually really fun, the game just didn't have the right 'pull' to get me to play more.I'm pretty sure this has nothing to do with the quality of the game itself, but just me - I don't think I align well with these types of puzzle games.You might, on the other hand, so just go and give it a go, its highly probable you won't regret it.","Clock is 2:00am, i have to wake up at 5:00am to get to the work.. but i need to fix this one machine","good","Maybe the most beautiful puzzle game of Zachtronics so far.  It starts easy, and becomes more challenging by time.  You can revisit and improve your own solution.  There are multiple ways to solve these puzzles and you can compare your solution with others.  If you like puzzles, where you need to define a process to get the desired result, this is definitely worth a buy. Programming skills can be useful as you may consider using systematic methods also found in algorithms, but the interface is purely graphical and no input of code lines is required.  If you like to type in code, check out Exapunks or Shenzhen I\/O.","an actual open ended puzzle game, you can solve it any number of ways but its down to your wit to make it more efficient","Neat idea, but it starts to feel like a job more than a puzzle game after a while. Very clunky controls with few shortcuts when designing things.","!","Fun game with great puzzles.","My favorite Zachtronics game and probably the favorite puzzle overall. The atmosphere, the story, the music, the puzzle themselves, the extremely satisfying physical look and feel of mechanical system executing your program - all of this is just perfect."],["Probably the best Zachtronics game after Spacechem. I've already played 10 hours and still find it great.","Somewhere between the 11+ and Tetris.","Finally, I can turn lead into gold!","can't stop playing. plz send help.","One of the least overwhelming Zachtronics games. Consequently one of my favorites. :)","If you like programming, this is the puzzle game for you","Awesome Puzzle Game!Relaxing and satisfying","Great puzzle game.  As a lover of TIS and other programming games, this one is very beautiful, and straight forward.  Does require the ability to spin things in your head.","This game broke my Tab key","Yes","another zachtronics masterpiece","I haven't seen my family in 2 days, all I know now is alchemy and automation.","Basically hex-grid Factorio, but instead of iron plates you build the atoms of elements by creating a layout of instructions that works like a sheet music score. Really simple to understand but becomes really complex quickly. The puzzles generally take 30-45 minutes to solve, so it's basically short burst factorio\/satisfactory. Really great time killer.","i can play this for hours, the scores against others makes it competitive.","This game is all the fun stuff about programming that I love without all the hassle of actually programming. Also the art is beautiful and the soundtrack is amazing.I want more?","Very Fun Puzzle GameEFFICIENCY MUST BE PERFORMED!","I love it!","+1","This such an amazing and unique game. I would say it's like a puzzle Factorio and it's just so much fun, i can spend hours on the same puzzle just to find a way to make it more efficient, cheaper or prettier.I got it on sale but honestly the game is worth every penny. The art and overall design of the game is truly something amazing, i love playing as an alchemist. Can't recommend it enough !","I decided to try it out around 6 PM, and a few minutes later it was 4 AM.Complaints:Main campaign was too short. Only took a few minutes.Somehow it makes me sore and thirsty in just a few minutes.Got fired from my job for playing for a few minutes during my morning coffee break.","Get this if you liked Space Chem.","Ruins your (normal) life.Me? Well if ruined life does look like this I'd 100% want more of it.","As my first Zachtronics game, I can say it certainly lives up to its reputation. For a while I've been interested in the other titles but this one just so happened to be on sale. The puzzles are certainly good enough to keep you entertained for a while, some of them I've done multiple times now, each time optimizing different aspects of it. The artstyle, music and plot are also pretty nice : you usually don't expect worldbuilding from most puzzle games but personally I'm glad it's there.Gameplay wise, I, as a programmer, am having a great time with the puzzles, both the easier ones and the harder ones. My brother, a veterinary doctor, also bought the game and got a headache from playing it within the first 2 hours. The takeaway from this is that the game might not be for everyone : if logical and analytical thinking aren't your thing, this game might not be for you. If, however, you're a fan of these kinds of things, then the game will be nothing but great.","brain hurt","Great puzzle game, will hurt your brain as you figure stuff out. If you liked SpaceChem, you'll like this.","help im already addicted","A decent machine puzzle game. I did not find the story or the puzzles engaging, but your mileage may vary.For a more detailed review of Opus Magnum, check out my blog: https:\/\/davesgamesandreviews.blogspot.com\/2021\/02\/opus-magnum.html","It's fine, but nothing spectacular. Definitely not worth the full price, but you can get it on a discount below $10. What I liked the most is that it isn't cryptic and you can figure everything out in the game without having to read manuals.","Each puzzle gives you a new challenge. Complicated but extremely rewarding"],["very amazing game absolutely would recommend it","This made me feel intelligent.","If you like puzzle games\/engineering, get this game, and the whole bundle while you are at it.","Feels like the rewarding aspects of programming, however presented in a visual and gamified setting.","it good","Cool game, this game has leadbords for the efficiency aspects, they kinda incentivate you to improve your machines i wish the aspects that are tracked were diferent, because max efficency in 2 of those aspects are very simillar and boring to create meaning most people will probably only play the puzzles once or twice","Great puzzle game all around. Just get it.","Great game.  It is essentially teaching you programming basics.  It's very satisfying when you create a machine and can see it actually work!","A programming game about altering and bonding \"atoms\" to create complex \"molecules\".","It is a really interesting game. The more you play, the better it gets. It starts easy and becomes a headache, a nice one though.Many of Zachtronics' games have this \"programming\" style, which is really appealing if you are a programmer yourself or you like puzzles","+","Good engine building game for those that are into it.","As someone who has played The Codex Of Alchemical Engineering, I was just expecting some new puzzles with better graphics... However, I was surprised by the quality of the game. It not only challenged me but kept me involved, and the mechanics are waaaay better than The Codex Of Alchemical Engineering. Also I really enjoyed Sigmars Garden, which is a relaxing size puzzle which can ease the brain in-between main puzzles. Really loved this!","Optimal purchase.","My favourite game i played in 2020game is simple enough for it to be easy to learn, but deep enough to allow for tons of hours of fun","Great until a crash lost literally ALL OF MY PROGRESS AND SAVES. Thanks Zachtronics. Really love losing 40+ hours of work.","Challenging and very fun, with lots of room for replayability.  The story is minimal but that is a positive.. it's entertaining without being distracting or overbearing.   I went through all of the game several times to optimize solutions as much as I was able.  I've tried some of the workshop puzzles, but found that the developer's puzzles are more enjoyable.  I wish there were more.","Very satisfying mechanics. Sigmar's Garden is also excellent.","magnificent!!!"],["This is the first Zachlike I've played and I'm blown away. 10\/10 pretty unique puzzling action.PS: the story was also quite good.","This game makes you feel ultra smart but tires you out pretty quick","It's Zachtronics. If you like one of their games, you'll like all of them. This one is somewhat less difficult than previous efforts, which makes it a touch more playable in the long term as opposed to a game you do a few puzzles in before tearing your hair out and needing a day or two to forget about the rage and get back to cosmic braining. The obligatory solitaire minigame is somehow even more fun than the programmatic puzzling, and I hated it at first. Very fun.This might, hilariously, be the Zachtronics magnum opus. Strong recommend.","Starting with very simple and easily understand mechanism. Then slowly increase the complexity of puzzle with the same mechanism though out the level. Is very satisfied after solving an difficult level.","Honestly, this is one of my favourite games of all time, though its niche is quite specific. The only thing I really don't enjoy are the levels with an infinite-chain product.","Very fun open ended puzzles.","Fake chemistry is the best chemistry","Excellent puzzler with a light story. More like the classic Spacechem and much less obtuse than TIS or Shenzen I\/O.","This game really gets my brain working. I really enjoy the process of building the products and keep thinking of ways to streamline the processes.","The puzzles are great, the statistics provide replayability to try and improve, story and art are fantastic. Only problem is that the main campaign is too short.","The puzzles are very fun and allow some level of replayability, in that they are scored based on three factors: cycles (number of movements), cost, and area (number of squares used). Because of this, you can play puzzles multiple times in order to try to get better scores for one criterium (but often to the detriment of another), such as a solution that sacrifices size in order to be cheaper. The \"story\" can be ignored (all it does is give context to the puzzles), but adds a small dose of humor to the game through dialogue between your character (a know-it-all alchemist) and your character's friend (a helpful fellow alchemist who isn't putting up with your antics).","good game","fantastic gamethe puzzles are of course great, as all of the other reviews will tell youAlso worth noting is that unlike most other puzzle games I've played, the puzzles are actually part of the story. Like instead of having events arbitrarily represented as puzzles (ex: canonically you're physically fighting something, but the gameplay is a match 3), these puzzles are what the protagonist is actually doing. The story itself is pretty solid too. The dialog is all great.also the music is pretty jammin, in a hypnotic kind of way. I'll probably put on the soundtrack when studying"],["Your stupid minigame is terrible and makes me hate this game as a whole because of just how bad it is.  How could you take a decent game and put THAT in it?","An engineer's dream game. A perfect game for puzzle lovers and people who love building machines.","<3","unique puzzle game","Love it. It is nice looking and addictive logic game. You can make it as easy\/difficult as you want. It is very rewarding when you find or improve your solution, and you can compare its efficiency with other players.","Just finished the main game! was really fun and engaging, remembered this game from NerdCubed a while back and didnt find it as challenging as he said it was however very enjoyable none the less. 8\/10"],["I was never big into Puzzle Games, but I was instantly hooked onto this.Easy to learn, complex to master and extremely addicitve.Great storytelling, too.","I mainly just play the Sigmar's Garden gamemode after unlocking it, but that mode is a great idle game to play while watching or listening to something.  Would play a standalone version of Sigmar's Garden if they ensured all generated boards could actually be cleared and provided some larger boards and harder difficulty options, but even what's here is a great minigame.The rest of the game game is pretty good too, for what it's worth. I'm just weird and like the random solitaire mode better than the core gameplay lol.","Mind-bendingly addictive!"],["A great example of \"difficult to use\" vs \"difficult to solve\".Most of my playthrough was spent wrestling with the horrible editor mode. There is no rewind button, no way to preview \"return\" instructions, no way to comment or highlight instructions, no utilities to preview what a change would look like at a certain point of the timeline - so I'd say at least 50% of my playtime was spent half-blindly moving 1 instruction and replaying THE ENTIRE SOLUTION FROM THE START to see if I guessed right where it needed to go. Playing this game felt like a nonstop anxiety attack.Turns out, some of the QOL features I wanted -are- in the game, they're just not explained anywhere except the options menu! Alt-click an instruction to fastforward, ctrlclick+drag to copypaste instructions, select and A or D to mass-rotate. My playthrough definitely would've been much less annoying if I had known these from the start. Even with these, the editor needs a lot of improvement still.The rest of the game is good. The presentation, in particular, is great. But 95% of your playtime is spent in the editor mode that I've spent this entire post rambling about.","fun","Perfect for players who like optimization, high scores, and challenging themselves in general. And remember, once you understand the commands, the game transforms into a dancing partner.","My brain hurt help","A great example of \"difficult to use\" vs \"difficult to solve\".Most of my playthrough was spent wrestling with the horrible editor mode. There is no rewind button, no way to preview \"return\" instructions, no way to comment or highlight instructions, no utilities to preview what a change would look like at a certain point of the timeline - so I'd say at least 50% of my playtime was spent half-blindly moving 1 instruction and replaying THE ENTIRE SOLUTION FROM THE START to see if I guessed right where it needed to go. Playing this game felt like a nonstop anxiety attack.Turns out, some of the QOL features I wanted -are- in the game, they're just not explained anywhere except the options menu! Alt-click an instruction to fastforward, ctrlclick+drag to copypaste instructions, select and A or D to mass-rotate. My playthrough definitely would've been much less annoying if I had known these from the start. Even with these, the editor needs a lot of improvement still.The rest of the game is good. The presentation, in particular, is great. But 95% of your playtime is spent in the editor mode that I've spent this entire post rambling about.","My brain hurt help","fun","Perfect for players who like optimization, high scores, and challenging themselves in general. And remember, once you understand the commands, the game transforms into a dancing partner.","its gud","If you like puzzles, programming, or optimizing your solutions, this is an instant buy!","its gud","If you like puzzles, programming, or optimizing your solutions, this is an instant buy!","Absolutely superb theming\/aesthetic, cute writing, FANTASTIC soundtrack. The game itself involves arranging and programming little robot arms and machinery to automatically move \"elements\" around, arranging them into specific (and increasingly complex) patterns to complete each level. I'm awful at puzzle games, so I didn't make it very far into this one, but the time I did spend I definitely enjoyed!","Absolutely superb theming\/aesthetic, cute writing, FANTASTIC soundtrack. The game itself involves arranging and programming little robot arms and machinery to automatically move \"elements\" around, arranging them into specific (and increasingly complex) patterns to complete each level. I'm awful at puzzle games, so I didn't make it very far into this one, but the time I did spend I definitely enjoyed!","This is an incredible concept of an open-ended puzzle game. There are many factors to consider when designing your transmutation devices. If you want to make the products faster, you'll have to use more resources. If you want to be cheap or small, you need more instructions. How you want to build the machines is all up to you.","This is an incredible concept of an open-ended puzzle game. There are many factors to consider when designing your transmutation devices. If you want to make the products faster, you'll have to use more resources. If you want to be cheap or small, you need more instructions. How you want to build the machines is all up to you.","it's not that hard, 11 hours and almost finished the game. But more than once I told myself that it is too much for one day's work.","Really enjoyable puzzle game. Actually got me into programming.","Really enjoyable puzzle game. Actually got me into programming.","it's not that hard, 11 hours and almost finished the game. But more than once I told myself that it is too much for one day's work.","It's  fantastic","very fun"],["Just hit 300 wins on Sigmar's Garden","Just hit 300 wins on Sigmar's Garden","the way that complex systems arise out simple problems in this game is fantastic. The completely open ended problems give so many options for ways to play and the rating system is great for replayability. also, and i don't hear this mentioned often the in between dialogue and story that aren't necessary to the gameplay at all but still are pretty interesting on their own. 10\/10 for sure","the way that complex systems arise out simple problems in this game is fantastic. The completely open ended problems give so many options for ways to play and the rating system is great for replayability. also, and i don't hear this mentioned often the in between dialogue and story that aren't necessary to the gameplay at all but still are pretty interesting on their own. 10\/10 for sure","I've made water in the most complicated way possible and loved every second of it.","I've made water in the most complicated way possible and loved every second of it.","(10\/10)The conflict between beauty of symmetry and ugliness of brute force is called art.","(10\/10)The conflict between beauty of symmetry and ugliness of brute force is called art.","Super fun puzzle game. Even though I can't beat the game, the levels that I did play were a blast. 23 hours is worth the money I spent.","Super fun puzzle game. Even though I can't beat the game, the levels that I did play were a blast. 23 hours is worth the money I spent."],["nowhere else can i procrastinate my in-game work with another game inside the game","99\/100.1 point deducted cause no idea what Opus Magnum means.","nowhere else can i procrastinate my in-game work with another game inside the game","99\/100.1 point deducted cause no idea what Opus Magnum means."],["Nice, relaxing puzzle game.","This game is completely different from any other game I've played. You play as a Renaissance Alchemist, creating various alchemical  compounds from a selection of alchemcal components by building an Alchemical Machine from various machine parts that can assemble the compound in a sort of \"industrial\" way.You might look on YouTube for \"O)pus Magnum\" game plays.","This game is completely different from any other game I've played. You play as a Renaissance Alchemist, creating various alchemical  compounds from a selection of alchemcal components by building an Alchemical Machine from various machine parts that can assemble the compound in a sort of \"industrial\" way.You might look on YouTube for \"O)pus Magnum\" game plays.","Downloaded the game at 2 AM. Realized I was still awake at 10 AM. Felt like no time had passed at all.","Downloaded the game at 2 AM. Realized I was still awake at 10 AM. Felt like no time had passed at all.","I actually like these kind of puzzles","I actually like these kind of puzzles"],["Well constructed logic game. You are tasked as an alchemist to create compounds out of atoms using alchemical machines. The game takes place without any of the actual atoms seen, only marbles that are used to represent them. The plot is wonderful so far and the gameplay has been interesting and perplexing. That said, I haven't finished it yet, I only wrote something cause why not :PI would most certainly suggest this game to anyone who likes logic games. So feel free to try it out, it's very fun.","This game is turing complete.","22 hours at time of rate:Great game for the puzzler type. The saying: \"Small, cheap or efficient, pick any 2\" has good application here.  The iterations to refine one or more of these , will have you coming back to refactor your solutions. Every puzzle task has multiple correct solutions. Build an expensive, huge and cycle hungry prototype. You could just stop there, and progress the story -or- you can tune your prototype to be better. The game allows you to 'store'  multiple solutions for each puzzle task, so you can come back later and tune more -or- create a new better solution. The game progression so far is pretty well laid out.  You learn new skills that you will leverage and expand on in the next puzzle. The game also supports creating and sharing custom puzzles with others, I am not there yet, but this should extend re-play time significantly. There is an export feature, that allows you to share animated GIFs of your latest solution with your friends. Once you reach a certain point in story line, a mini solitare game mode unlocks - this time rather than putting pieces on the board to solve, you REMOVE pairs of items in a specific order. Exploit the best pairs available and clear the board, you win -or- oops and hit a dead end. So yes, if you looked at this on the list more than once, you probably should just get it and start exercising your spacial reasoning......","Do you like puzzle games that let you use any method you can think of to solve them? I do. This game lets you solve mostly how you like, and only needs the appropriate output. There's 3 different statistics you can see compared all the other players and your friends. I like to optimize for lowest cost, but you could optimize for shortest time or smallest foot print. Or! Not even optimize! Just getting it done in any way.The downside is if you have trouble visualizing the movement it'll make creating solutions more challenging. You can step through the commands 1 at a time to test so if you kind of have an idea it makes it easier to get  it working."],["A phenomenal and elegantly crafted puzzle game. Opus Magnum combines utility and beauty if very satisfying and creative way. Being entirely open ended with it's solution, yet incentivizing maximum efficiency in various ways. It's minimalist narrative is also enjoyable, and sets appropriate tones for the gameplay in a sensible way.","A very clever game. By its nature as more of a \"free-form\" puzzle game (no budget cap), you can beat most levels with an inefficient, inelegant solution but it just feels wrong so you avoid doing it.The bonus levels with space constraints are where thinking is mandatory.I never found myself getting completely stuck on a puzzle so I guess this game might suit people who feel bad for searching up solutions online.Bonus points for the witty writing, good music, satisfying sound design and elegant artwork and UI.","A fun little game in which you construct machines to solve problems.  The alchemy theme gives it a nice ambiance.This is easily the most accessible of the Zachtronics puzzle games (I have the full set). In several of the others I feel like I'm fighting the game's UI, trying to cram a solution into a small space, sometimes with an interface that makes it awkward to rearrange parts.  In Opus Magnum you can lay out the solution in an open workspace, get it working, and then optimize it if you're so inclined.  They've come a long way since SpaceChem.Opus Magnum lacks the multi-page offline reference documentation that some of the other games require you to read through. Everything you need to know is in the game, right in front of you.","Nice, I can put more than 6 arms (mouse wheel scrolls up and down), and the page is wide enough (hold right click to navigate)  for more instructions, late realization after progressing through chapter 4 lol."],["Why didn't I play this earlier?!?!","Very enthralling and relaxing game. Watching machines at work is very soothing experience. Also marble mini game is a very nice add on. I warmly recommend it.","Good","This is a great game that lets you think about solving problems in the most efficient way with a limited amount of given resources. I really like that you can undo\/redo your last actions with the common ctrl+z\/ctrl+shift+z, also selecting multiple commands and dragging them around all works perfectly. I highly recommend this game to anyone who likes logical puzzles where there are a million ways of solving the problems."],["I have found the puzzles in this game tough, but not impossible, which makes it a lot of fun. I highly recommend for those who like puzzles.","I'm not... good at this game. At all. I'm usually past the average for cost, size, and number of moves. But the feeling of finally getting something to work after what feels like hours of trial and error? *chefs kiss*","great game for brainiacs","Incredible game.It has programmation, automation , cost, space and energy efficiency.I though I was a smart guy but chapter 1 is allready quite the challenge.I will come back to it with great joy every now and then.There\"s some kind of mystical beauty to it.Dive in!"],["It's good. really good, where is my time gone?","A good zachtronics puzzle game. If you like puzzles, assembly programming, and satisfying gif animations, then you will probably like this.","This could easily be your game if you regularly get rushes of creative and mental energy but have no idea what to do with it. Opus Magnum truly lives up to its name. Some how the developers managed to make an incredibly open-ended puzzle solving system that is easy to pick up but full of nearly endless possibilities. Vast creative potential is quite unusual for a puzzle game, and can seem daunting at first with \"writer's block\" actually coming up fairly frequently. But just like with writing, the answer is to just start putting words on paper, or in this case, placing pieces and just trying to make a semblance of a solution no matter how ugly. Try to remember this: The challenge should not be with making a solution, but making a beautiful solution. Here beauty really is subjective. One may find it in a mechanism that is wonderfully symmetric, incredibly compact and complex, or just minimalistic. It's really up to you, and that's what makes this game so good.","9\/10 not a classical puzzle game---{Graphics}--- You forget what reality is Beautiful Good Decent Bad Dont look too long at it Paint.exe---{Gameplay}--- Very good Good Its just gameplay Mehh Starring at walls is better Just dont---{Audio}--- Eargasm Very good Good Not too bad Bad Earrape---{PC Requirements}--- Check if you can run paint Potato Decent Fast Rich boiiiiii Ask NASA if they have a spare computer---{Difficulity}--- Just press A Easy Significant brain usage Easy to learn \/ Hard to master Hope you like thinking Dark Souls---{Grind}--- Nothing to grind Only if u care about leaderboards\/ranks Isnt necessary to progress Average grind level Too much grind Youll need a second live for grinding---{Story}--- Story? Text or Audio floating around Average Good Lovely Itll replace your life---{Game Time}--- Long enough for a cup of coffee Short Average Long To infinity and beyond---{Price}--- Its free! Worth the price If u have some spare money left Not recommended You could also just burn your money---{Bugs}--- Never heard of Minor bugs Can be annoying ARK: Survival Evolved The game itself is a big terrarium for bugsIf you have never played any Zachtronics games, this is the prefect game for you to start with. Not as technical or a steep learning curve as Zach's other games. Brilliant","Often suggested to me by Steam, I did not realize Opus Magnum is a programming game.The goal is to build some kind of molecules using all sorts of programmable mechanical arms as well as rails and various some state-changing devices.Every problem can be done trying to minimize price, time (speed) or used space.  You can literally go nuts with how you want to approach the task at hand.Once submitted, your solutions are compared to the ones of your friends and you also see how you fare compared to all the other players.The game has also an hypnotic quality : I could spend minutes watching the solution move and assemble piece after piece after piece.As a sort of bonus the game also contains a kind of puzzle game but I've not tried it.Warmly recommended.","If you've liked other games by this developer, then you'll like this one. This one is pretty easy to pick up as instead of having to learn a coding language, you have a simpler set up of placing components and setting their movements. The storyline is intriguing, I haven't completed the game yet so I don't know what happens but it's definitely engaging and makes you want to play more.","This is one of those puzzle games where there is lots of joy in figuring out a solution......but then even more fun is found when you try the puzzle again!The game is essentially a puzzle game about programming (without any confusing syntax to learn), and the best part of it is that it measures success in various ways. You can complete a given puzzle, yes, but you can also make a solution cost less money\/take less space\/work with fewer cycles. You can compete with yourself trying to lower any of these, or compete with your friends on steam, or just look at the graphs for the world wide data. A lot of the fun is just learning to solve something in a better way, if this sounds interesting to you I highly recommend it!"],["excellent brain work... doesn't feel like work... can't stop"],["Superb way to concentrate and take ones mind of the troubles of everyday life.Also very nice introduction easing the player into new puzzles with ever growing complexity.Looking forward to play more.","Brain teaser, great thinky game"],["Not a puzzle game fan in general, but love this one.","A puzzle game which dares to give you infinite freedom in finding a solution and still manages to be challenging. I highly recommend this game to those who are not satisfied with simply completing things but have a desire to optimize."," RecommendedAlchemy: the science of understanding, deconstructing, and reconstructing matter. However, it is not an all-powerful art; it is impossible to create something out of nothing. If one wishes to obtain something, something of equal value must be given. This is the Law of Equivalent Exchange, the basis of all alchemy. In accordance with this law, there is a taboo among alchemists: human transmutation is strictly forbidden - for what could equal the value of a human soul...?SummaryMaster the intricate, physical machinery of the transmutation engine the alchemical engineers most advanced tool and use it to create vital remedies, precious gemstones, deadly weapons, and more.Design Machines - Design and build machines that carry out alchemical processes using a variety of components.Open-Ended Puzzles - Compete against your friends and the world to build the simplest, fastest, and most compact solutions. Export animated GIFs to show them off.Steam Workshop - Make and share your own puzzles with full Steam Workshop integration and an easy-to-use puzzle editor.Solitaire Minigame - Take a break with Sigmars Garden, an original alchemy-based solitaire game.Game Information   Active Development?  Yes, recent activity    How Long to Beat Main Story: 15 HoursMain + Extra: 25 HoursCompletionist: 49 Hours  Metacritic Score90   SteamDB Score 93.74 Playerbase   Peak Daily Players 98 on 10\/25\/21    Estimated Owners 200,000 .. 500,000    Average Playtime 12.80 Hours Compatibility Table   Windows  Native    macOS  Native*    Linux \/ Steam Deck  Native  * The macOS (OS X) version of this game might not work on macOS Catalina (version 10.15) or later due to the removal of support for 32-bit-only apps. LinksIGDBIsThereAnyDealPCGamingWikiSteamDB","Probably the most accessible of the Zachtronics games. Highly recommended for good puzzletimes.","Opus Magnum is not for everybody. If you think it might be for you, try it. Refund it if it's not. If it is, you'll probably just know.","As a puzzle game it is glorious. Plus community potential to make more keeps it open as a continuing game option for devices with low spec.","This is the best puzzle game I've ever played, I've found myself going back to previous puzzles to resolve them better than I could before","Its a fun little puzzle game that you don't have to attend, you can get up, walk away think and come back to it when you can. The main story also helped me get through it. The garden game was a bit much, but for some I could see it being more fun. Good game though and I want a follow up on the story now too :)","Simply an amazing puzzle game!","another Zachtronics classic design"],["Amazing puzzle game!","Opus Magnum is satisfying in a way all puzzle games should strive to emulate. It's open ended enough that you feel like all your decisions are yours and are therefore rewarding. Even if things don't work out in the way you intended, it's still a joy to see the little machine you created go through it's instructed motions.","Amazing puzzle game. Can spend forever optimizing solutions.","Great","Important controls that don't get explained: right click + drag: grab (and move) (works in the playing area and the timeline) shift + click: add to \/ remove from selection ctrl + click: copy selectionReview:This is the first Zachtronics game I completed so far. I haven't put any time into optimizing my solutions, yet. Out of all spatial engineering games from Zachtronics Opus Magnum has my favourite concept. It also feels like it is probably the easiest of those games.Sadly, I must say that I prefer true puzzle games over these pseudo-engineering games and here is why: in a puzzle game, a hard level might make you think for 2 hours, but then the execution is really quick and takes only a minute. In Opus Magnum, it feels like the time ratio is exactly the opposite. Coming up with a concept for the level solution takes on average 3 minutes. Programming all the components and \"debugging\" can take an hour in the more complex levels.Obviously, if you actually put time into optimizing the levels, then it might get more challenging and you might spend more time on finding a solution than on its implementation. So the game has good potential to actually get better, the longer you play.Overall, I still recommend the game.","brain hurts"],["Very engaging puzzle game.  Becomes fairly challenging early on, which can only be a positive thing if you're into this kind of game.  I'm about 16hrs in and probably have many hours of tinkering and redoing before i finish the campaign.  And there are more puzzles to do through the workshop","This is one of those games that requires you to use your brain and stretch it a different way each level. If you're into logic puzzlers and\/or interactive programming, this one is definitely for you. The story is interesting and the dialogue is fun, but you can just steamroll your way through if you just want to get to the making-things part. It's a great game that requires patience.","Fun puzzles (somewhat awkward UI for programming the widgets) that lead to very gratifying solutions","My 2nd favorite Zachlike after TIS-100","First things first: If you enjoy\/enjoyed FIRST robotics, or otherwise have an affinity for engineering, this game is right up your alley. The gameplay and story are both tailored for you. Alternatively, if you're a fan of SM64's \"A button challenge\" community, this game might tickle your fancy  the challenges it presents are usually in that vein of \"how low can you go and still complete the objective\". The one big issue with the game is that it doesn't draw enough attention to several controls and options that are essential to keep the programming part of the game from getting tedious really fast. When you first reach the main menu, click the button in the bottom-left corner, then choose \"controls\". Copy down everything you see onto a sheet of paper and keep it handy as you play, at least until you're familiar with what they do and how to use them. You'll be glad you did.And also, another thing that doesn't attract enough attention: After you've beaten the game, click that same button and choose \"Options\", then enable the option labelled \"show top percentile\". This option is only made available after beating the game; it allows you to see near-optimal cost, area, and cycles needed for each puzzle. Going back and attempting to match them adds additional enjoyably frustrating playtime you might otherwise miss.To the devs: Aside from drawing more attention to these options, please allow triplex bonded cardinal elements and salt atoms in the level editor! It's entirely possible to make such a thing happen in gameplay by applying the Glyphs of Calcification and Duplication to fire atoms that have a pre-existing triplex bond. It's a fascinating interaction, but there's nothing in the game that allows you to apply that knowledge, and currently you can't even custom-build a level to put that concept into practice, so it's a bit of a disappointment.","I play it for the story. Also Sigmar's Garden. But also for the puzzles.","good game","This game... is phenomenal.This is classified as an \"open-ended puzzle game\" which means there is no 1 or 2 ways to solve each puzzle. My wife and best friend play this game and each of us have solved each problem differently. That fact alone makes this game a gem.The stats you receive at the end of each solve help gives you an idea of how you did in comparison to others going off of 3 categories: cost (the different pieces cost different amounts), cycles (how fast or slow the machine produced the product) and area (how much space your machine uses). The catch with each of these categories is that you can never (I believe) be the most efficient in each category, you're going to have to give in some category. My wife's solutions are usually cost effective and smaller, but mine are usually completed faster.I was also more engaged with the story than I thought I was going to be. Usually the story is puzzle games is okay at best, but you're actually invested (to some degree) of the main character's growth not only as an alchemist but as a person.The biggest con against this game that I can give is you need to go at each puzzle with a fresh mind, at least for the puzzles in the latter half. I was showing visible frustration when I tried to do a puzzle after a tough day at work and no matter what I tried I couldn't get my machine to work. After taking a break I fixed it in 5 minutes.I would be MORE than okay with this game getting a sequel, maybe with new machine parts and new elements and twists, but what we have here is MORE than enough for endless hours of puzzle fun.Also you can make your own puzzles and upload them (only after you yourself completed it, of course)","really solid zachtronics puzzle game"],["fantastic","Opus Magnum is an excellent puzzle game with programming elements. It is probably my favorite Zachtronics game. Even if you are not much for programming games like TIS-100 or SHENZEN I\/O, this game is very enjoyable. The visual approach to programming makes it that much more satisfying when you find a solution. Solved puzzles don't just work, they're mesmerizing. Even when you have completed a puzzle, it is still fun to go back and try to make your machine faster or cheaper or smaller. The later solutions can definitely get tricky, but there is plenty of help available on the community hub.","To be fair I'm terrible at it but it's just too much fun","A puzzle game that actually requires you to think. Is more about how well you can solve the problem, rather than if you can solve it or not. 5\/5"],["It's SpaceChem, but with every QoL improvement you could want.","Makes me head hurt 10\/10","i just got this game and i havent seen the sun since","Not my favorite zachtronics game, but it's still a zachtronics game, so you should play it.","Game's characters have great chemistry.","Mechanical programming game. Reminds me of engineering assembly language but game version.","Extremely clever - a puzzle game with where the designer doesn't have to make a solution. Love it (although the UI could be a bit more clear at first).","Only finished the first story arc...very good so far","If you like solving problems and puzzles this is your game.",null,"You buy the game to solve puzzles, but end up playing it for Sigmar's Garden."],["Best GameBEST GAME","very fun","Exactly what I was looking for in a puzzle game. The puzzles were very enjoyable to solve and while the story is not mandatory, it does enrich the experience.","It's my most enjoyed Zachtronics game. It's elegant and stimulating, although it's easier than others, it's not a bad thing because you can actually play it even if you don't know  about programmingThere aren't many puzzle games as deep and as well crafted as this one. An actual masterpiece (pun intended)","Love this game.","Fun game","I absolutely loved the game. It gives you a ruleset and a bunch of instructions and from there on it's entirely on you to figure out a way to solve the puzzles. It really got me to think about a lot of aspects of mass production i hadn't really considered before and i really feel like I've learned a lot since i started playing. Every puzzle is unique in it's own way and requires different approaches in order to really get the optimizations in. I can't say it's a game for everyone, but if you like to plan, automize and optimize stuff you'll love this too.","Very nice and engaging puzzle game. The puzzles will have you trying to optimize them in many different levels. Which will keep you engaged for some time.","C tro bien","atoms no smacky :(",null,"I just finished the main game, and if you like puzzle\/optimization games Opus Magnum is great. I already recommended it to a couple of friends and grabbed more of the Zachtronics games.The main game requires some thought but is very doable. I just started the post-story\/campaign challenges and they are much more difficult. Between the extra challenges and the ability to optimize your solutions indefinitely it has a lot of replayability.","the best","Just, wow! Where did the time go? Challenging and wildly creative. Don't miss this!10\/10"],["It's programmer crack, in a lot of ways. Lots of visual satisfaction.","I like the emphasis on designing a process to make a specified product in an efficient manner.  The tools are simple to understand but provide enough degrees of freedom for creative solutions.  Also nice to get feedback on how your solutions compare to others in terms of \"cost\", speed, and area coverage.  Highly recommended if you like puzzle games and are similarly inclined.  Note:  there's a \"story\" too, but it's just a mildly amusing side-note that one can skip through.","wonderful puzzles!!!!!!!!!!!","It's a Zachtronics game, what can I say. There's enough puzzles in the base game to be worth it already. but the Steam Workshop will provide plenty more for you. Just remember that two atoms cannot collide and you should be fine, especially since the game will tell you about a thousand times.","A game that fosters the spirit of engineering","Yes.","The level of autism required for this game dangerously high."],["Excellent puzzle game.","Has a little bit of a learning curve, but once you learn what each function does the game becomes incredibly entertaining.  It also includes Sigmar's Garden, a puzzle minigame thats similar to Majong, which is worth the price of this game alone in my opinion.","nice"],["great game for those smart enough to grasp all of its intricacies. Definitely not for everyone, but this game struck a chord with me. The freedom to make extremely stupid brute force solutions to make max efficiency machines, Opus Magnum lets you do whatever you want. For me though, the best part is the ability to optimise and find the point that your design has hit its peak, just to scrap it all so you can optimise further. (I tend to optimise for cycles, or speed). Also comes with a cool little minigame called Sigmar's Garden, with a harder version in the journal. Great for brain warmups or casual fun!","It's a decent game until you get to the post-campaign puzzles. Zero introductory puzzles to the new mechanics, Zero explanation of what you can and can't do. The constrained puzzles are the literal worst. I cannot for the life of me see how any of this is supposed to fit in the given spaces.","I enjoyed this game. Satisfying to figure out solutions.","This is like my favorite part of modded minecraft without any of the bad - I like building machines but hate grinding for resources.Very fun puzzle game, I've managed to dump 45 hours in it in under a week. There's tons of replayability to go back and try to optimize a machine for the different stats (cost, cycles, area, instructions)."],["It's ok - but the need to remember the alchemy combinations makes it hard to pickup after you stop playing for a while. Also, having the instructions separated from the board makes it less fun than spacechem. Still a good game, but in Zachtronics games I'd rank it after spacechem, molek-syntez (same principle, but not fancy alchemy), and TIS.","My favorite Zachtronics game to date.","Really fun, Sigmar's Garden is great, too.","yes"],["These visually represented, mesmerizing algorithms are nothing short of art. I hadn't played a game about automation before this one. I'm floored at the creativity and complexity and open-ended problem solving.How do you like to optimize your solutions? Footprint? Cost? Speed?I saw someone complaining that the solutions were inevitable due to unlimited resources. Well, I think that's OK. It doesn't prevent anyone from finishing the puzzles. Your only competition is yourself. You're not railroaded into a single solution. I find those thoughts relaxing.The optional mini-game, Sigmar's Garden, isn't good though. It's obtuse, reminiscent of the mahjong match puzzles you sometimes see.The story is only passable.","This game is amazing. If you like any kind of building and puzzle games, just get it.I always assumed I was too dumby dumb dumb to play this game when I looked through media of it, all the moving parts can seem overwhelming as heck on first viewing, and I couldn't wrap my head around wtf was going on half the time. But this game does a truly great job of teaching you the mechanics and methods methodically so even if you're as stupid as me you'll pick it up relatively swiftly. The genius of the levels also means, so long as you achieve the end result, there's no wrong way to do it, and it's up to you if you want to strive for more or move onto the next. There's nothing to make you feel like a failure for not doing something good enough, you achieve just by doing, and even the graph at the end of each level showing you other players stats tends to just display how people approached the task differently rather than 'better'.It works on a similar principle of fast\/cheap\/good, so no machine is 'perfect' in every way; you can choose to make it super fast, but it'll probably be expensive, or if you want to make something super cheap with very few parts and taking up very little space, it'll probably be slow. This also adds to the replayability of the game, as I found myself just muddling through the first attempt, succeeding, then being like \"okay but how do I make this more efficient\/faster\/cheaper\/smaller\". There's also just a lot of content, and hours of play time to get lost in. 45hrs is just from one play through and redoing a few machines. I definitely want to come back to this and do another full playthrough soon. :D","fun challenging","The best kind of brain hurt. The puzzles are interesting, very satisfying to solve, and most importantly, you can brute force it when you truly give up. It really does a great job encouraging you to build efficiently (With leaderboards and such), while not actually forcing you to. The story is also interesting to follow, and overall it's just really well polished. If this is your kind of game it might be one of the best you've played, but even if it isn't there's still a lot of fun (And mental anguish) to be had if all you have is a passing interest in the genre."],["Amazing, just amazing.You know why so many people are playing minecraft? Because it reflects your creativity and there is probably no limit to what you can create in minecraft (But I don't have it, and it's ok, I have terraria and I like it more:)).This is the exact same thing in the realm of thinking, not making.If you browse the community workshop, you can find puzzles that require endless amount of thinking, and you can imo always improve your solution. I'm currently trying to use as less as possible parts on solving campaign puzzles and it's really challenging for my dumb mind XDSeriously, YOU MUST HAVE THIS GAME if you're into puzzles. This has the most engaging and mind blowing puzzles that I've ever tried to complete.","I did not go very far in the game.I think the idea is nice, but the execution is of poor quality.It is a very easy game at its core; the only difficulty comes from self-imposed challenges. This could be a good idea, but this design pushes me to raise the hurdle sky high, making every puzzle long and exhausting. That would be ok if not for the central problem in this game: its poor UI. The UI is simply not well thought-out. Copying, pasting, inserting, reviewing... nothing works well and nothing is easy to use. What should be a game about relatively high-level logical optimization becomes a chore whenever you try to do anything even slightly complex.As another review pointed out, I feel that, in the end, this game is more of a test of patience than a test of logic.This game also features a minigame named Sigmar's Garden. I have nothing much to say about this except that I find it very boring. I am surprised by the fact that, at the time of this review, around 7% of the players got the achievement for winning 100 games of this minigame. I simply can't imagine myself playing it 100 times.","Perfection","Great game, confusing sometimes but very satisfying when you finally get there."],["Frustration: 100%","yes"],["love it","If you loved The Incredible Machine way back in 1993 on MS DOS, then you'd love this. Daunting at first, the captivating visuals and sound effects are just a bonus to the pleasure you obtain when you've perfected your machines by means of your own creative freedom. Great sound track as well.","So Zach, so good!"],["Great Puzzler","Opus Magnum is a Magnum Opus.","This game is worth at least 100 of your hours on this Earth.This game usually costs around $20 here on Steam.100 hours \/ $20 = 5 hours on the dollar.Especially considering the quality of those 5 hours, I've been satisfied for much less.Unless you don't like puzzles or programming, then it's worth maybe 1 of your hours for the sake of the art style and the story for as long as you can tolerate the puzzles."],["Very good","This is my all time favorite puzzle game. There are no right solutions! You can create any type of machine to create your product. I found myself frustrated that creating something simple took me almost an hour, but after getting through the first few puzzles, I'm loving it now!Once my machines are complete I sit and look at them to find ways to make them more efficient. I've visited my old solutions and reworked those. You can create your own levels! You can download other people's created levels from the workshop!The best part if the GIF recorder. Once you complete your solution you can save a gif of it working to your desktop. I thought this was pretty corny, but when you've spent an hour on a level it's very satisfying to be able to save it and see it working. This game is well worth the money if you're looking to get your brain working on some puzzles. 10\/10 would definitely recommend!","."],["I'm enjoying it so far =)","good","Much more fun than doing the actual scientific research.","cool","This is in my opinion possibly the best puzzle game ever, and I think it's the most solid of the Zach-like style. While I love Zachtronics' other games (and need more ), Opus Magnum is IMO the most approachable and has a better and longer difficulty ramp. It does have banging-head-against-the-wall moments, but its UI (with multi-select in combination with move\/rotate\/clipboard tools) removes as much tedium as possible when making large changes. Quality of life aside, the puzzle system is excellent and intuitive, and I find optimizing my past solutions to be just as rewarding as building new ones. I'd highly recommend this game to anyone interested in automation\/sandbox puzzle games!P.S. I am ashamed to have skipped past the story, especially since I've now played their VN Eliza which has excellent writing! "],["Good basic idea with automated machine creating combined with good theme and art. Highly recommended for everyone liking automation.","geddit.","very satisfying"],["Classic zach game","Great puzzle game!","Opus Magnum is not for everyone. It can be a good way to understand programming concepts for beginner programmers and a relaxing \"change of scenery\" for experienced software engineers.At some point in the game, you think that it can't surprise you anymore, but it introduces a new brain-racking mechanic so you don't relax. After you complete the main campaign, you can try to solve problems with a higher complexity present in the journal. If you want even more challenging puzzles, the game supports community-made puzzles, that you can get at the Steam Workshop.","Make little machines in the game. Make little machines in your brain. Make little machines in your dreams....."],["Excellent puzzler, decent enough story","Nice game. Interesting puzzles","definitely a hidden gem of a puzzle game.  i havent beaten it but i hope the story is going somewhere cause its kinda boring, but the puzzling is top-notch.","chemicals","I knew I would finish the game from the very beginning. The game is easy to learn because there are just a few basic tools. You can combine these tools in many different ways and finding a solution for each problem is a challenge. Moreover optimizing your solution  provides additional fun. I highly recommend.","This is a work of art.  It is just so satisfying to iteratively develop your machines and bring them closer to perfection.  Indeed, if you are a perfectionist, this is the game for you.  With a few simple tools, just about anything can be done.My only complaint is that one of the story levels is technically illegal if you tried to make it yourself in the editor.  You can complete it just fine, but you can't make any like it yourself."],["A very fun puzzle game. The urge to go back and redo puzzles in a better way is strong....","This game is what Molek Syntez should have been. It's by far the most expansive Zachtronics game by story I've played so far. It's also not as difficult as some of the others, at least not the first half...","I suck at this game and have to take breaks playing it, but its reasonably fun","I'm getting smarter against my will.","Me at 3 am:\"I bet I can do this with only 1 fixed length arm...\"","machine goes click clack","Very satisfying when a solution comes together and plays out in front of your eyes. The controls and mechanics of the game are relatively easy to pick up. After you've grasped them the game can be played in any way you like. I'm happy to come up with working machines but you could come back again and again to refine and streamline your ideas. Trying to get quicker, more efficient machines to progress up the leaderboards could be fun for many people. The story is pretty boring but no-one is buying this game for the narrative :-)","Reminds me of Shapez.io but with a video editing timeline that you use to make complex machinery create desired products. It's mind-bending in a very satisfying way. I'm probably going to end up putting way too many hours into this, considering you can download other player's level ideas from the workshop."],["I think this game is different from other Zachtronics games. I wasn't able to found any mechanics or techniques that can help you \"modularize\" and complete the next puzzles. Instead, each puzzle takes longer and longer to complete. I wonder if that's a reason for which the grid is infinite. The most fun puzzles are the ones with Fontenelle's Machine, and I think the entire game should've been like that. However, the UI is not balanced and you have a hard time moving around different parts because they go on top of each other - which is cool and interesting, but not when you can't work efficiently around it. SpaceChem did the same thing perfectly.","this one is a puzzler game that seams tricky to do, but when you take your time and place things in parts or fractions most of the time the results can be a joy to see. Still have saved a number of solutions for later just to enjoy for later. Eventually the reward for finishing the story lets you make your own puzzles and tinker with different solutions and tricks to get the end result goods. dose also include a side game should you want a cool off from the main game by playing a match puzzle game. Storywise it something that kept me going on whats the next chapter going to tell once you finish the series of puzzles. (Or if you like to try a different solution with less cost in gold to make\/ less steps\/ or a faster build)Defiantly kept my interest and for those that love to play a deep thinker","This is an excellent puzzle game with intricate mechanics, polished aesthetics, and a surprisingly good story. 10\/10, would recommend.","A superbly crafted assembly-line puzzle game, with a lovely ambient soundtrack and a 'kinda meh' plot. You play as an alchemist performing various transmutations, which consist of building engines that move around, connect, and alter several base components by using sequential instructions - a form of light programming. There are very few limitations on gameplay and progression - for most missions you can use as much space and as many components as you want, with a presentation of how your machine stacks up efficiency-wise against other players once you complete the puzzle. There's also a basic solitaire game called Sigmar's Garden - a great way to burn a half hour or so. There is an underlying story, but as is usual for Zachtronics games, it has little bearing on anything and merely provides a very loose backing for the gameplay. All in all if you like logic puzzles, logistics, or puzzle games in general, this one is definitely worth a look.","I just can't get into this. Steam is the second store I've bought it from, and both times I've not managed to keep it going more than an hour or two.There's something about the amount of complexity you have to manage in your brain, and the laborious nature of programming the machines, that makes the whole thing feel more like work than anything I want to do for free.","very cool"],["If you see first 10 seconds of gameplay and you like it - buy it, it really is amazing algorithm-building game with funny looking alchemy resembling chemical formulae.","Fun logic and programming challenge.  Makes you think outside the box.  A must play!","very dope puzzle game that gives you a lot of freedom in how you choose to tackle each problem","Excellent puzzle game. Has a great leaderboard system of you and your steam friends. Every few months I load it up and make sure I'm in first place on every puzzle. Even though I suck at life I'm better at this game than my friends.","one of the greatest puzzle - it's not that hard or impossible, it's a great way to understand a decoupling of complex issues into a small pieces, applying different approaches. (they look complex only from the first glance) Make a cheap solution, or smart with less steps, or everything all together.I would highly recommend to everyone at least give it a try.","Really good puzzle game, a must buy if you like automation games.9\/10","Great Puzzle Game with an interesting story. Also loved to play the sigmar's garden minigame when i was annoyed by my incapability to solve this or that puzzle right away","Where did all my time go lmao"],["Can't really recommend this game. The Mahjong-esque minigame is kind of fun, but the actual puzzles are more tedious than enjoyable. It's probably the closest one to SpaceChem, so if you enjoyed that you might get a bit of fun out of this, but it's not as good in my opinion.","It's fun. And there's nothing more satisfying than seeing your machines work when everything is done."]]}