{"name":"Review_Text","index":[2600,2601,2602,2603,2604,2605,2606,2607,2608,2609,2610,2612,2613,2614,2615,2616,2618,2619,2620,2621,2623,2624,2626,2627,2628,2630,2631,2632,2633,2634,2635,2636,2637,2638,2639,2642,2644,2645,2646,2647,2649,2650,2652,2654,2655,2656,2657,2659,2660,2661,2662,2663,2664,2665,2666,2670,2671,2674,2676,2685,2686,2691,2701,2702,2704],"data":[["This game is pleasantly accurate to real-world chemistry. It's a great puzzle-type game to get your mind working. The mechanics are very confusing at first, but then it's really simple once you have some trial-and-error type experimentation with them. The story line is interesting; it reminds me a bit of the Little Inferno story, where you weren't really sure there was a story until you get closer to the end, and more things make sense the more milestones you make. The addition of solitaire is a nice touch, for when a molecule is giving you fits, and you want a break from it, but not from the computer. Highly recommend, great game.","Another strong game by Zachtronics. If you like Zachtronics puzzle games, you'll like this one.","Another great zachtronics game, needs more of a tutorial though. The first couple of levels after the start ramp up in difficulty quickly.","Another great Zachtronics game that - as other people stated - seems to combine Spacechem and Opus Magnum. The DOS-like graphics are suiting the game nicely. But the biggest upgrade since Spacechem is freedom in puzzles - no more broken reactors or waiting 4 levels for sensor tiles - every action is available basically from game start.Only downside is it looks short - 3hrs and I've beaten half the levels. Though user created content and optimizing your own processes should keep you entertained.EDIT - Other half of levels is significantly more difficult. And there is another, user-made campaign already, so above mentioned downside about shortness is no longer valid.","If SpaceChem, Opus Magnum and TIS-100 were put into a blender,  this cool Programming \/ Puzzle game would be the result.","Another Zachtronics masterpiece!","This is a very nice version of solitaire, and as bonus includes some kind of chemical manufacturing minigame.","tried a few level, the theme is about chemistry, making different molecule . and just so happened that i am a chemist so i like this very much. just like spacechem, the chemistry is accurate to some level, the number of bonds that different element can form, and some bond angle, etc.i feel worried that if some player have zero interest in chemistry, they would feel the rules unreasonable.but its 100% a good game for me. ----for player who have no chemistry background but interested in it, i recommend 'opus magnum' which is also from zachtronics","MOLEK-SYNTEZ is a game that takes ideas from Opus Magnum and Spacechem, gives them a new spin and results in a new, niche experience for hardcore Zachtronics fans.UI is spartan and monochrome, there is no hand-holding beyond a simple tutorial at the beginning of the game. As always with Zachtronics games it's as much about solutions as it is about optimization. Getting a result and seeing the leaderboards motivates to look for new, optimized and more elegant solutions.Even though the game is in early-access, it is an almost complete game that will only be going through small quality of life updates. Be sure to visit the Reddit community for discussions, suggestions and feedback.Very exciting! Also there's another solitaire, can't have a Zachtronics game without it :)","NO TIME TO REVIEW. MUST SYNTHESIZE MORE AMPHETAMINE TO PAY FOR HEAT APARTMENT","It's always a risky thing to review a Zachtronics game.  Their games cover such a range of puzzle difficulties and mechanics that you run the risk of evaluating them too early.  That said, we have some points of comparison here that allow us to say things about MOLEK-SYNTEZ.Other reviewers have described this as a cross between TIS-100 and Opus Magnum.  I believe the TIS-100 similarities are largely just on the surface - the UI, the color palette, the very oblique story.  In terms of game mechanics, comparing this to Opus Magnum is on point - I'd say \"Opus Magnum crossed with SpaceChem\" is more accurate.  The \"waldos\" you use in this game have a slightly different set of operations.  Unlike Opus Magnum, the arena in which you operate is finite, which certainly increases the difficulty level.I'm enjoying the game, but - as with SpaceChem - at this point I can already see the point where it will become too difficult for me.  I have a friend who, when I suggest Zachtronics games to them, demurs with \"I already have a job.\"  I think that's a fair response.  I love their games; if you're not sure if you'd like this, I'd suggest start with Opus Magnum first and then decide.  If you know you already like their games, well then, what are you waiting for?","Das good.","I will buy every installment of Zachtronics Solitaire Suite until the end of linear time. One day I may even complete the puzzle sidegames.","Molek-Syntez feels like a \"light\" version of SpaceChem, which was created nearly a decade ago by the same developers. It's got the same puzzle feel as earlier titles, but in contrast it does not have the same gameplay variety that makes earlier titles more engaging. It's cheaper, so price\/quality sort of balances out for me.After doing the first few puzzles it seems like you unlock all gameplay elements (molecule library + manipulations), so the only progression is from more complex puzzles. Compared to previous titles, this makes each new puzzle feel like the previous one. There is no real sense of progression. I've unlocked the first 15 puzzles and already feel like I've played the game enough. Earlier titles kept me engaged for much longer.","Another quality Zachtronics game. If you've played other games by them, you'll probably know whether you'll like this or not. The UI and narrative are similar to TIS-100, while the mechanics are sort of a cross between spacechem and opus magnum. There are more constrains than the opus magnum (finite area, and the waldos only move along the edge of the hexagon) resulting in more difficult puzzles, which I enjoyed.","This is a good game.","It's a Zachtronics game. It's brilliant, because of course it is.","Really not up to Zachtronics' usual standards. It feels like he got too focused on the 'science' aspect of things, and not enough on actually making a fun game.My main issue, is that the puzzles don't feel like puzzles. Once you look at a puzzle, you can instantly tell what you need to do. And everything past that is just trying to get the modules to cooperate. Usually, this means shooting hydrogen at everything you don't like until it's isolated, deleting it, then mashing everything else together. Occasionally, you'll rotate a module one way or another... in fact, let's go over the different commands:Rotate molecule clockwise\/counter clockwise: Two different commands, you'll almost never need either of them since you can place molecules freely into the play area, including rotation.Push\/pull molecule: For mashing things together. Decently useful, but not really interesting.Move module: Moving modules? Clearly you're doing something wrong. Or at least, that's the general feeling every time you need to use this command.Add Hydrogen: Deal 1 damage to an enemy atom. (Or at least that's what it tends to feel like)Delete: Kill an enemy atom that has been reduced to 0 HP.Remove Hydrogen: Yay, this atom can form bonds now- no, no don't bond to that! Guess I need another four completely empty instructions while something else moves into position.Shunt hydrogen: First of all, it looks almost identical to the add hydrogen instruction, which is annoying. As for if it's good or not... it's okay? It's basically just 'do two things in one instruction'.Submit product: Okay.It basically feels like Zach wanted to create a simplified version of spacechem, and wound up simplifying away all the actually fun parts. I hesitate to say outright that it's 'bad', but honestly, if you have any other Zachtronics game that you haven't tried yet, get that one first.","very much spacechem, tis-100, and opus magnum; with its own twist (rotation?)","MOLEK-SYNTEZ feels like a cross between every Zachtronics game that came before, so there's plenty here to like. I'm about halfway through the levels, and so far, the puzzles haven't been particularly hard to solve (compared to other Zachtronics games, that is). They're a lot of fun though, and I've enjoyed giving myself a particular constraint for a level and building a solution around that. For example, maybe there's an obvious way to make a product out of three reactants, but what if I only let myself use one? Or maybe, can I build two copies of the product at the same time? This game gives you a lot of freedom to tweak your approach, maybe even moreso than Opus Magnum and Spacechem. If you enjoy this genre, I can't see a reason you won't enjoy this one too.Oh, and don't let early access scare you away. The game is effectively completed, and I haven't run into a single bug yet.","This is my first Zach game.  I've been playing it for only four hours now, but it has me hooked. In the beginning, I thought, \"oh this game is a piece of cake, where's the puzzle and strategy?\" and by the third-or-fourth dialogue option, the difficulty is shown.  It's a very difficult game, especially if you want to make it to the top 10% of players.  I highly recommend this game if you love puzzles and don't shy away from a challenge!","SpaceChem + Opus Magnum = Quite FunI hope there are some more programming\/electronics games from Zach sometime soon","Two months ago, I commented on Reddit that I'd like to see what Spacechem would be like if it was presented more like Opus Magnum. My dumb internet comment fantasy has come true and I love it. Thanks, Zach!","I'm a long-time fan of Zachtronics as a developer.For people that know Zachtronics:This game feels like a cross between TIS-100 and Opus magnum - it has all the vibes and feel of the TIS-100 computer programmer, with all the puzzle solving of Opus magnum. You get all the usual histograms and statistics. This game has a particularly nice addition of a \"top percentile\" bracket, so you can compare yourself against the top 10% or top 1% if you enable it in settings for your best solutions. Somehow, it still lacks a little polish, but it has the regular quality of any Zachtronics game.For people that don't know Zachtronics:If you like statistics and puzzles, along with constantly trying to get a more efficient solution, you have struck a goldmine. Have a look at all the games Zachtronics have to offer though before you buy MOLEK-SYNTEZ! I cannot recommend his games enough, which is why I'm reviewing this game on release day - specifically Infinifactory, and SpaceChem.","Two months ago, I commented on Reddit that I'd like to see what Spacechem would be like if it was presented more like Opus Magnum. My dumb internet comment fantasy has come true and I love it. Thanks, Zach!","Fun puzzle solver with a gritty cyberpunk feel. Bonus points for combining hard core chem nerdiness with a hopeless meth house ambiance. Totally worth the money.","As always it's a very entertaining puzzle concept, with some already explored bits and new ones too. I wonder if the art style is going to stay monochromatic, apart from that it's already very polished, Recommended if you've liked other games from the creator, or in general algorithmic(?) puzzles in general.Edit: Some rough parts: The stepping through the process and breakpoints aren't as complete as in the other games as of this moment. Keybindings were a bit wonky, but nothing too bad.I also get the movement direction wrong all the time, I'm thinking that a better indication might also be a rotation instead of left\/right, which half of the time doesn't match up with what you'd expect on the screen.","MOLEK-SYNTEZYet another cool programming game from Zachtronics :)Don't be misleaded with plain graphics\/sounds because power of the game is inside in coding stuff.Can't wait to play more :)Good job once again!","Its a zachtronics progamming puzzle, thus far it seems to be the usual good stuff, that's pretty much what you need to know at this point.","I'm a long-time fan of Zachtronics as a developer.For people that know Zachtronics:This game feels like a cross between TIS-100 and Opus magnum - it has all the vibes and feel of the TIS-100 computer programmer, with all the puzzle solving of Opus magnum. You get all the usual histograms and statistics. This game has a particularly nice addition of a \"top percentile\" bracket, so you can compare yourself against the top 10% or top 1% if you enable it in settings for your best solutions. Somehow, it still lacks a little polish, but it has the regular quality of any Zachtronics game.For people that don't know Zachtronics:If you like statistics and puzzles, along with constantly trying to get a more efficient solution, you have struck a goldmine. Have a look at all the games Zachtronics have to offer though before you buy MOLEK-SYNTEZ! I cannot recommend his games enough, which is why I'm reviewing this game on release day - specifically Infinifactory, and SpaceChem.","Its a zachtronics progamming puzzle, thus far it seems to be the usual good stuff, that's pretty much what you need to know at this point.","Fun puzzle solver with a gritty cyberpunk feel. Bonus points for combining hard core chem nerdiness with a hopeless meth house ambiance. Totally worth the money.","As always it's a very entertaining puzzle concept, with some already explored bits and new ones too. I wonder if the art style is going to stay monochromatic, apart from that it's already very polished, Recommended if you've liked other games from the creator, or in general algorithmic(?) puzzles in general.Edit: Some rough parts: The stepping through the process and breakpoints aren't as complete as in the other games as of this moment. Keybindings were a bit wonky, but nothing too bad.I also get the movement direction wrong all the time, I'm thinking that a better indication might also be a rotation instead of left\/right, which half of the time doesn't match up with what you'd expect on the screen.","I did not know this game was coming out; I bought it without even looking further than it was by Zachtronics.   And in playing the game, yet again, Zachtronics does not disappoint!","If you liked SpaceChem, or really any game by this developer, you'll probably like this one as well.","This is what you get if you combine the molecules in Spacechem, the aesthetic of TIS-100 and the instruction mechanics of Opus Magnum. The solitaire is a little underwhelming but the base game is more than worth it, even if the controls are a little fiddly. Can't wait for this to release outside of Early Access for more Zachy goodness!","Oh hell yea. A zachtronics game specifically about drug creation in your home chemistry lab in your crappy apartment? Elegant, smart puzzles and clever design, absolutely worth the buy!","It's a zachtronics game, so you must buy it.","MOLEK-SYNTEZYet another cool programming game from Zachtronics :)Don't be misleaded with plain graphics\/sounds because power of the game is inside in coding stuff.Can't wait to play more :)Good job once again!"],["amazing game. similar to opus magnum","If you loved the other Zachtronics games, this one is just as good as the others. A really enjoyable mix of TIS-100, Opus Magnum, and Space Chem.","Opus Magnum meets SpaceChem. Guaranteed Zachtronics formula. Solitaire included. Branching instructions not included. Easiest zach game so far.","Really fun game where you have to use your brain to get to the most effective solutions in different areas.","Like a lot of other Zachtronics games, you're an engineer, taking various Inputs and trying to create the Output.  I like a lot about this game:* It's relatively small in scope - after the third level, you are given all the tools available\/needed for the rest of the game.* If you just need to find a solution that works (not optimized on any particular axis), it's quite doable.  I've been sitting down to solve a puzzle or two per evening and it's very doable -- even puzzles that look insane to begin with.* Digging in to optimize the early levels is fun (before they get too complicated).Critiques:* Like SpaceChem, it's definitely \"fake chemistry\".  In real life, molecules are 3D structures, and these are all in a flat plane.  Took a little bit to realize that rotationally symmetric molecules don't count (I think).","Zachtronics did it again, another great puzzle game in their unique style. It seems a little bit easier to get started and make basic, non-optimised solutions but contains more than enough challenge when trying to optimise for each factor.","Any game by Zachtronics is instabuy for me. It's the only instabuy actually, and I don't regret a single purchase.I have yet to finish a single one of the games, but I go back to them as I feel the mood, since they all \"feel\" different. This feels like a happy medium between SpaceChem (the first I played, that got me hooked on the dev), and Opus Magnum (a beautiful, but my least favourite of the shifting-puzzle type of the games.. it's a great game, but the dimensionality of it messes with me).This one feels a fair bit easier so far, but it's got ways to go. And as usual, the good stuff is there: see your efficiency and get the opportunity to compare to others. Love it. Thanks devs, please keep them coming for years more? :D I'll keep buying...","I'm the Jesse Pinkman of Romania.","A riff on Opus Magnum with a TIS-100 styling. Molek-Syntez is lightweight vehicle for more classic Zachtronics puzzling goodness. If you're coming off the high of EXAPUNKS then this game's thin plot might disappoint you. Personally though I've always come for the puzzles first.Keep up the great work, Zachtronics!","Yep it's Zachtronics alright","Clever geometric puzzle and optimization mechanics in the same vein as SpaceChem or Opus Magnum.","Zachtronics games are one of the best puzzle \/ programming games. I played every game so far and this one is minimalistic and good.","Absolutely fantastic work. If you enjoy puzzle games then you could hardly ask for a better game.","A classic Zachtronics game.While some people, myself included, do compare this title to a mixture of SpaceChem and TIS-100, it's merely visually comparable. The gameplay is quite different.I like it. The style (while retro\/minimalistic) is nice and the BGM also fits well.","If you like Zachtronics games, you'll enjoy this one too. I found this to be a much easier progression than some of the other games as well. I'm about two-thirds of the way through and haven't hit a snag yet.","With the visual style of TIS-100 and the programming method of Opus Magnum, only with a smaller playing field, this is a fun and challenging game. Not as tough as SpaceChem but packed to the brim with fake chemistry","This is a much harder game than this company's earlier game (SpaceChem) even though this one is much more limited in operations. Dyslexic players, beware: this one does not allow left-right reflection of molecules (SpaceChem did).","Great Zachlike game. A little shorter than the others (still on early access so it may get longer), and a mix between spacechem and opus magnus, now requiring a little bit of chemistry knowledge (only atoms bonding, not much more). A great game, if you enjoyed opus magnus this will be a great addition to your library. Update: About 4 hours to win the main campaign (more to optimize solutions) and a bonus campaign is already added! This is great value","Easily among the easiest of Zachtronics' games, but still an enjoyable playthrough!","With one of the more minimalistic styles I've seen from this dev, I cannot recommend this one to anyone other than long-time fans. Nowhere near the production values and story of SpaceChem, Opus Magnum and Infinifactory, and no music at all when music was a very strong point in earlier games.If you can stand that and are an older fan, the gameplay is familiar and addictive enough and the price is modest at least.","Main story all clear \/ solitary 10 wonAnother old-fashion zach-like game","Another great zachlike from Zachtronics themselves, but maybe not the best entry point for players new to the genre. If you haven't played any zachlike before, go play Opus Magnum and then come back here. The game is a solid recommendation for anyone familiar with these games though.As others have said, this game is mechanically closest to Opus Magnum, but takes the real-world chemistry roots (and limited play field) from SpaceChem, and the minimalist (and monochrome) presentation from TIS-100. Just beating the levels is on the easier side of the spectrum (really not much or any harder than Opus Magnum) but the game has a huge amount of optimisation depth, as early as on the second level. I beat the main campaign in 7 hours, but could probably spend another 100 to optimise all the scores, maybe 200.As all recent Zachtronics games, there's also a solitaire minigame you unlock quite early on. It's another Freecell-like, but a fairly fun one. There are no actual free cells, but you can dump single cards anywhere, at the cost of not being able to use that stack, and not being able to move that card except to a valid location.Anyway, if zachlikes are your jam, get this game. If you've never played a zachlike before, get Opus Magnum and then get this game.","Zachtronics has released another exceptional solitaire variant that just so happens to also have a neat little chemistry-set minigame wrapped around it. Five stars, would spend an entire evening slaving over micro-optimizing molecule workflows until the sun comes up again.","Very likely my favorite Zachtronics title. ~2\/3rds of the way through, have yet to spend more than 15-20m to solve anything, but there's definitely room for hours of efficiency refactoring on each. The tool is powerful and the learning curve is pretty smooth. Compelling story so far, very impressive how much is said with so little interruption from gameplay.","Molek-Syntez (MS) is fun. It's challenging, and with the addition of the ability to view the top 10% and top 1% in your rankings, it pushes you even further in your quest to optimize for every possible metric.The gameplay is one part Spacechem, and one part Magnum Opus. The GUI is pure TES-100. It's not as fully featured and definitely more shallow than some of the other Zachtronics games, but at its current price (< $10) it's well placed.","It feels like the bastard child of SpaceChem and Opus Magnum.","it's a zachtronics game what do you expect","Zachtronics's engineering puzzle games have two main flavors: The programming sort, like TIS-100, SHENZHEN i\/O, and EXAPUNKS. And the mechanical sort, like Opus Magnum, Spacechem, and Infinifactory.MOLEK-SYNTEZ is of the mechanical engineering axis, with a drug-addled cyberpunk dystopian aesthetic. It has a simple verb set and a quick difficulty ramp up, so you'd benefit from experience with any of the previously mentioned games. Very good puzzles. Optimizing for any of the 3 measured metrics tends to lead to wildly different solutions (if you can puzzle out any solution at all).Highly recommended for fans of Zachtronics, but probably not the best entry point for a new comer.My recommended Zachtronics play orders for the smoothest difficulty ramp.Mechanical: Infinifactory, Opus Magnum, Spacechem, MOLEK-SYNTEZProgramming: EXAPUNKS, TIS-100, SHENZHEN I\/OAlthough I've not completed it yet, I also recommend \"Eliza\" for an entirely different sort of game that still looks at the world through an engineer's eyes. Review on that to come in the future I'm sure.","It's a zachtronic game. If you like Spacechem or Opus Magnum, you'll love this.","It seems very low quality in terms of Graphics, Sound, and Story from the company that brought us epic games such as Infinifactory and Opus Magnum. Puzzles are fine, but those other factors are important towards making a Game rather than a programming job, or some minimalist thought experiment. I just want to see this company work towards its potential and not give us half baked ideas like this. I'll admit, I really just want Infinifactory 2. I completed the original and it was fantastic.","Its like if Spacechem and Opus Magnum has a baby.","Shulgin simulator.","A nice crossover between SpaceChem and Opus Magnum.If you liked at least one of these two games, stop asking yourself and immediatly buy this : you will feel right at home with Molek-Syntez.  :)I personally loved SpaceChem, and did not like Opus Magnum that much ; yet I'm having a blast with Molek-Syntez!The 'minimal' art is also reminiscent of TIS100 ; it perfectly fits the task and helps to focus since it is 'distraction free'.","%^7 what i have seen can not be!^8 B^}unmade but undone and again{^8","If you like Zachtronics games, I'm sure you'll like this. It plays similar to Opus Magnum, but you slide the atoms around instead of grabbing them directly. Atoms will fuse together depending on how many bonds they have, which you indirectly control with your emitters. It took me some trial and error before I fully understood how it worked, but it's lots of fun once you get the hang of it.Compared to previous Zachtronics games, MOLEK-SYNTEZ is relatively short. But if you're the type of person that likes to optimize their solutions, you'll certainly get many hours of enjoyment out of it. But if not, you may find you've run out of puzzles sooner than you expected. However the game is still in early access, so more puzzles will most likely be added eventually. Sadly there is currently no Steam Workshop support, so there are no user-made puzzles. Which is a shame, since it seems like that would be a perfect fit for this game.MOLEK-SYNTEZ is a great little game, but given its shortness it might be better to get one of Zachtronics' other games instead, if you haven't played them already. But overall, I did enjoy my time with it. If you like these sorts of games, or puzzle games in general then give it a shot. I recommend it.","Another great Zachtronics game with another unique programming paradigm. Difficulty-wise I put this between Opus Magnum and EXAPUNKS. The paradigm is similar to Opus Magnum, but the pieces are a bit harder to handle and you have a mildly constrained work space.","Zachtronics does it again, albeit in a much smaller package. VERY small set of puzzles for a game by them, but it's early access after all so maybe more will come after release. Programming is almost identical to Opus Magnum, but in a confined space like SpaceChem.  I rate it as the second easiest Zachlike.","A combination of several Zachtronics games, including Opus Magnum, Spacechem, and TIS-100. But that's a good thing!","This is kinda like SpaceChem, but a little bit more realistic.  Challenging and fun.","Awesome game, great puzzles. As is standard from Zachtronics","aka \"Learn how to make drugs online fast\" ;-DGreat refresher on my more than rusty chemistry knowledge. As usual runs perfectly on SteamOS\/Linux! <3","Good fun. The usual friends-list leader boards help me to remember that I'm not very good at optimisation :)"],["Zachtronix is one of very few companies on my \"Buy immediately upon release\" list.This one has worse graphics and sound than typical, but the puzzles are every bit as head-scratching as always. The play is a bit reminiscent of Spacechem as you are manufacturing molecules. But you can only manipulate them from side-mounted beams so it's easy for things to get in the way. I have finished the first several puzzles and have gotten to the tricky bits. The puzzles are as good as always; puzzle for a bit, try something, obsess over the tricky bits while doing something else, come back and try more, feel fantastic when it works. So yes, if you like the Zacktronix games, grab this one as well","TL;DR: Another Zachtronics game, I don't sleep at night.Puzzle game that shows you how poorly you did compared to other players, which forces you to restart and try again.","I feel like Romanian Walter White","Another little Zachtronics game. Less freedom than in Infinifactory or Magnum Opus, more than in some other of the smaller games.","The closest Zachtronic game to Opus Magnum to date in terms of mechanics - if you were turned off by hard programming in other Zachtronics games but loved Opus Magnum, you will enjoy this one. It isn't as aesthetically pleasing as Opus Magnum, but is considerably more open in terms of puzzle solutions. It also has the best solitaire of any of the Zachtronic games, in my opinion.If you're a fan of Zachtronic, then this is an easy purchase. If you're looking for narrative, character, graphics of pretty much any kind, or anything other than a minimalistic, to-the-roots puzzle game, you'll be disappointed. If you love puzzle games with solid mechanics, room for creativity in solutions, and endless replayability through the Steam Workshop, then go ahead and pick this game up, along with every other Zachtronics game. They're the pinnacle puzzle game developer right now, bar none, and MOLEK-SYNTEZ doesn't do anything to hurt that reputation.","If you know zachtronics, you know what you're in for","This game is as good as the other Zachtronics games.","If you enjoy Zachtronics games then you will enjoy this one.","It is an interesting combination of elements from SpaceChem and Opus Magnum with its own challenges such as limited space on the board and being forced to manipulate elements from the outer edge of the board. If you like other zachtronics games like I do, I am sure you will enjoy this one as well.","Looks like another classic hit from Zachtronics","if you like zachtronics then you'll like this.","Zachco keeps releasing the same game, and I keep paying them for it. It's not really doing it for me this time though. It's the same thing again, extremely light and there are what like 40 puzzles? Even the \"About This Game\" text on the store page feels like they couldn't get that excited about it either. I'd say give this a pass unless you're really desperate.While I'm here, please try Silicon Zeroes, Zachtronics fans. It's awesome and didn't get the attention it deserved.","Standard Zachtronics quality (read: pretty good)","Good game.","I buy every zach game as soon as it's launched.  I have no idea how he keeps coming up with slight modifications to the formula that adjust the base difficulty and depth of optimisation strategy but I love it.  These games appeal to a very specific type of person.  If that is you you will love it and certainly get more than your moneys worth out of it.","If you like Zachtronics games, you will like this.  If you don't, you won't.  I like them.It's not as pretty as Opus Magnum, or quite as complicated, but it's very satisfying.","I love being an evil future chemist (?). 10\/10","A more constrained (in terms of aesthetics, story, and gameplay scope) version of Opus Magnum. If you liked that, I'm reasonably certain you'd like this. The solitaire mini game is great fun too.","Just another grade A puzzler from Zachtronics.  For me, all of his games are instant-buys.","Nicely done, as always.I'm still wondering though, whether there will be a backlash for me doing online searches for drug related compounds, especially with keywords like molecular synthesis and optimization and stuff...When compared to the more fancy Infinifactory and Opus Magnum,this is sort of a step backwards, presentation wise.All of the available mechanics are well executed, though.Except for perhaps a few minor usability issues with discarding a selection of instructions by dropping it into the empty space right beside the instruction area. This will sometimes drop the instructions back into their original place. So your best bet would be to just press the DEL key.Similarly so for the precursors. I would like to have a multi select option instead of having to select all precursors manually in order to discard them. Discarding these is done using by right clicking the mouse. Here, I would like to have the option to also throw these precursors into the empty space located around the play field.Also, I would like to add more precursors from the precursor selection menu by STRG + left clicking these. I do not care where these will be added to the board, I just do not want to switch back and forth that much.","Yet another great puzzle game from Zachtronics. Slightly quirky because of the way the game works, but as always fun to play and rife for optimization. If this is not your first rodeo with this kind of game, you should absolutely get this."],["more smooth than previous chemical games from zach. i solved more puzzles this time and tend to return.","Another Zachtronics gem!","Every Zachtronics game for me is an immediate impulse buy and I've never been disappointed. This reminded me a lot of a cross between Opus Magnum and Spacechem (both involving using external tools to manipulate\/rotate\/combine finished products). Great puzzle game though and I would recommend it to anyone who enjoys trying to come up with efficient solutions to complex problems. Also if you enjoyed other zachtronics games you'll likely enjoy this one too.","No real chemistry. But still fun.","Good, but not quite as good as Opus Magnum.","Another Zachtronics gem!","No real chemistry. But still fun.","more smooth than previous chemical games from zach. i solved more puzzles this time and tend to return.","The solutions aren't as satisfying to watch as Opus Magnum, but it's still just as fun.","Good, but not quite as good as Opus Magnum.","Every Zachtronics game for me is an immediate impulse buy and I've never been disappointed. This reminded me a lot of a cross between Opus Magnum and Spacechem (both involving using external tools to manipulate\/rotate\/combine finished products). Great puzzle game though and I would recommend it to anyone who enjoys trying to come up with efficient solutions to complex problems. Also if you enjoyed other zachtronics games you'll likely enjoy this one too.","I am not smart enough for this game.","One of my favourite Zachtronics games and has already doubled content from EA release.","Pretty good mashup of Opus Magnum and Spacechem.  It's fairly short, and only moderately difficult by Zachtronics standards, but it's pretty enjoyable and I honestly felt like I learned a bit about chemistry from it.  I'd rate it in the lower half of Zachtronics games, but that's more of a compliment to their overall superb quality than anything else.  (I still think Infinifactory is one of my favorites of all time)One downside from my perspective is that I didn't see the need to have the game have so much cursing in the cutscenes.  I know this makes me sound like an old man, but it's not really needed.","Gr8 game, 8\/8","Absolutely fantastic.","I've always wanted to be an angry Romanian chemist in the future, and this game has allowed this long-standing dream of mine to come true. 5 Ketamine molecules out of 5","I understand chemistry at such a deep level now","Pretty good mashup of Opus Magnum and Spacechem.  It's fairly short, and only moderately difficult by Zachtronics standards, but it's pretty enjoyable and I honestly felt like I learned a bit about chemistry from it.  I'd rate it in the lower half of Zachtronics games, but that's more of a compliment to their overall superb quality than anything else.  (I still think Infinifactory is one of my favorites of all time)One downside from my perspective is that I didn't see the need to have the game have so much cursing in the cutscenes.  I know this makes me sound like an old man, but it's not really needed.","One of my favourite Zachtronics games and has already doubled content from EA release.","It's Zachtronics, just hook it to my veins.","Fun simple and immersive problem solving game!","As usual, they deliver!","It's as addictive as some of the molecules it has you make.","If you like puzzles, beautiful visuals and a vibe of a USSR apartment, you'll love this.","If you like Opus Magnum, you'll like this","If you enjoy Zach-likes, you'll enjoy this one. And if you don't, start with SpaceChem and work your way up to this game.","It's as addictive as some of the molecules it has you make.","As usual, they deliver!","If you like puzzles, beautiful visuals and a vibe of a USSR apartment, you'll love this.","Fun simple and immersive problem solving game!","It's Zachtronics, just hook it to my veins.","If you enjoy Zach-likes, you'll enjoy this one. And if you don't, start with SpaceChem and work your way up to this game.","Gr8 game, 8\/8","Absolutely fantastic.","I've always wanted to be an angry Romanian chemist in the future, and this game has allowed this long-standing dream of mine to come true. 5 Ketamine molecules out of 5","I understand chemistry at such a deep level now","If you like Opus Magnum, you'll like this","Happy now.  As long as Magnet isn't running, this works great.","Happy now.  As long as Magnet isn't running, this works great.","Just when you start to think its safe to look at steam after Exapunks - that Zach strikes again will another major time-thief. Classic Zachtronics, simple to get started, subtle depth, wave goodbye to any time you thought you had","Just when you start to think its safe to look at steam after Exapunks - that Zach strikes again will another major time-thief. Classic Zachtronics, simple to get started, subtle depth, wave goodbye to any time you thought you had","Yet another gem from Zachtronics! :D It's again the same game as previous Zachtronics games, but just totally different. :D Will buy and play their next game too, just to see how many ways they can make the same game! xD","Zachtronics never disappoint. Love it so far!","Like Opus Magnum, but without any charisma and half the features.If I had a choice between this and Opus Magnum I'd choose OM every time","If you know Zachtronics games, this is similar to others. More puzzley goodness. In some ways like Alchemy, except instead of adding mechanics to the board to manipulate a limited number of reagents, Molek-Syntez gives you a limited number of tools that move along the outside edge of the board and unlimited reagents to work with. Puzzles are thoughtful and as usual, there are easy solutions and then there is optimizing your solution.","Fun challenging game, for anyone who likes solving puzzles and is fond of chemistry and breaking bad.","For people who had played other Zachtronics gamesThis game is basically:  TIS-100's GUI style SpaceChem's chemistry theme Opus Magnum's hex grid and way of execution plus many other interesting mechanics like manipulating hydrogen atoms instead of bonds itselfOverall an interesting combination. The limited size of the grid, and the fact that the \"arms\" (called emitters in this game) can only move on a fixed rail pointing to a fixed direction gives this game a lot of challenge. Combine that with the way of manipulating atoms make it pretty interesting. And yes this does include solitaire, and as usual has some unique twist compared to normal one. For people who haven't played any Zachtronics gameThis game is about programming a molecule synthesizer to produce various stuff. No knowledge of chemistry is required as you can treat it as a pure puzzle game. Think it as making list of commands telling the \"arms\" (called emitters in this game) what to do to turn the material into products. If you feel tired solving the puzzle, you can also play the in-game solitaire to relax.","First game from this developer and not like anything I've played before. When I think of puzzle games I think of things like Tetris, but this is completely different type of puzzle. Programming \"Modules\" to create compounds looks very complicated at first glance, but after the first few puzzles, you get the hang of it.I beat the main campaign in about 15 hours, and I spent about an hour or so in the Solitaire mode (Which is fun if you find solitaire fun i guess). I haven't played any of the second campaign, which is just as big as the first with completely new chemicals.There is a story, but it is simply text between every couple levels, just reasons to why you are making the chemicals. Nothing big.The game, for me, is no doubt worth it even at full price. However I don't think everyone will enjoy it.M","Broke as hell, I am. Synthesize my own ketamine, I must.","Prior to this I thought Opus Magnum was the easiest Zach game, but I'm now 20 puzzles in to Molek and I think this wins on lowest difficulty. That's not to say they game is too easy, or not fun: It has the same addictive problem solving as prior games, it's just the ease of coming up with that first quick (to build) solution that's different. If you've struggled to complete prior Zach games (I'm guilty here) then it means this one is more satisfying, but the real trick with these games has always been *optimizing* your solution along one or more metrics (cycles, instructions, modules, etc.) That's no different here. If anything, the (relative) ease of coming up with *something*, *anything* as long as it gets the job done is more than offset by a much increased difficulty in optimizing a solution. In Opus Magnum, for example, it was often more difficult to come up with an initial solution, but somewhat easier than Molek to optimize.And as with many Zach games, there's a unique & challenging solitaire game built in. It could be I'm just awful at it, but it seems like there are more \"no possible solution\" deals than some of the others.Anyway, it's a good game. If you've liked the past games, you'll probably like this one. If you *wanted* to like the past games but hit a wall on difficulty halfway through, you'll probably like this one more. If you've hated all parts of the past games, you should ask yourself why you're wasting so much time looking at this one, reading reviews, etc. You should find better things to do with your time than read mostly positive reviews about things you hate. Maybe go outside? No, just kidding: just find some other game you like more.","Don't get me wrong, Molek-Syntez is as well-designed a puzzle game as everything else Zachtronics in terms of mechanics. It's like Opus Magnum except with a limited puzzle field, limited inputs, and the manipulating arms sitting on the outskirts rather than wherever may be most convenient. It's got a higher but still reasonable difficulty curve, and as always you can chase various optimizations.My problem with this one is entirely in the presentation. In spite of how well it works, the environment is as drab and featureless as TIS-100. Manipulating the puzzle pieces with invisible rays from the borderlines is a lot less engaging than arms that tangibly grab and move the pieces around. Completed compounds don't slip into a designated export with a satisfying \"clunk\", they simply blip out of existence with no visual differentiation to deleted atoms. And perhaps most egregiously, you unlock all the pieces you'll be using through the main campaign after the first few levels which completely kills the sense of progression, especially after Opus Magnum did such an amazing job of gradually unveiling more and more devices to work with. I just feel like I'm solving the same puzzle over and over again with a slowly escalating complexity which has completely killed my drive to progress. Doesn't help that there's even less story to follow than usual.By all means I'd recommend it if you're more tolerant of grey, drab, sterile environments and overly static elements in your puzzle games. I guess that's a combination that really puts me off."],["Brain-melt-simulator-melt-brain-brain-simulator-melt-simulator-brain-melt-melt-brain-simulator.","I'm going into this with an extreme interest and some knowledge of pharmaceuticals and chemistry. This game is great. It's extremely satisfying to see your sequence make complete chemical structures, and the game also feels very free-form. The only requirement is to get to the example molecule, how you do it is up to you. I would hardly change a thing, other than the double bonds in Benzene rings have to be oriented EXACTLY like the example. It just seems redundant in some molecules.","If you enjoyed the minimalist style of TIS-100, this game is for you. It has all the brainbending puzzle stuff but not a lot of extras. Personally, I liked that.","My initial impressions on this game after playing the first levels: Graphics are similar to Zachtronics' TIS100, plus the greyscale graphical UI of Opus Magnum. Players new to Zachtronics games should probably start with Opus Magnum, but for players with experience in Zach games this game will probably not disappoint.","Great game from zachtronics again, as always.Don't be turned away by your lack of knowledge of chemistry, as this game requires just as much of such knowledge as SpaceChem.One thing to note, this game does not have an infinite terrain, so if you liked Opus Magnum but hated Shenzhen IO for its restrictiveness, this might not be for you.Obviously if you haven't heard of any of the games I'm referring to then this review is useless, but to summarise this game and the other mentioned games, they are basically programming games, with an optional optimisation component, where you can compete with others for the shortest program, fastest program etc.","Another wonderful Zachtronics release. It really makes you think, while letting you get familiar with the chemical structure of your favorite psychoactive substances","If you enjoyed Opus Magnum and are looking for a much beefier challenge, and don't mind the admittedly dull aesthetics, then you can't go wrong with this. 11\/10 would cook up ket again.","I enjoy this game because it reminds me that I'm not smart without having to endure the ridicule of my peers (outside my Steam friends list.)","I want to someday tell my mum that I'm the best at crafting Amphetamines","Typical Zachtronics. If you love them all (as I do) you will this one as well. If you hate the other games, or don't get it, well, don't bother.","Zachtronics is the finest puzzle game studio to ever exist. With that said, this feels like their first genuine misfire.The unique appeal of Zachtronics' games lies in their paradoxical ability to provide endless freedom within a set of severe constraints. Their challenge is derived from very limited instruction sets and, in some cases, very limited space, but there are an endless number of ways in which their puzzles can be approached to provide multiple valid solutions. In MOLEK-SYNTEZ I only feel constraints. It does not provide a sandbox of moving parts I can get amongst and reposition and reprogram; it provides a sandbox I can only interact with from the edges via six immobile magnets which can push, pull, rotate and add or remove hydrogen atoms. That's it. Using this instruction set you need to transform chemicals into other chemicals. The goal is the same as Spacechem, but the toolkit you're provided to achieve it is nowhere near as fun to work with.The process of puzzle solving generally involves spamming add commands to unbond atoms, moving one chemical closer to another, then spamming remove commands to rebond atoms. It's a very simplistic process with little room for variation in approach. During planning you can move chemicals and reposition magnets around the sandbox border, but the challenge comes from the fact that once your solution starts running there is no command to move the magnets, nor directly pick up the chemicals. As the chemicals are moved, the atom around which the chemical pivots changes in accordance with the atoms' direct line of sight to the various magnets, meaning that all six magnets must be used to effectively manipulate the chemicals in such a way that they don't collide with other chemicals in a very small space. If there is a core mental concept the game could be said to test, it would be spatial reasoning.Not helping the limited gameplay is the presentation feeling rushed and barebones. It contains none of the studio's usually excellent music, the trademark 'twist' on the solitaire game is the fact that you can cheat once by moving a card to an illegal location, and the art style is basically nonexistent. The game loads quickly and its UI is user friendly, so it is well made from a technical perspective, but the studio's usual high level of artistic polish is absent.I have a feeling that after Eliza (Zachtronics' previous game and first visual novel) failed to achieve much resonance with fans, nor draw in newcomers, Zach wanted to push out a puzzle game to show he had not lost touch with his fans or their interests. It feels like a product made to send a message and draw in a few quick dollars rather than a creation born from passion.I am proud to say that I have completed every Zachtronics game, aside from TIS-100 and SHENZHEN I\/O, which I put down because I was not mentally geared towards the code they required. This is the first time I have put down one of their games, not due to difficulty, but due to sheer disinterest.","An odd mix of the gameplay of Opus Magnum and SpaceChem, with a hint of TIS-100 visuals that just worksA must if you like other Zach's games","The gameplay is very similar to Opus Magnum, except for having basically no story and maybe less pleasing visuals. Still, a really good Zachtronics puzzle game!","If you've played zachatronics other games you'll already know if you'll like this one or not.if you haven't its a great puzzle game that starts out with straightforward challenges that quickly show you that you need to learn and create new techniques for each level and that you can't just be content to use old tricks. it includes graphs after each one to show you how your solution compares to other ones, with extra details for your friends. a lot of the fun isn't it just solving the levels but optimizing them in multiple ways.as far as story you can actually miss it very easily but what is there is interesting and clearly thought out rather than just an after thought.","First Zachtronics game, having great fun figuring out different ways to beat the system!","Really enjoyed it. For people who have played other Zachtronics games, this one feels a bit like a hybrid of SpaceChem and Opus Magnum - probably more similar to the latter. It has less art, audio, and story with it though - this one is pretty much purely gameplay. Main 'quest' difficulty quite low for the most part, most of the fun comes in trying to get lower cycle or module scores. Mini-game is a twist on solitaire.For people who haven't played Zachtronics games, this is a fairly accessible one, and some of the best systems optimisation puzzling around. You don't need to know anything about chemistry to play it.","Up front admission. I love Zachtronics games. If you like open ended puzzles with a multitude of solutions check this out. I love that you can solve the puzzles your way, but you can go back and optimize in order to get a better solution. The great thing is you don't have to. As long as it works you can move on. Any time I see a new game by this developer I buy it, because everything that they've released has been really interesting and challenging.","Not as polished as Opus Magnum and the colour scheme is quite bland but it's still a very addictive fun Zachtronics game.","Like all zachronics puzzle games, this provides puzzles with a wide breadth of solutions available to the player, and allows the player to optimize for 3 different measurements.  Your solution may be optimal for components or instructions, or cycles, rarely can you find one that's good for 2 and never for all 3.  The histograms after you finish a puzzle can show you when you've done a solution that's better or worse then the other players who have attempted it.  The puzzles themselves are so esoteric that these games are highly re-playable.  If you don't like complicated puzzle games this will not be for you.  The story is thin, but mildly interesting, but there is great joy in learning the capacities and limitations of the playing field.  Which precursor molecules should I pick for this chemical?  Can I repeat this similar structure twice to save in both components and cycles? If you like the min\/max questions and to see tiny machines doing your bidding, this is a good game for you.","As usual Zachtronics has not disappointed with another smooth and tricky puzzle game.","Everything you'd expect from a neat Zachtronics where you have to solve logic problems while learning drug chemistry and play a f*cked up version of solitaire. Highly recommended for puzzle nerds and\/or Walter White wannabes.","Another excellent Zachlike, a mix of Opus Magnum in mechanics, TIS-100 in design, and SpaceChem in basis.?\/10 hurts my brain.","Great Game","More Zachtronics gold.Take your time making an inefficient solution, then remark at your stupidity when you see other people's solutions.","Hurt my brain.","A short but sweet entry in the growing Zachlike genre. The puzzle concept is unique and challenging as always. Not a thanksgiving feast but a nice snack I guess?","Another problem-solving game for another new year, good but not too outstanding one. I guess Zach going big for ELIZA this year?","It's another Zach game. You already know if you'll like it."],["a good Zachtronics game. very Opus Magnum-like in how it plays.","Not all good games are Zachtronics, but all Zachtronics are good games","It's a Zachtronics puzzle game.  If you've already played others and enjoyed them, you'll enjoy this.  If  you haven't played this type of game already I would recommend starting with Opus Magnum instead.The chemistry is more realistic than in Spacechem but it's still a theme for the programming puzzle rather than a chemistry puzzle.","I can't see why this game exists. It's not terrible, but it's overshadowed on every conceivable level by its predecessors.You've got the non-existent story and minimalistic presentation of TIS-100. You've got puzzle mechanics that are closer to Opus Magnum than they are to SpaceChem, and in particular they don't seem to offer as much scope for mind-bending challenges.This is a \"worst of all worlds\" Zachlike. It'll give you your Zachtronics fix, but leave you struck with a sense of pointlessness afterwards.","Zachtronics at it's finest. A great problem solving game.","Another brilliant game by Zachtronics.  If you love logic and puzzles, this is up your alley."],["Still a good game like any Zachtronics game, but feels a bit lacking. I think it's easily the most underwhelming one yet. After Opus Magnum which was visually great but not as challenging as it could have been, and then Exapunks which had excellent puzzles and challenge and also looked great, this one looks intentionally drab, and isn't very challenging. So it's neither visually appealing nor mentally challenging. It's still worth playing if you want more Zach games, but it definitely belongs at the bottom of the list.","I'm already addicted. Good meaty challenges and very fun process"],["Thanks for showing me how clueless I can be while inefficiently over-planning simple puzzles.","Much less elegant when compared to Spacechem and Opus Magnum.Continuously undefined reactions between puzzle components resulted in a lot of confusion and frustration.Also, why does the output shape need to be exact if the bonds are correct?","This is my first zachtronics game. Awesome challenge , simple story.","I like the Zach games a lot.  They are automatic buys for me.  It took me a while to figure out the rules for this one.  I think I solved the earlier puzzles mostly by luck.  Now that I've finished the first set of puzzles, I understand it more.  In my experience, the second level puzzles in Zach games tend to go beyond my level of intellect and patience.  But I'll give it a shot anyway."],["As someone studying chemistry, this is an unbelievably fantastic way of thinking about organic reactions. For example, add two groups to adjacent double bonded carbons and you break 1 bond as well as bonding the two other atoms to the carbons. The mentioned reaction is either a hydrogen halide or hydration addition typically. Do NOT think of this game as very realistic however. I am simply saying it is a great mode of thinking for people starting to learn organic chemistry.Love the aesthetics, though this is more personal preference. Very TIS-100 style.Puzzles are satisfying to complete. This is definitely one of Zachtronics' easier games from what I've played so far.Very nice :)If you enjoy games which teach you critical thinking and puzzle solving skills AND about a certain subject (in this case,  even though very simplified, organic chemistry) you will absolutely enjoy this game.If your looking for a mind-shattering puzzle game which will increase your IQ by 120 points, you may be dissapointed (from what I've played so far, I'm halfway through. With Zachtronics' other games I have been barely able to pass the 5th level). Don't get me wrong though, expect your IQ to increase by at least 7 points.","After playing for 2 hours I felt like the puzzles weren't hard but simply annoying.There is no complexity in this game and you exhaust all of the game's features very quickly.After solving the first couple of puzzles you might as well stopbecause all you gonna get is more simular puzzles that are slightly more annoying.","Imagine a zacklike where they remove all the charm and fire the amazing graphical artist and pump the developer full of 100%-smart-but-autistic juice.    Well this is definitely the wrong direction to head in.  At this point I am only buying more games out of shear nostalgia and hope.","One of the most approachable Zachtronics games, each puzzle is small and neat and doesn't need as much programming expertise as some of the others. Highly recommended.","Another classic from Zachtronics. I'm still in the middle of gameplay, but if you're a fan of any of their previous works, this is a must-play!"],["Really interesting quasi-chemistry puzzle-game, It takes a lot of the actual basic concepts behind chemical bonds and makes it into a fun puzzle assembling complex elements from a few simple precursor chemicals with a sci fi  reactor. If you like zachtronic's other stuff you'll probably like it but it does suffer from the lack of any real tutorial levels so maybe not the zachtronics game to start with","NEW EDIT: THE GAME HAS COPYING AND PASTING USING CTRL AND MOUSENowhere does it tell you, and I found out by accident after completing all main puzzles...Zachtronics! What else to say.I have no idea how accurate it is to actual chemistry, but it sure is fun!Edit: Ok, on a more objective tone. The game has no manual and much less writing than their other works, and is more of \"just a puzzle\" than say TIS-100 or Shenzhen I\/O, whether for good or not.Some mechanics are pretty smoky and hard to understand, and there's no proper tutorial besides the first molecule(s). The order in which commands are executed, the scoring systems and some of the rules of bonds aren't explained, and you gotta go trial and error to find out whether your solution works.The puzzles themselves are very polished, but lacks some useful tools: being able to select rows, columns and pieces of commands to cut, copy and paste would be a very welcome improvement. Also \"keep editing a copy\" as a choice after completing the molecule would be very nice.The solitaire! The solitaire is not bad and on par with the one in Shenzhen I\/O, adds to the atmosphere (and there's much less of that compared to their other games) and is pretty fun to solve, at least for the first times; I'm at 7 solves and don't know whether I'll ever get to 100.An overall good game, the puzzles felt engaging to me even with the minimal writing. Buy it.","A lo-fi rip-off of Opus Magnum (by the same developer). It's okay.","Really bland compared to other Zachtronics games.","Another great Zachtronics game! As pretty much every review says, this is like Opus Magnum with the style of TIS-100. The chemistry theme is very strong and well-done, gives me flashbacks to valence bonds college days. I liked the consistency between the molecules and techniques that are in the game and those in actual chemistry. Input\/control-wise, everything is very intuitive! There is no manual to flip through for this game. But I never felt lost or unsure how I could get a puzzle done, the game is designed to allow you to test everything as you go very easily. I recommend this game!","Wouldn't recommend mostly because it wasn't what I expected.I thought it will be a game based on chemistry, but the most chemistry you will get out of this game would be one-word target molecule description, its name, and some very basic bond rules. It might've been just a colored balls puzzle.But even if to consider just a regular puzzle, the user experience is quite poor to my taste - I wasted much more time on figuring out the hell I need to do even that I would like to, and then after figuring out, I've found there is no convenient ways to manipulate sequencer (no multiple selection of symbols, drag&drop flaky, etc.), and no way to see\/edit mid-execution for convenience.","More accessible than Magnum Opus or SpaceChem.Mini-game is a pretty interesting version of solitaire, but not ber interesting."],["please bring adderall, or conveniently synthesize it here","WE NEED RESET INSTRUCTION IN OPUS MAGNUM"],["I'm a simple man.  I see a new Zachtronics game, I buy.I'm not far in yet, but early on, it's a tough call for a recommend.  If you are a Zach fan, you'll get it anyway.  If you're not, this one doesn't quite have the magic to pull you in.  There's no real explanations, not even a PDF like with some of the others, and I find myself floundering a little. So yeah, what everyone else said- lo-fi reboot of Opus Magnum.  Instead of placing arms in the field you're acting on the field from the perimeter only.  And instead of simply saying \"bond\" or \"de-bond\", you have to finagle chemical reactions by throwing hydrogen around.  Unfortunately it has the particular quality that Opus Magnum has that makes it less satisfying to me.  While in SpaceChem or Exapunks, every solution feels like a triumph, in Opus Magnum and this one, you can kind of brute force any ugly solution and move on.  Sometimes I'm embarrassed and I'll go back to improve them, but sometimes, I just leave a mangled Frankenstein and advance.I know it doesn't sound like I'm recommending it.  But it's a Zachtronics game- a programming puzzler of consummate quality and innovation.  This one just happens to not top my list.  But it's still among the best in a growing sea of Zach-like clones.","It's 7th time when Zach tries to get me divorced...Yes. Those games are quite familliar to each other, but still, it's best mind bending puzzle games I've ever played.","A new Zachlike where you make molecules but it isn't as crazy as Spacechem, shades of Opus Magnum. Very fun"],["A great way to train problem-solving and optimization, very fun."],["buy if you like other Zachtronics games"],["No, this actually feels like work. There's nothing difficult about passing the levels, just a chore."],["yes"],["Nothing will ever take the place of SpaceChem, but this gets close. Cute mix of SpaceChem and Opus Magnum.","Fun fact:  RS-232 is a serial communication standard that hasn't been updated since 1997, superceded by later standards such as USB, Ethernet, etc.  And this Romanian mad lad out here using it at the end of the 21st century.10\/10, would RP as a surly chemist again.","Surprisingly straight forward for the most part. I really wish though there were instructions or a help tab you could open, because you have to figure a far bit of stuff out for yourself. But because it's not too complicated you can get away with messing around with stuff until you figure it out. Overall it's a fun thinking game as for as I'm concerned, and very well priced as well.","I hate that the product must be the exact shape as the output image. In Opus Magnum I get it, it's alchemy, completely fictional. Here it's supposed to look like you're doing chemistry, yet a single C-C bond is rigid and can't rotate? Even in SpaceChem this didn't matter as long as each atom had the right amount of bonds to the right element. Sadly this breaks the immersion for me and I hope they fix this in the future as I see it as a bug.","If you are a fan of Zachtronics games, you should find this a great variation on the theme. If you hate them, then there's probably no reason to go for this one, unless you want to imagine yourself as a chemist with the most confusing equipment known to man.","i really loved tis 100 and this game has a similar aesthetic so i got it as soon as it was released. i'm not done with it yet but this is definitely one of the easier zach games. the only problem i have with it is that bond forming isn't as predictable as in other game since they form automatically instead of in a bonding place. sometimes you really want an atom to connect at one spot but bonds to another instead, i think there is some priority with how atoms bond but i don't think it is explicitly mentioned in the game."],["Not as difficult as SpaceChem. About par with Opus Magnum. If you enjoy this style of game you will find this a good genre piece.","Well its fun. But probably the easiest of the Zachtronics programming puzzle games. Only the last two puzzles of the main campaign require finesse. I would say it is a more restrained take Magnum opus manipulation system, that you can figure out without a tutorial or manual. Always excited for the next Zachtronics game. Though I hope they look back at Spacechem's  progression and depth it offered. I would like to something like that again.","As someone who studied chemistry in university and graduate school, I can best describe this game as a chemistry-themed programming game.  Using a series of limited commands, you can convert various common precursors to a variety of pharmaceuticals and drugs.  I want to make it clear that this next statement is not a detraction from the review of the game!  While the choice of precursors is pretty accurate as far as what would be available to a clandestine kitchen chemist, the actual reactions and steps are nothing like the real organic synthesis  steps (which frankly is probably a good thing for public safety!)  It's a great game (a little short, but there's decent replayability, as there's always a way to streamline your syntheses).TL; DR - don't go into it expecting to learn much in the way of chemistry, but it's a tight, fun programming simulator with chemistry window-dressing."],["I have absolutely zero competence in science and I had never played a programming game before, but I enjoyed every moment of MOLEK-SYNTEZ. The first hours were very confusing, but redoing the easiest puzzles was the way to learn new things and to proceed forward. The game is very satisfying. It was a great introduction to the Zachtronics games.","If you're familiar with Zachtronics games, you already know what this game is by the description.... a cross between Opus Magnum and Spacechem, with appealingly ugly TIS-100 type B&W graphics.For those not familiar with Zachtronics....  These are puzzle games.  HARD puzzle games.  This is for people who like their intelligence challenged.  This is for people who love staring at a screen for 2 hours, trying to figure out a problem.  These games are punishingly hard.  I own all of the Zachtronics games... and I've only 'beaten' 2 of them...  But i keep playing, because it's a good kind of pain.  I won't google a guide.... i'll keep staring at that screen, and when I win, it is soooooo sweet."],["Good game.","zachtronic"],["Simple, yet challenging and amazing. It feels great when you figure out a new way to be more efficient in your creations.","If you have played and liked other other Zach-like games then you're going to like this.","I should synthesize some molecules and optimize the solutions.Instead, I start another Solitaire game and keep playing.","After the first hour: Yeah, this isnt a different mode for Opus Magnum, this is a second Zachtronics game, and again its not exactly a programming game, even though it kind of is. I will admit, I havent played enough of Molek-Syntez, but I do want to play more. Im not yet ready to say if this is on par with all of Zachtronics work but I also will say if you like his work, check it out.The whole game has you making drugs by manipulating molecules and trying to form the right bonds. Its nerdy but again I mean programming games, alchemy games, you already should know how these games go. It still has a great feeling to it especially when you solve a puzzle and then you get a little more if you try to master those puzzles on the leaderboardsIf youre interested enough to grab Opus Magnum, play it a bit, and if you love it, consider this one. Its solid, but I think its a bit deeper and more challenging than the other games by Zachtronics, so beware.Video review: https:\/\/youtu.be\/6o4O35CD768"],["Synthesize everything."],["A mind crushing puzzle game, come for the chemistry, stay for the solitaire"],["I've loved several Zachtronics games, including SpaceChem, but Molek-Syntez didn't click with me.Its presentation is utterly drab, and its narration vague and nigh-nonexistent. And even its gameplay frustrated me. Puzzles start and end with real molecules - this may be realistic in a certain sense, but from the perspective of a puzzle game, the resulting inputs and outputs felt arbitrary, convoluted, and unnecessarily big.I also found some peculiarities of the set of available commands rather annoying: for instance, you will frequently have to use the same \"remove\/add bond\" command 3-4 times consecutively, which feels aesthetically unsatisfying in a game genre based on optimization and automation. The way the game deals with clashing commands (e.g. when you simultaneously try to move a molecule and remove a bond) also felt very inelegant to me, as did the inability to rotate the particle beam emitters.One criterion by which I judge this genre is whether I feel motivated to return and optimize earlier levels, and that didn't happen here at all.Ultimately, Zachtronics have made enough great games that I personally don't see a reason to play or recommend this one."],["fun game in the classic zachtronics style. there are a few frustrating shortcomings, for example in my opinion it should be possible to reflect precursors, but overall it's a great game"],["All of Zachtronics games are exceptionally made, challenging and fun! If you're a fan of his other games, then this is a great addition to your collection (In fact, I think it's my favourite). If you haven't given Zachtonics games a try, then this is an excellent first choice!I find that this game is a bit less challenging than some of the other games within Zachtronics catalogue (TIS-100, Shenzhen I\/O -- Even with my developer background I've never completed all of the challenges on these games [yet]). Here, I feel like there's enough flexibility to complete the challenges (Although, you may be in the bottom percentile!)"],["chemistry but funny","Molek-Syntek is a Zachtronics game in the vein of SpaceChem and Magnum Opus, where you're using a set of programmable operators to pull apart and rebuild atoms into different atoms. You have a restricted instruction set from your modules on the outside of the playing area, with up to 6 modules able to give instructions. You also have a limited number of total instructions before it returns to the top of the instructions - this happens en masse so you can't have a module doing the same set of instructions faster (without putting the instruction set in multiple times), but also avoiding sync problems.There is a story of sort, but it's more of a mood piece than anything, with snippets of the chemist's private thoughts coming in after completing so many levels. Combined with the stark black and white aesthetic, the setting feels bleakly eastern European or Russian, about a chemist finding some level of power in restoring drugs to what seems to be some kind of post-apocalyptic world.Ultimately the story never really amounts to much, and is not continued into the bonus set of puzzles. Mechanics-wise some of the early levels are quite easy and a player would be well-advised to try and match the best cycles, modules and programming symbols used stats (noting that your best stat from each solution is used, so you can optimise however you like).As I progressed to the later levels I found myself content to just get to a solution however I could within the constraints of the programming environment.There is also as is traditional a solitaire game to play when puzzle solving gets too stressful, but I bounced off this one for whatever reason - it's functional but I personally preferred some of the other Zachtronics solitaire games.I very much enjoyed the puzzles but I would have appreciated some more story. An ability to revisit the story parts as text or similar would have been a nice feature too. The bleak mood is well conveyed by the elements of the game, including the subtle background sound evoking a life in a desolate tundra. Ultimately if you haven't played Opus Magnum I'd start with that over this but for those who enjoy the Zachtronics puzzle formula you won't be disappointed here."],["Classic Zachtornics game. Good fun solving logic puzzles.","Not only does Molek-Syntez have chemistry puzzles, it also comes with solitaire!https:\/\/steamcommunity.com\/sharedfiles\/filedetails\/?id=2127191324This solitaire provides single \"holding area\" locations for out-of-place cards implicitly on the stacks themselves - which locks the stack.  Very innovative idea for solitaire - I hope I master it some day (currently I play it rather poorly).Note: You don't have to play solitaire alone.  You can have friends sit with you and complain about how bad your moves are.  But generally I play it alone.  :)"],["Come for the puzzles, stay for the solitaire\/freecell hybrid card game"],["Superb game! Really recommend for those who actually like to think while in puzzle games.","tl;dr: Buy SpaceChem or Opus Magnum (or go play The Codex of Alchemical Engineering)I'm sorry to refund a Zachtronics game, it's a first for me, but this one did not meet my expectations. Feels kinda rushed, maybe because of the coronavirus outbreak... I will check back to see if the issues detailed below are fixed in any way.My biggest issue is poor in-game (what does 'modules' mean, exactly?), and complete lack of external (remember SHENZEN I\/O's book of reference?) docs.The puzzle design is troubled too: there's no way to introduce \"mirrored\" (ie. non-Z rotated) molecules, neither are mirrored output molecules accepted. The order of operations is of precedence, not  in numerical order of the emitters, and as there is no docs or tutorial, it is left to the player to find out by trial-and-error.  Outputting (the 'c' command) on a specific emitter does not output the molecule in the line of sight of said emitter, but the just-auto-imported base molecule (idk, this feels like it's a bug, but again, such things couldn't happen in spacechem since you control the input).","Solitaire with a twist, I like it. ...what? Molecules? I have no idea what you're talking about.","ok","I don't really hesitate before picking up a new Zachtronics title. SHENZHEN I\/O, Opus Magnum, and EXAPUNKS are some of my favorite puzzle games of all time. Even TIS-100, as minimalistic and esoteric as it is, was interesting to play.This game has none of the elements that made those previous games good.There's nothing about this game that's obviously bad, but there's also nothing really interesting about it. The result is that MOLEK-SYNTEZ just ends up feeling boring. The puzzle mechanics are quite limited, with most puzzles just having you do the same thing over and over. It ends up feeling like a repetitive chore. I've had to force myself to open up the game and do some more puzzles to see if maybe it gets good later. It doesn't.After having not played the game for a few weeks, I feel zero desire to pick it up again.Presentation wise, the game resembles TIS-100: extremely minimalistic. It's just a grayscale UI for selecting puzzles, really. There is no story, or any sort of window dressing for that matter.One positive note: the drone-like ambient music is some of the best in any Zachtronics game. I've always found the puzzle music too intrusive in previous games (looking at you, SHENZHEN). You need something calm if you're going to do some thinking, and the music in MOLEK-SYNTEZ is perfect for that."],["If you are new to Zachtronic games it's probably a good entry point since puzzles are much easier than in its predecessors. Keep in mind that it is \"Zachtronics easy\" not \"regular easy\" though. If you aren't new to Zachtronics games, this game is basically simplified Opus Magnum. It is OK as long as you expect more of  similar stuff. Even late bonus campaign puzzles are not that challenging as those from mid-campaign of Spacechem or Infinifactory but otherwise satisfying and pleasant to play.Solitare is meh this time.","Like most Zachtronics games, the fun is in the assembly of the pipeline. You will not have fun if you don't like building processes.","It's a Zachtronics game, you know what that means. If you don't stop reading this and go buy Opus Magnum instead.Still here? OK then. This is a bit like SpaceChem, a bit like Opus. The manipulators operate on line of sight instead of grabbing objects. There's nearly zero tutorial. The presentation is, as you can see, austere. Not exaggerating, there's no tutorial. Make yourself familiar with Zach's other games before attempting this one.","I liked Exapunks better but this is a nice twist on this programming puzzle micro-genre.","Another worthy addition to the Zachtronics programming puzzle collection."],["I like it a lot. I actually would be even more fascinated if it would go deeper into the chemistry part. I often act like wikipedia is the docs of this game, researching different drugs and educating myself on their behavior. Very funny game","If you liked Opus Magnum, also from Zachtronics, you'll like this one as much.","This game is a slimmed down, TIS-100-ified version of Opus Magnum, also by Zachtronics. There's no story, a minimalist UI, and very limited mechanics. I recommend you play Opus Magnum instead.","BRAIN HURT BUT FUN"],["The best gameplay mechanics from SpaceChem and OpusMagnum combine to make something that  resembles chemistry moreso than either predecessor. I'm impressed there's so much game for just a few simple mechanics.","Most disappointing Zach game.After producing games of ever increasing polish this one doesn't feel like it fits the series but was a massive step back. While didn't love Magnum Opus as much as the other ones it was still a great game.Molek feels like a 48hour game-jam alpha version of Magnum Opus. Of course it isn't and it's more polished than that and for a die-hard fan of the Zach games it's still ok. Just everything else is way better and more worthy of your time."],["Very Zachronics puzzles, but with minimal story compared to there other games."],["Stumbled upon a Zachtronics game I hadn't heard of... Lucky me. This is just what I was looking for!","There's no manual. No tutorial. No guidance, whatsoever. At the same time, rules about certain things in-game are extremely obscure. I've seen many say, you're supposed to find out stuff by experimenting. Well, that's all well and good, if the rules of the game are actually penetrable.Some in this game one really aren't, except either by chance or extreme investments of time. I felt quite quickly like this game deliberately wastes it. There are too many better puzzle games out there for this one to be worth your time - by Zachtronics, no less.","This was a fine Zachtronics game. It filled the void though I wasn't as immersed as with SpaceChem or Opus Magnum. This was a bare bones version of those with a slightly different mechanic. Modestly challenging at times, but without the \"Eureka!\" moments the other two provided. A bit more storyline would have added something to it, and the solitaire was also kind of blah. Once beaten, didn't care to try it again, unlike Opus Magnum's more addictive solitaire mini game.Overall, I give it a B. I'd much rather ZT released expansions to Opus Magnum and Infinifactory."],["Very solid problem solving game (not puzzle). I would check out Zach's other games if you enjoy this one. They are: SpaceChem, Infinifactory, Opus Magnum, TIS-100 and EXAPUNKS."],["good in terms of gameplay but not worth 10 dollard"],["A game about manufacturing molecules while trying to maximize different efficiency metrics. Very minimal artstyle, mimicking an old-school terminal."],["This game doesn't hold your hand. Heck, it doesn't even give you a manual. It's up to you to discover the game mechanics by testing things out. Bad solutions aren't too punishing since you can just hold right click and wipe away all the instructions, and the total amount of instructions to complete a puzzle are typically small compared to some of the other Zachtronics games. Because of this there's no scrolling; your whole solution is immediately viewable on the screen.Once you figure out the game mechanics, the puzzles are probably some of the easiest in aggregate out of all Zachtronics games, though I feel like they get a little bland around the center of each campaign since the chemicals I'm creating sort of blend into each other and there aren't many new concepts introduced in that time. It wasn't until later in each campaign that I felt like I needed to learn clever techniques and tricks to actually solve the puzzles.Generally the way the game was designed makes me feel like a scientist, since it's just me and the equipment, which I just love, and the overall mood of the game matches this pretty well. The story line was a bit too edgy though, and one point I couldn't stop laughing because it started to feel almost satirical.Optimization is really interesting in this game, the second puzzle actually has like 3 different solutions that get successively crazier and more complex to shave off those last few cycles. I have not tried optimizing all the puzzles, but it certainly has felt like a unique experience compared to the other games trying to see just how tightly all of my instructions can be squeezed together.Overall Molek-Syntez is a solid installment of the Zachtronics games, and it works especially well for the players that love to just sit back and explore what this chemistry machine is capable of."],["TOP as always"],["SpaceChem + Opus Magnum.I'd say that if you haven't played either of those 2 games, go play them first. If you want more similar content, then come and buy MOLEK-SYNTEZ. While the mechanics are obviously a bit different, the whole feel and theme is really similar - \"here's a machine with this kind of instructions available, program it to build whatever is needed\". But I also think that the games mentioned above work better as an introduction to Zachtronics games.Overall, I got exactly what I expected from the game. While it's not the best Zachtronics game I've played, it's a nice addition to the \"series\" and still among the better puzzle games I know.Just a disclaimer though: simply completing the puzzles can get a bit repetitious, since many puzzles (especially in the beginning) can be solved in quite a similar manner. Optimizing the puzzles for the 3 different leaderboards (speed, minimum parts, minimum instructions) should be considered as part of the game, as the optimization process is vastly different in all puzzles.","Disappointing for a Zachtronics game.  Most of the puzzles seemed similar and getting the bonds to work was very frustrating","Best solitaire game I've ever played, the puzzles are pretty good too."],["Did Zach phone it in for this one? Kind of, yes. Did he reduce the price accordingly? Also yes."],[null,"You can syntez molek. The moody atmosphere and pared-down story were enjoyable to me. Less is more, as they say. Without making comparisons, I think this game stands on its own and, having completed the main campaign and now planning to do the bonus campaign, I can say is without a doubt a worthwhile experience.Oh and it introduced me to solitaire, so there's that as well.","the solitaire is harder than the actual puzzles ngl","This... This is good stuff."],["Yeah the puzzles are good but come on you gotta get this game for the Solitaire","i find this even better than opus magnum, which is great","I'd recommend any game that lets you play as a Romanian man making drugs in his basement, but this one is exceptionally good in it's genre.","Loved it : puzzle mechanic, atmosphere, solitaire (as usual a marvel on its own), everything ! Playing with real-life molecules was tremendously fun."],["Another great puzzler from zactronics. So many ways to solve each puzzle."],["I like to think Philip K  would have loved this game.A great distillation of the zachtronics style. It won't win anyone over, it's a tasty treat for fans that are already in the bag.","Pretty good puzzle game.Optimizing your solutions is fun, and the puzzles are not \"so hard you give up and stop playing\" like that one puzzle in Shenzhen IO.Unlike some other Zachtronics games, this game doesn't come with a manual, and you don't need deep knowledge in programming or chemistry to play.The first two levels act as a tutorial, but the tutorial doesn't intrude on the board like the first few levels in SpaceChem.","Zachtronics"],["Needs more angry pyramids"],["me like"],["Ketamin","Zachtronics. Fun a usual.","This game is hard core. Where Opus Magnum took major strides in user friendliness, clarity, convenience and overall polish, with this game, Zachtronics does a 180 and goes the opposite way. It is obtuse, alien, cryptic, retro, and completely devoid of tutorials. Figure it out as you go by trying every button or by applying previous knowledge of Zachtronics design idioms. As per usual, it allows you to create a non-optimal solution and move on to the next puzzle, but I feel like that approach misses the point of this type of game. When trying to optimise your solutions, the mechanics feel claustrophobic compared to the previous similar titles, and you quickly run out of instructions, space, or arms, creating truly brow-furrowing puzzles. That's what I love about this game. Also, the music (or \"ambience\" as the settings menu calls it) is great.Opus Magnum is still my overall favorite between the two, but this one is great in its own right.","MOLEK-SYNTEZ feels a lot like a sequel to Opus Magnum, albeit with one very significant change. You get to pick your own reagents. This makes your solutions feel a little more like your own. It makes you feel more connected to the in-game character, a clandestine chemist, who would presumably have at her disposal several reagents. This is something that was not present in Opus Magnum, where the Alchemist character would probably have access to more reagents than what each puzzle gave you. Admittedly, Opus Magnum always justified its restriction on reagents, and from a gameplay point of view this restriction might make for more interesting puzzles. But there is some merit to just giving the player a whole arsenal of reagents to choose which ones are best for the puzzle at hand. In a sense it expands the arms and glyphs system of Opus to the atoms as well. The main campaign is much shorter than Opus, and maybe because Opus was my first Zachtronics game, MOLEK-SYNTEZ felt much easier to solve, with optimization bringing about massive gains in each score metric. My first solutions on MOLEK-SYNTEZ were so atrociously inefficient that they just begged to be optimized, while that was not true in Opus. The story is very trimmed-down. It felt as a series of haikus told one verse at a time. It is so minimal I wouldn't even consider it a real part of the gameThe visuals are similarly simple, although I must say the mechanical sound from starting the game is insanely satisfying. It's a good game. If you haven't played Opus, play that instead. If you have only played Opus's main campaign, play the production alchemy and the diary puzzles from that game instead. If you find those more hasslesome than they're worth, play this game. I would give it a 6\/10, because the game doesn't feel complex or deep enough to get away with such barebones presentation. It's a lot like Opus Magnum, but without all the aesthetic spectacle.","."],["Fun, friendly game control with logic elegance, very Zach","I suggest playing this after Opus Magnum. It's a tad more difficult than that game, but only a tad- certainly not as much as its spartan aesthetic would suggest. The ruleset is interesting and different enough to feel fresh, and watching your solutions go is as satisfying as ever. In my opinion it gets a little bit repetitive by the later puzzles, but only after several hours of play, so no big deal.Most importantly of course, the solitaire is good, if quite difficult.","another great game from these guys"],["Hey, this is a good puzzle game!the puzzles actually get difficult, but its a cool intuitive idea with a pretty easy UI so thats a win7\/10 gg zach"],["good solitaire game","Another solid Zachlike. This is kind of a combination of SpaceChem (for the theme: chemistry), Opus Magnum (for the gameplay: it's the most similar) and TIS-100 (for the art style).Like Opus Magnum the puzzles are more open and you have more space to optimise what you like. I found them to be interesting on the main campaign, it gives you a good feel when solving it, though it's not as nice as in Opus Magnum where it also looked so good while running your algorithm. Definitely recommend this for puzzle fans.I found the solitaire minigame to be super good, though not as good as Opus Magnum's minigame, and that's one thing that I (shame on me) usually don't play much on Zachlikes. It feels challenging without being unfair. After playing a while you get the hang of it, and when you lose, it's usually your fault and not just pure bad luck.I'd say this is a toned down version of Opus Magnum in every aspect: gameplay, minigame, style, story. Which is not a bad thing, as Opus Magnum was a quite superb game."],["bzzbzz fake chemistry, its really fun though"],["MOLEK-SYNTEZ is a great game but I think its a better learning tool for programming than chemistry as the synthetic routes taken to get to the target molecule are unconventional and in most cases metaphysical in nature. It does however do a relatively good job at teaching atom economy in an abstract way! Zach-likes are great because they actively demonstrate and challenge you to come up with multiple solutions to a problem. There are so many different ways to look at in terms of making them more efficient - I love how ridiculously slow the 1 emitter solutions are when you play back the GIFs and videos posted online."],["like skyrim but with atoms"],["Molek-Syntez is a quintessential Zachtronics game where you try to make chemicals with up to 6 manipulators using some precursor chemicals, and you are rated for minimal waste, as well as speed. However, the lack of a manual and the super-plain monochrome UI may be a bit off-putting compared to its flashier cousins like SpaceChem or even Opus Magnum. You are asked to program the synthesizer to make variety of chemicals. There is a primary series, and a set of \"additional puzzles\" to keep you going. There is a thin backstory, as the chemicals you make starts pretty innocent, but soon goes into... some questionable pharmaceuticals. The game is challenging in that you have to move on a hex field, but your manipulators are on the OUTSIDE looking in, so it can only affect something it is pointing at directly, without something in the way. You mainly deal with chemicals by adding or removing hydrogen items. You can remove something by adding enough H so it becomes a standalone, or move H to force it to bond with something nearby. There is even a shunt function that can push the H onto the next molecule over. You can also move your emitters left and right, as well as pull or push. The trick of course, is how are you going to divide up the cutting and pasting necessary to create the proper molecule you need with just the precursor chemicals you have, as well as move them into position so they can bond properly, AND do it in the minimum number of steps\/cycles. Whilee there is the typical historgram, somehow the bare minimum UI just doesn't feel as... engaging. It's recomemnded if you like the genre, but players new to the genre should play SpaceChem or Opus Magnum instead.","Opus Magnum might be a better place to get started with Zachtronics, but I think I might like this game better. This game is much more constraining in terms of what the player can do. There is limited instruction space, and you can only have a limited number of arms. Even those arms must always be on the edge and cannot rotate. I think this leads to more of a barrier on \"passing\" a level, which I prefer to games that feel like most of the challenge is in the optimization. That isn't to say that this game is hard (it is definitely much easier than some of Zachtronics early games), but it does change the way that you approach the problems and makes it more likely that you will need to completely restart a bad solution.This game is mostly about taking things apart. The inputs on all of the problems are much more complex than in Opus Magnum. The main consequence of this is that you end up with fuller boards without needing to go through the sometimes tedious early process of creating the large pieces that need to be manipulated.The gifs that this game makes are also very nice; a good advantage over something like TIS-100","I should be doing my organic chemistry homework right now"],["I'm a big fan of the zachtronics style puzzle games. This one is pretty much the worst of them all.I don't really think it's a bad game but compared to the other ones, it's clearly the worst."],["This is possibly the best Zachtronic game. All puzzle, very little plot. Thoroughly enjoyed."],["Another masterpiece from my favorite game company. Totally atmospheric and just plain fun for people who like this kind of thing. I hope these guys never stop making games."],["Loved previous titles from Zachtronics and while I certainly it enjoyable for a bit, in the end MOLEK-SYNTEZ fell kindof flat for me unfortunately. Gameplay and art design felt like a mashup of SpaceChem and TIS-100, and as those were two great games I very much enjoyed, there was certainly fun to be had here in advancing through the puzzles and optimizing my solutions. It's a double-edged sword though, as there were aspects of MOLEK-SYNTEZ that I thought were executed much better in SpaceChem (eg actually having control of when reagents enter the chamber), and reusing the exact same menus and progression from TIS-100 made it feel like the author was either rushed or couldn't be bothered to give this game a theme and soul of its own.I'd still definitely recommend this game if you're a die-hard Zachtronics fan, but wouldn't say it's worth full price if you've played the previous games I've mentioned, as a lot of what's here you'll have already seen before, arguably done better. Otherwise, if you're not a die-hard and this looks like something you might enjoy, then by all means give MOLEK-SYNTEZ a shot."],[" "],["Not quite as polished as the other Zachtronics titles but worth the money and time still"],["addicting af"],["I would really like to have one of these at home.","Another fantastic Zachtronics puzzle game."],["One of the slightly easier zach games, but with all the charm or previous titles."]]}